{"backend": "tensorflow", "config": [{"config": {"mask_zero": false, "dtype": "float32", "trainable": true, "embeddings_constraint": null, "input_length": null, "activity_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "batch_input_shape": [null, null], "output_dim": 128, "name": "embedding_6", "input_dim": 6954}, "class_name": "Embedding"}, {"config": {"rate": 0.1, "seed": null, "noise_shape": null, "name": "spatial_dropout1d_6", "trainable": true}, "class_name": "SpatialDropout1D"}, {"config": {"merge_mode": "concat", "layer": {"config": {"kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_6", "unit_forget_bias": true, "unroll": false, "units": 128, "activation": "tanh", "return_sequences": false, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "implementation": 1, "go_backwards": false}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_6"}, "class_name": "Bidirectional"}, {"config": {"kernel_regularizer": null, "units": 2, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "dense_6"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "2.1.6", "class_name": "Sequential"}