{
    "Comment": [
        "I am new in share point. I dont know what to do and how to do.",
        "Then go read a tutorial, then come back here when you have a _specific_ question.",
        "-1 if you are new to SharePoint, try using the out of the box features first. You \"want\" to use JavaScript, but do you actually need to?",
        "This isn't a place to have your script written for you. Search for perl `open` on how to open and read your file. You'll probably need some regexes to figure out what's a heading and what's a variable.",
        "see http://stackoverflow.com/questions/2014862/how-can-i-access-ini-files-from-perl, would tell you how to read the **configuration files**.",
        "For starters why have 4 tables? Why not have 1 with a login type field??",
        "You shouldn't be asking the question how to make the login page, but more on how to come up with the correct SQL to check your login. Retag your post with the type of DB you are using and you may get better answers",
        "use regex [http://en.wikipedia.org/wiki/Regular_expression]",
        "You don't even need Regex for this.",
        "This question is far too vague.  You need to show some work.  What code have you tried?  What research have you done.  It will be closed otherwise.",
        "That way it will simply not do anything for 1 second. That is not what is being asked.",
        "Sure, it's a totally wrong answer if you understand the question, but the question was easy to misinterpret. I understand 15 upvotes for @JopV.'s comment. But 24 downvotes for the answer itself? Sheesh... what's with all the hate?",
        "try doing some googling and trying please",
        "Please ask some quality question. You can easily get answer from any search engine.",
        "I think you need to read up on some PHP basics. I think you understand the basic idea, you just need to figure out when to use what function for what purpose.",
        "Why on earth are you doing three different queries to get data from your `members` table?!  You're selecting a field you already have in the first query, some (not necessarily related) user's encrypted password in the next query, and then you're selecting *every single userid* in your members table.",
        "You should do 1 query to check all posted values, ditch this code and start again..",
        "@Crontab I'm new in php, thanks for your advise..",
        "`if(empty($uname) && empty($pass))` should be `if(empty($uname) || empty($pass))` Otherwise the statement gives TRUE when you leave one empty",
        "@user1295995: It's not really just a PHP thing, it's a \"working with relational databases\" thing, and sort of a basic logic thing, too.  Write out what you want your code to do, verify that it makes sense and you're not adding a bunch of extra steps, THEN write the actual code.",
        "Happy to.. http://nodejs.org/",
        "any code or script........!",
        "what did you try?",
        "Are you using the jQuery Ajax function to get your XML?",
        "Well, what syntax are you talking about?",
        "http://www.roseindia.net/techindex/Iterate-a-List-in-Java.html (\"first hit\" on google; this is why you are receiving -1's)",
        "I could find something on [The Code Project](http://www.codeproject.com/Articles/15934/How-to-convert-a-numeric-value-or-currency-to-Engl)",
        "And also on [stackoverflow](http://stackoverflow.com/questions/2729752/converting-numbers-in-to-words-c-sharp) Did you google this?",
        "extend this for doubles: http://stackoverflow.com/a/3267/284240",
        "I didn't try anything. I thought that there is a buil-in method for doing this.",
        "does `string.Substring` not do what you want?",
        "How do you want to handle these strings? a) `xx #welcome #welcome` b) `xx # welcome #welcome xx`, c) `xx ##welcome xx`",
        "I found solution:\n\ns.IndexOf(\"#\");",
        "\"Which is better, a computer or a piece of bacon?\"",
        "You asked this question before even reading the websites for the two frameworks...",
        "Did google not help?",
        "OMG, not again, do your own homework... I'd recommend start reading a Python or CS tutorial/book...",
        "This is not homework. No need for the rude replies. I am just intrigued.",
        "@JoeBarry while KurzedMetal comment was uncalled for, you did not put enough effort in your question. You have to do some research on your own before posting. And you need to show the things you tried. Please check http://stackoverflow.com/questions/how-to-ask for more information",
        "Yes you can but you haven't provided enough info. How is the new one created?",
        "`document.getElementById('yourtable').innerHTML = '<table><tr><td>tada!</td></tr></table>';`",
        "Well in general; Have a trigger and replace the current table HTML with a new one. Easy right :D",
        "Doesen't rly matter how it's created, I guess directly in JS code would be the easiest way.",
        "The asker was looking to add a class to an element, not to replace it.",
        "This helped me even though it didn't answer the question.",
        "How is this parallel at all? That's totally sequential. I don't know why OP accepted this as an answer.",
        "There are cases where renameTo() does *not* work reliably; that's the whole point of the question.",
        "I don't see any question, neither any description of what you've tried so far. Voting to close the question as not a real question.",
        "You should have just tested.",
        "whenever you learn a new language, the first thing you should read are the operators. read the reference before posting",
        "If `x == 0` then you might as well just have `-y` instead of `x-y`",
        "SO is not your blog. What does it mean to \"learn jquery BEFORE javascript\"? That makes no sense.",
        "Non sequitur.  Thanks.",
        "People always seem to forget that JavaScript !== the DOM...",
        "*\"I think jquery is far more than just a javascript library...\"* No, it's just a library.",
        "what is your css/browser/html",
        "Is this a display(style) issue or PHP?",
        "I've changed the title to something more appropriate since no-one really _cares_ how urgent you think it is - urgency is reserved for _paying_ clients :-)",
        "Creating what form? where the debug fired the error? this is sooooo easy to fix, if you debug the code! too much code -1",
        "This may sound obvious, but if you look at the inner exception it will likely tell you what error is not being set.  This is almost certainly caused by not instantiating an object.  If you don't know how to check the inner exception, which line is it crashing on?",
        "By looking at your Inner Exception you should be able to find out what line your problem is on and from that what is causing your problem.",
        "You've posted dozens of lines of code consisting of `Something.Hide()`, and dozens of commented out lines of code, and a ton of unrelated code. Please edit your post to remove all the noise and junk, and reduce it to the minimum needed to demonstrate the problem, and then ask an actual question.",
        "You probably shouldn't post your database password to a public forum.",
        "possible duplicate of [What is a NullReferenceException and how do I fix it?](http://stackoverflow.com/questions/4660142/what-is-a-nullreferenceexception-and-how-do-i-fix-it)",
        "If these get function are from the same database I would suggest doing the joining using Linq2SQL or entity framework rather than in memory.",
        "We ain't doing your homework for you. Show us your code, explain what problem you're encountering and then we can help you.",
        "why it is **2012-04-06T22:06:19** instead of **2012-04-06 22:06:19** ?",
        "because of time portion if i dont use -(dash) it is not true",
        "Why are you using dynamic SQL?",
        "Can you please do a PRINT @sql and see what does that give you?",
        "because of so many tables. i have a another  field TableName that is input parameter",
        "i have edited my procedure , please see my procedure a gain",
        "What is the trailing `and` for? Where do you use `@SearchString`?",
        "i dont have any problem with SearchString. SearchString is a parameter that use after converting datetime.my problem is converting",
        "What's the name for #f3221c?",
        "Don't know about you, but I'd prefer using more than these colors: http://www.w3.org/TR/css3-color/#svg-color",
        "thanks for response! we have ability to launch an app from another app. pls see answer in my post, maybe this help you in the future.",
        "why do u think controller also needs to be prototype?",
        "This is just plain wrong.",
        "you can do it! look up  modulo",
        "Very basic question that smells like homework.",
        "but anyway, the idea was to do this without converting to a string",
        "oh.. why -1? can explain?",
        "@Jack - You need to understand how to accomplish it.. someone else doing it won't help. I really suggest P&P - paper pencil",
        "this it how it works in uiviewcontroller NOT UIView...",
        "This answer doesn't absolutely reflect the point of question... the asker wants no view controller.",
        "correct answer is here  http://stackoverflow.com/a/4502761/2757496",
        "Where do i need to insert this piece of code. on jsp?",
        "Wrong, wrong, wrong.",
        "This does not what the OP described he wants to.",
        "It's not possible to embed an serverside Application, i.e. exe file into a JSP. You can embed an Object tag `<object id=\"msword\" width=\"100%\" height=\"100%\"\nclassid=\"CLSID:00020906-0000-0000-C000-000000000046\"\ndata='http://localhost/testword/test.doc'>\n</object>` into your JSP. This will open embed the Application into the page. It requires the client to have the Application installed is not really a part of the JSP it's part of the rendered HTML Page.",
        "Yes i want to do something of this sort only. I have downloaded the exe. Now i want to run it on my jsp page",
        "I have considered Singletons, however, I've read that DI is the way forward.",
        "DI is a good solution however, but IMO it has much more better realization in Java (i.e. [Automatically injected dependency](http://en.wikipedia.org/wiki/Dependency_injection#Automatically_injected_dependency)), not in PHP itself",
        "-1 for the use of 'globals'.",
        "@RepWhoringPeeHaa Explain your opinion.",
        "@Botanick I believe I already did. Globals are bad and what you have in your code are fancy globals. I suggest you watch the videos in teresko's answer.",
        "{{include('myfile.php')}} gives me a the function doesnt exist  {% include 'myfile.php' %} gives me a Unable to find the template",
        "@JhovaniC What actually kept in your myfile.php ?? Is it a template ?? Can you post the myfile.php ?",
        "Thanks for your answer. BTW. You might wanna check this out: http://w3fools.com/",
        "The window has its own standard. Please see my answer for a link.",
        "Just in case anyone reading this answer in the future thinks it is correct.. it is not. MattMcDonald's answer is *leaps and bounds* better than this. Also ***NEVER*** listen to w3schools. They do not know what they are talking about and will misguide you.",
        "I've set Matt McDonald's answer as the accepted answer. Thank you!",
        "Ouch - I should have spent more time on my answer.",
        "There are C# to VB.NET converters on the internet that can give you a big head start on a lot of this stuff...",
        "OK, so you've told us the query and that you need help.  Neither of those things are questions. **What's the question?** What part are you having trouble with?",
        "The biggest problem is the line with the select...",
        "Does the original c# code work as expected? Because otherwise it would not be a conversion problem at all.",
        "Try to read this https://msmvps.com/blogs/jon_skeet/archive/2010/08/29/writing-the-perfect-question.aspx",
        "then what's the problem? Spam filter?",
        "i think you are looking for some Mass mailer programs available , you may google for it, i think http://www.massmailersoft.com/ should suit you",
        "@Akash Yadav: Thanks a lot, but Is there a freeware tool",
        "@JustMe i think this might suit you http://pommo.org/Main_Page",
        "If you have 3000+ customer - why do you need a **freeware** to send them mail?? Don't those customers **pay** you so you could sign up for a commercial service??",
        "he wants to do it programmatically, not through config",
        "What's your goal in doing this?",
        "Why do you want to do that?  If it's something like having a user type 1 to refer to the first item, just subtract 1.",
        "I don't know Java, but if there is a way (which I doubt), don't do it.",
        "okay, maybe its really not the best way...changed decision",
        "Have you tried it?",
        "Did you forget to have *coffee* today?",
        "`<`, `>`, `>=`, and `<=` only apply to primitive types.",
        "@Jeffrey:  `String.compareTo()` and `String.compareToIgnoreCase()` returns an int (which is primitive).  So technically you're right...",
        "Haha! Interesting question. The < operator hasn't been overloaded for `String`s, so this wouldn't work in Java at all.",
        "I did, and it didn't work. I know there is the compareTo() method but I am also confused on how that works. I am a true newbie sorry:(",
        "You could have asked this question in more general terms, for exsample \"How to compare strings in java?\".",
        "@hardyz009 You seriously should revise the way you're asking questions and reflect how SO works. What did you try so far? Did you try anything at all (Google for instance)?",
        "what did you attempt?!",
        "The question about Chrome/Webkit.",
        "I still find this helpful.",
        "Welcome to SO. What have you tried? Please show you nonworking code and specify what is the current output and what is your desired output.",
        "Have you considered hiring and paying a programmer?",
        "@jeremycrews - Don't be so rude as to ignore comments and suggestions from people who are trying to help you help yourself.",
        "C# absolutely has the ability to rename files.",
        "I am speechless",
        "that gets the things that chickfila likes; not who likes chickfila.",
        "Yeah, you are right. But we get user_id which is used for get name",
        "Why are you using public key encryption, and why are you using sn.exe to generate your keys? What is security threat are you trying to protect against?",
        "possible duplicate of [How to import an .snk file generated with sn.exe in .NET?](http://stackoverflow.com/questions/3095355/how-to-import-an-snk-file-generated-with-sn-exe-in-net)",
        "\"Fix this program\" is definitely not a nice way of describing your problem. You need to correctly pinpoint and describe your problem to get good responses",
        "What's the expected outcome (or output) and what's the actual? In other words, what's your problem?",
        "Sure!! It's changed!",
        "Output: Consumed item: 1\nConsumed item: 4\nConsumed item: 7\nConsumed item: 10\nConsumed item: 11\nConsumed item: 14",
        "and should be :Consumed item: 1 Consumed item: 2 Consumed item: 3 Consumed item: 4 Consumed item: 5 Consumed item: 6",
        "Why do you expect the o/p in that order? The threads are allowed to run in any order as they get scheduled, You are not providing any synchronization which makes them follow the order you desire.",
        "@PavanManjunath We've fixed the question instead.",
        "Please note you are recommended not to use the mysql_ functions any more. Please use mysqli_ or PDO instead, and use prepares statements as this will help you with your db escaping/SQL injection protection.",
        "Please create a reasonable title/subject.",
        "You're code is only going to run one time ... what are you intending to do?",
        "I'm so sorry, but I gave you an upvote just for the title.",
        "upvote means *\"This question shows research effort; it is useful and clear.\"* And at least 5 people on StackOverflow think this question meets that criteria.",
        "He's asking about actually moving the user's caret to the element, not just styling selected elements.",
        "This isn't of any help.",
        "IMHO Thats strange to have operator+, which returns list&. Semantically its like operator+=, which should modify its lhs. It's better to change the name, or to have list operator+, which constructs new object.",
        "[Sample code](http://sscce.org/) should be complete and concise–enough to recreate the issue but no more. The posted sample has too much extraneous code.",
        "if you cannot understand the question,you can see the difference between the images. if you cannot know luncher,you cannot know the question.",
        "@userSeven7s Google Translate formats English in Human-Readable format. The grammar spacing is generally correct, and it capitalises recognised nouns and the first word in a sentence. The OP may have used it to aid in his translations, but he certainly didn't post it's raw output.",
        "I wish people would read the question before answering, CHARINDEX is not implemented in SQLITE !!",
        "Do you have a specific example you'd like to work on?",
        "Update and insert, or update and delete?  Your title and question say two different things.",
        "`switch` code blocks do what is called 'fall-through' which simply means any value passed to your `switch(department)` block with results in `case 99: display = \"Store Use\";`. If you want to prevent fall-through you must add `break;` at the end of each `case` statement.",
        "Why don't you make the fixes that are being given to you?  Insert the missing parens and braces, etc.",
        "You need some introductory books on Java and Android programming.  These are very basic errors.",
        "Sorry Kevin but that Escape function only escapes XML not SQL (http://msdn.microsoft.com/en-us/library/system.security.securityelement.escape.aspx)",
        "Please post some code how you have implemented your UIScrollView.",
        "This is one of the simplest Python programs to write. Please don't ask us to do it for you.",
        "Is this homework?",
        "What UI framework are you using? WinForms, WPF, Silverlight, web?",
        "A slick check??? Just check your bools and be done with it.",
        "[Stack Overflow is not your personal research assistant](http://meta.stackexchange.com/a/128553/140505)",
        "You probably need to escape the string, with \"\\\\\".",
        "I'm not able to get rid of '\\' character, how can i do it using above code?? Thank you very very much for your reply :)",
        "Are you aware that by only allowing a-z you are excluding some letters from other alphabets such as å? Is this really what you want to do?",
        "Using inline JavaScript is not a good pattern. If you are already using jQuery use event handlers instead.",
        "I think you should back your comment up with figures next time, as I believe you may be wrong. See http://blogs.msdn.com/b/codejunkie/archive/2008/10/08/xmldocument-vs-xelement-performance.aspx",
        "If you have two questions, then post two questions! Posting them as one just complicates things for people trying to answer.",
        "Is this way using jquery ui?\nI want to use bootstrap modal plugin. sorry.",
        "That absolutely has nothing to do with this user's question, nor is it even a technological possibility (1's and 0's don't change depending on how fast or slow they're downloaded, this isn't analogue TV signals we're talking about here).",
        "What do you mean `search though a linked list for an asterisk`?",
        "That's because it doesn't make any sense to compare the pointer to an asterisk.  `pt` is a pointer to a `node_t` (a struct), while an asterisk is a character.  Apples to Oranges",
        "@ChrisDodd (and asaelr, on my deleted post) are correct.",
        "What do you search for? You want to know whether the name is an asterisk? Or what? This is AMBIGUOUS.",
        "Does this even compile?  There are a ton of errors in your code as it currently is shown.",
        "It would be a lot better to phrase your question as a question.",
        "Im looking for advantages for using CallBack insted of simple client-service. Im sory for any confusion I made.",
        "have you tried anything before posting your question?",
        "no because I don't know which function is best for problem like this",
        "one you have to write.",
        "@Thoms , This was a sort of research man..!1",
        "@Alnitak research does not always be successful dude..!!",
        "@user1351820: there's a requirement in the [faq] for questions to be \"practical\". This isn't, trying to find twisted main signatures that work serves absolutely no practical purpose.",
        "RadialGradientBrush isn't available on Metro",
        "Maybe I'm reading too far into the original post, but he said metro-style which makes me think vanilla wpf or silverlight.",
        "Since the OP tagged the message with WinRT, I think it's safe to assume that this solution won't work at this point in Windows 8 \"The artist formerly known as Metro\" Apps.",
        "RadialGradientBrush is not available in the RTM version either",
        "Add some more description of the solution. Please refer: http://stackoverflow.com/questions/how-to-answer",
        "This kind of questions are useless... do a google search first please.",
        "So what have you tried so far?",
        "-1, this isn't a table variable, the variable in this example only contains the table name.",
        "There is no method named `makdir`. If you meant `mkdir`, how does this add anything to the existing answers?",
        "use `'<div/>'` and `.hide()` instead of `.css('display', 'none')`",
        "So much code for such an easy task",
        "This is wrong. HTML elements should be used to convey semantic meaning, not presentation.",
        "This question isn't about ASP",
        "There's a world outside ASP.NET Web Forms.",
        "This question isn't about ASP, is ANDROID LAYOUT's",
        "what i want to do is: I want to find a document having some outer key value and then add more documents to it.",
        "But has what you tried so far not worked? Can you just show us what you have so far so we can point out where it might be wrong?",
        "@jdi. I have pasted the code . now please tell me the right way of doing it.",
        "Ugh... using super-globals for your own data...",
        "What exactly is your question?  [so] is **not** a code reviewing tool.  Are you getting any errors?",
        "Nobody is going to write your app for you. Please start writing your app and then come back and ask when you have code related problems, which are specific to a problem and not as generic as \"please show me how to build my own app\"",
        "JGoodies Binding is a really good way to functionally describe a UI. Its ValueModel concept is very similar to Lenses. I wish someone would write a scala wrapper or implementation.",
        "Can you call .Net from Java?",
        "Okey... but by wich way this is an answer to the question ?",
        "Google is your friend:  http://www.google.com/search?q=asp.net+page+load",
        "Did you enable all the warnings given by your compiler? Did you use a debugger to debug your program?",
        "`\"01-01-2012\".replaceAll(\"-\",\"\");`?",
        "Why don't make the name correct before saving? Also you can rename file after saving: http://docs.oracle.com/javase/6/docs/api/java/io/File.html#renameTo(java.io.File)",
        "If you're these filenames represent dates, it's better practice to save them in yyyymmdd format.",
        "Check basic tutorials about obj-c before asking.",
        "what is the issue? you question seems like you are telling something not asking?",
        "possible duplicate of [Combine static and prototype content in a table view](http://stackoverflow.com/questions/9322885/combine-static-and-prototype-content-in-a-table-view)",
        "There are infinite ways to deliberately crash. Look at any of the questions here about crashing for useful sample code.",
        "The simplest one: `int hellYeah = 1/0;`",
        "[This](http://i270.photobucket.com/albums/jj105/callatov/Divided_by_zero.jpg)",
        "its just to crash the app it the app isn't offcial version",
        "This is The code thnx [[NSThread mainThread] exit];",
        "Show us what you have so far",
        "**Derek** is probably right, please read the tutorial: [PHP Forms](http://www.w3schools.com/php/php_forms.asp) to learn about it.",
        "The php works fine, its calling the script I was having problems with, because the form calls javascript, and wasn't sure where to go from there.",
        "What do you mean by \"hierarchical manner\"?",
        "hierarchical manner means n level",
        "I think he wants to truncate, so that when he deletes all the rows he starts at ID 1.",
        "@Luuky19 i think so",
        "@Luuky yes you got me",
        "You can use foreign keys and ON DELETE CASCADE. In this way, deleting the root element of the tree will delete the entire tree",
        "\"I have not tested this code yet but my intuition tells me it will break\" That means you're asking this question prematurely.",
        "Are you aware of String.IsNullOrEmpty ?",
        "Does `itemsList` contain arrays? Whats this `s[Constants.ProductSource]`?",
        "We should know if our code is gonna break in these cases without testing first. That is partially what I am trying to accomplish.",
        "I don't agree - if you have some code already go ahead and try it out, write some tests (write the tests that you suppose might break first!)  - it has value and the next time you come across a similar thing you will know what to expect.",
        "So what did you try?  We're more here to help with problems and less here to do this for you.  Also, unless you are laying out tabular data, you should do this with CSS and divs, not a table.",
        "Frames to tables, a bad idea.",
        "2001 called. They want their [question back.](http://www.adobe.com/support/dreamweaver/layout/frames_or_tables/)",
        "A) Use divs and css, B) abort project. Please choose an answer that best fits your problem.",
        "Posting a requirement and a giant chunk of code does not constitute a question.",
        "What is the problem? Are you getting any errors? If not, what's happening?",
        "Didn't see your comment @Corbin",
        "AND QUESTION is???",
        "this is display single analog clock on layout, i want to show four analog clock on my layout with diff time zone",
        "This is a terrible question. You need to discuss what you are doing and what you are trying to achieve before you post a bunch of code that only says \"i had class ratetime.\"",
        "Appropriate, rebuking response by a user named \"YourMother\" ;)",
        "Woah, I haven't seen a destructor used since my days of c++ ~...()",
        "No PHP, whatsoever.",
        "marc_s comment is valid.  When asking questions provide more details.  It is by pure accident that someone knows what you are talking about.",
        "Do you mean `$.ajax()`? Start with the documentation.",
        "What is `$ajax`? You've tagged this `jquery` so do you mean `$.ajax`?  Have you tried looking at the tutorials on the jQuery site?!",
        "its   $.ajax  sorry :(",
        "You need to put a little bit more effort into the question. Right now it's next to impossible to understand.",
        "ok. i need to concat result of a search ( it could be FG|BG|MG ) with a known string. Having gotten it, now i need to search this string. in the above example line2 is known. zam is unknown, ie. line can contain either FG, BG or MG. say                           line = \"createNode transform -n \\\"water\\\" -p \\\"FG\\\";\"",
        "Try showing example input and the corresponding expected output.",
        "line = \"createNode transform -n \\\"water\\\" -p \\\"FG\\\";\"",
        "If you are getting a compiler error, then please post the **exact** error message here.  Don't just post all your code and say \"it doesn't compile\".",
        "Y U NO USE WHITESPACEZ?",
        "`width == length;` these are what for, btw?",
        "This also smells of homework",
        "rect recs[4] = { {10.0, 12.0}, {12.0, 14.0}, {14.0, 16.0}, {16.0, 18.0} };                                                                  -`recs' must be initialized by constructor, not by `{...}'-                    the error is at that line.",
        "i'm sorry, i am not to good in this subject... so, may i know where to put it bcause i'm trying so many way but still cannot...",
        "@H2CO3 It's so entertaining to see evidence for 9GAG taking over StackOverflow :-)",
        "@EitanT sure :) I'm only doing this to stress my point a bit...",
        "1) Why are area and circumference class variables?  Aren't you supposed to calculate those from width and length?  If so, they should be functions which return area and circumference.",
        "2) Why doesn't your constructor construct anything?  it should take width and length as arguments.",
        "Can you please provide a link to the problem, the formula you used to solve (preferably with your current code) so that others can optimize it. Also if you found the formula, any specific reason to use brute force",
        "Brute-force methods tend to be slow.",
        "Define \"brute force.\" Without a formula, you can still [memoize](http://en.wikipedia.org/wiki/Memoization). I suppose that might still be \"brute force\" -- just a litte less \"brute.\"",
        "Please provide more details: post your design so we can see what you are trying to accomplish. Also tell us what you have already tried. Also please accept answers to your questions.",
        "There could be many reason. Without providing specific input can't help you out. You should post your question with some details. How can we understand what your psd is and what you have converted?",
        "Please provide what you have tried so far.",
        "Well i was looking at Salt hash in visual studio, but im curious to see if any one has a better way of going about this?",
        "you can take that account number as a string and you can use String.Replace method...",
        "the input is numbers so 12345678 but an account number",
        "Plenty of answers there ;-) Here is mine, based on regex and negative lookahead :        var reg = new System.Text.RegularExpressions.Regex(@\"\\d(?!$)\");\n       var maskedNumber = reg.Replace(NumberFieldDescriptor, \"#\");",
        "@ScottAtkinson: Ask another question for your requirement to use an input control which masks the text in a given pattern(like a password-field).",
        "What have you tried? This is the easiest question on this site... [Google: *CSS Text underline*](https://www.google.com/search?q=css+text+underline&safe=active) and [Google: *CSS Text align center*](https://www.google.com/search?q=css+text+align+center&safe=active)",
        "Why not start reading a [CSS tutorial](https://developer.mozilla.org/en/CSS/Getting_Started) ....",
        "Show us the code that fails.",
        "Show us some XAML & Code please.",
        "Might be a duplicate.  See here: http://stackoverflow.com/questions/5382164/wpf-bindingexpression-path-error-property-not-found-on-object",
        "@dbaseman Thanks for the pointer, I was looking for more of a tutorial into why it works the way it does which is I didn't post any code, the link you added does point me in the right direction.",
        "http://developer.android.com/guide/developing/index.html",
        "Google Android Development should take you to the guide on how to install your development machine.",
        "It will have it if you make it.",
        "What is wrong with question?",
        "Are there any libs?",
        "Could you write what you tried?",
        "i just write two class ,inside the first class i declare a variable getdata = xxx. but i need this get data value to another class . what to do.",
        "Show us your code.",
        "Why did I not see that? I've looked at that page before.",
        "Actually, do you know of any other way to animate before api 11?",
        "At the right-top corner of the page, you will find `Since: API Level 11`.",
        "Yeah, just seen that.",
        "Sure you can use [Animation](http://developer.android.com/reference/android/view/animation/Animation.html) to animate your views.",
        "Lovely. Thanks for that.",
        "From http://stackoverflow.com/questions/how-to-ask, \n\n\"Do your homework\n\nHave you thoroughly searched for an answer before asking your question? Sharing your research helps everyone. Tell us what you found and why it didn’t meet your needs. This demonstrates that you’ve taken the time to try to help yourself, it saves us from reiterating obvious answers, and most of all it helps you get a more specific and relevant answer!\nBe specific\n\nIf you ask a vague question, you’ll get a vague answer. But if you give us details and context, we can provide a useful answer.\"",
        "There are some questions that are simply baffling. Why for the same values of 1, 2 and 3 does `1 + 2 * 3` have a different result than `(1 + 2) * 3`?",
        "-1 for this question. You will finde what your are looking for at http://msdn.microsoft.com/en-us/library/fatf1t6a%28v=VS.100%29.aspx?lc=1033",
        "@RaphaelB. Wait, isn't that list for JScript (even though it probably mostly applies to C++, too)? The one for C++ is here: http://msdn.microsoft.com/en-us/library/126fe14k(v=vs.100).aspx",
        "Why don't you want to use css?",
        "No way to do this without CSS. But really, if you have no CSS, the default should already do this.",
        "Why would you want to do this without CSS, thats exactly what is for...",
        "what else do you expect other than css and js ?",
        "what do you mean \"seen\" as already clicked? visually/style? programatically (an attribute)?",
        "Everything you need to know is here: http://developer.android.com/index.html",
        "Thank you for your answer sir.",
        "Is it throwing an error?",
        "whats in `$dadosboleto` and `$tmp2`?",
        "Need more information, what are the values of your variables? Have you turned on error_reporting? What error if any is being displayed?? Repeating the title of the question in the actual question itself, does not help to answer ANY of these items.",
        "We need more information. Seriously, what do you expect us to do Gaia?",
        "Do you have [`short_open_tag`](http://www.php.net/manual/en/ini.core.php#ini.short-open-tag) set to 1?  Try replacing `<?` with `<?php`.",
        "@Rocket nailed it, thank you. If you submit an answer I will accept it.",
        "To all the people that are voting this question down: it turns out that there IS enough information here to solve the problem: see accepted answer.",
        "Thanks for undownvoting.",
        "This also push branch, original question is for tag only.",
        "Because it's uninitialized.  It's whatever bytes happen to be at that place in memory already.",
        "basically that x points to a memory location which could have previously been filled. You are probably seeing that value.",
        "because that variable is actually a location in the system memory somewhere, and unless YOU put something into that location, you'll get whatever garbage is left in that spot from the LAST time that memory location was used.",
        "@Wyzard: \" It's whatever bytes happen to be\" Actually this isn't right either. During debug build compiler can fill unitialized variables with some value (0xcccccccc). So there's \"some\" value in unitialized variable, but it is hard to say what it'll be.",
        "You should have a look at the [select](http://msdn.microsoft.com/en-us/library/ms189499.aspx) statement. You can use that to do do what you want.",
        "Why not use the module designed for the purpose? It allows it to be easily extended later, and it's very clear what you want to do. I don't think this is very good advice.",
        "you really should not discourage using the right module for the job",
        "How do you know that the keys and the values don't contain commas?  If they do, you won't be able to parse the output.  [BTW, this won't even run as written: keys is a list, so keys() fails, and it won't work if the keys and values aren't stringlike.]",
        "@DSM: corrected.",
        "That's an ugly way of getting the keys and values too - if you were to do it this way (which isn't good) then at least do something like `keys, values = zip(*my_dict.items())`.",
        "@Lattyware: never quite understood the zip function untill now. thanks.. :)",
        "Post your html and css, how do you expect us to help you without even seeing the code?",
        "You are definitely right Matteo Mosca, I somehow forgot to even post the code. But the problem was solved using display:inline-block like like RedX suggested.",
        "@Student: Then it was always the area of the div and not to the right of ;)",
        "Do you limit it to only numeric or special character? You can use regular expressions",
        "Have you tried using google and fed it the words \"asp.net validate input string\"? Plenty of results on *my* internet.",
        "You have tried java script validation..!",
        "what is the length you need?",
        "Thank you for all of your suggestions",
        "ok Coder :) i accepted",
        "@ArunKumar don't accept a answer just to say thanks. I thought you needed a java script solution, but coder proposed a C# solution.",
        "@Matten k whether we can use c# code in code behind file?",
        "What's the context? Why not compare the number directly? Also have a look at this similar question: [Regular Expression - Range (2-16)?](http://stackoverflow.com/questions/3451389/regular-expression-range-2-16) and [all of these](http://stackoverflow.com/search?q=regular+expression+number+range).",
        "you want to create an application that is actually a document?!",
        "@Thepoosh, Yeah. If there are any wrong in my question correct it.",
        "your question is meaningless",
        "https://play.google.com/store/apps/details?id=com.vasithwam.tamil.thirumurai.thirumanthiram",
        "above the link is a book. That is created as android application.",
        "It is just an app, filled with content ;) Probably also with functionality....",
        "if you want an app the displays a document you need to create it with UI. just saying I want a document to be an app has no meaning",
        "Just create the application and fill it with the content of the document! Maybe you can work with an import function ?!?",
        "Just 'cause it has a lot of question marks at the end doesn't make it a question?",
        "I'm sorry, but there is not nearly enough information here to help you. You need to tell us a lot more about the types of operations you want to perform on the data, what kind of security you require, and a lot more about ... everything.",
        "If you had taken the time to look at the Meteor.com source code you'd see it's running on meteor..",
        "I think at time of launch, Meteor was and you will notice now Meteor.com isn't using the at least the dev branch version of meteor as it is rendering the HTML.\n\nMeteor isn't insecure and the docs app is still an app as it always has been :).",
        "Those questions have nothing to do with the C language.",
        "Can't do any of those in pure C, you need OS specific code.",
        "cat /proc/cpu answers most of your question. why bother to another  application?",
        "Let's start with the basics: The you at least try it? If so, what did you get? Do you have any ideas of how this could work? Any ideas why your solution didn't work? Do you have any code to share? Is this home work?",
        "What have you tried? (-1. Try something. Show what was tried and how it did/didn't work.) If you you need to replace one, no need for the `function` replacement.",
        "You only want to rename the file?",
        "You can easily google that: `rename file c#`",
        "I got 24 million results on that google search and you found nothing??",
        "Interesting. Which google have you used? http://social.msdn.microsoft.com/forums/en-US/csharpgeneral/thread/435a2692-6161-4039-bfa9-5e6211d90c49/ First link when you type in \"c# rename file\"",
        "It's always astonishing how much effort will be put into defending that no information could be found instead of put that effort into more research.",
        "Nobody is saying that all objects should be on the stack, we're discussing why the default stack size is small.",
        "It's is not small!  Just how many function calls would you have to get through to use up 1MB of stack?  The defaults are anyway easily changed in the linker and so, we are left with 'why use stack instead of heap?'",
        "one function call.  `int main() { char buffer[1048576]; }`  It's a very common newbie problem.  Sure there's an easy workaround, but why should we have to workaround the stack size?",
        "Well, for one thing, I woudn't want the 12MB, (or indeed, 1MB), of stack requirement inflicted on the stack of every thread that calls the afflicted function.  That said, I have to agree that 1MB is a little stingy.  I would be happy with a default 100MB, after all, there's nothing stopping me turning it down to 128K in just the same way as there's nothing stopping other developers turning it up.",
        "Why wouldn't you want to inflict 12MB of stack on your thread?  The only reason for that is because stacks are small.  That's a recursive argument.",
        "Stacks are not small.  128K max size works just fine on my apps - that's getting towards small. 1MB is far too much for most apps but, well, only matters with apps that run ~2K threads.  I have never felt the slightest inkling to allocate even 100K of stack space for anything.  Anyway I answered the OP question - I know of no technical reason to limit stack space to 1MB.  It's not even a firm limit - it's per-app configurable.",
        "Why not use div? Every component of the HTML is allowed. It's up to the developer to figure out, what component is the correct to use. You can create a list with out using the list attribute - But you should use the list if you can. It's the same with divs, sections and articles.",
        "An alternate image doesn't help, it just scales that image 2x and looks blurry.",
        "You make it the size that you need in Photoshop. You don't scale it at all. That's the point of producing a unique image in the first place. That way you can keep it scaled 100%.",
        "Ryan, iPhone does the scaling itself. See this article: http://weedygarden.net/2010/10/retina-display-and-css-background-images/",
        "Wait why is this posted again? You would just get the exact same answers but this will be closed before you can get them.",
        "I also recommend you to read the [Python tutorial](http://docs.python.org/tutorial/). How to access tuples and lists is basic knowledge.",
        "Regarding your edit: If this is what you wanted from the beginning, you should edit your original question and maybe flag it for reopen.",
        "Your \"new question\" is a duplicate of [Flattening a shallow list in Python](http://stackoverflow.com/questions/406121/flattening-a-shallow-list-in-python).",
        "@a1my: You could have modified your original question in order to specify what you wanted to ask exactly.",
        "Google \"what is maven\" and click on the top link.",
        "*I want to know what maven is // I want you to show me* (Foreigner)",
        "google for c++ << operator, you're gonna hit bitshifting very quickly.",
        "it's dead Jim..",
        "\"This question does not show any research effort.\" Hmm...",
        "it's time for the hokey pokey",
        "the red cross called, he asked if you can possibly stop shooting on them.",
        "http://stackoverflow.com/questions/5528840/what-does-operator-do-in-this-line , http://stackoverflow.com/questions/3281666/what-is-operator-called , http://stackoverflow.com/questions/4008871/c-what-is-this-syntax-about",
        "What's resulting in the lack of success...an error?",
        "Unless you provide more information you will get no success here either.",
        "Well i think you need a `.ToList` at the end as your are assigning it as source",
        "ThePower and Jon see update.",
        "V4Vendetta sorry same problem",
        "http://stackoverflow.com/questions/6930314/importerror-no-module-named-array-import-scipy",
        "Please clarify the following: exactly what you are asking, what code causes this problem, what circumstances it happens under.",
        "Please go back to www.diveintopython.net and spend some times.",
        "you MUST show what you have so far if you expect any help.",
        "Specify your problem by adding the related code.",
        "Welcome to Stackoverflow!Your efforts are not shown in your question,give some code and are you using localhost",
        "your question is not constructive",
        "You've mistaken this site for \"workforme\", stackoverflow is aimed to AID programmers or learners in solving specific problems, not developing applications for free.",
        "There are thousands of tutorials for this that you will find on Google. Ask a real question here please.",
        "This isnt really a question someone can answer for you. Maybe make the question a little more specific.",
        "Java does not deal with \"this basic scenario\". Maven is a third-party tool. Feel free to check out other python configuration management tools; if you find them lacking, you are free to enhance them to meet your needs.",
        "a third party as maven would also help, i found only virtual env but that's basically just like replicating the java sdk for multiple project-packages which is unacceptable.",
        "Google for \"Java HTML parser\"",
        "check the javadocs for HTMLParser",
        "Using DOM parser and getting data you need from it.",
        "Welcome at Stack Overflow. You should invest some minutes and read the FAQ: http://stackoverflow.com/faq",
        "http://htmlparser.sourceforge.net/javadoc/index.html",
        "-1 sorry, question needs more info ( also hints that you may mean javascript rather than java )",
        "Yes.  Next question?",
        "When I look up the word `Undefined` in my dictionary I don't see \"Crash\" as any of the meanings...",
        "Why it is not a real question ! I really don't know if it is an UB or not ... our lecture told us it is not UB ....",
        "You are asking the same question again and again http://stackoverflow.com/questions/10618696/how-i-can-read-images-from-multiple-folder-in-matlab/10618886#10618886, http://stackoverflow.com/questions/1158362/reading-images-from-file-in-matlab",
        "What have you found so far?",
        "What's the difference between table and hammer?",
        "vote up for zerkms :)",
        "Have you even googled? Stackoverflow is not Google.",
        "possible duplicate of [what is the difference between ajax and jquery and which one is better?](http://stackoverflow.com/questions/931908/what-is-the-difference-between-ajax-and-jquery-and-which-one-is-better)",
        "@zerkms, ha ha :D",
        "What is difference between PEN and INK... LOL",
        "Read this: http://stackoverflow.com/questions/4459821/css-selector-what-is-it",
        "Where is your code?...",
        "It looks like you have an infinite loop somewhere in your code... please post the code.",
        "Try increasing your heap space http://stackoverflow.com/questions/705605/java-heap-space-in-netbeans-but-ive-increased-the-heap-size-already",
        "What is this? :)",
        "You should put capitalized initials to your class names, at least for consistency.",
        "Are you sure about this? I don't see that one in [the documentation](http://api.jquery.com/jQuery.support/) and `$.support.cssTransform3d` is `undefined` in all the browsers I've checked.",
        "This makes no sense, and obviously doesn't exist",
        "Even if it exists, no one except jQuery should rely on it. See the documentation link @mu is too short posted - \"Intended for jQuery's internal use\".",
        "Incorrect!! This should be disabled!",
        "Try deleting this answer please, make sure nobody uses this statement",
        "This does not remove anything from the bag. The item you are retrieving remains inside the bag.",
        "should be \"bag = new ConcurrentBag(bag.Where(x => x != item))\"",
        "@atikot, that line made me laugh",
        "You shouldn't allocate more memory than you need just to suppress a warning.",
        "This is likely to be confusing to anyone who reads your code later.",
        "GCC would also warn that it is set, but unused.",
        "The OP asked to do that with CSS. If it is not possible the answer correct is \"no\"",
        "Agree with @Paolo here, you did not answer this question.",
        "Answers like this really annoy me because they just completely sidestep the question and answer something entirely different. Say, for example, you're hotlinking a share price graph from an external source. You can't exactly copy the file into paint.net every minute and modify it, can you?",
        "To clarify: The client's clock may not be set correctly, or they may be maliciously trying to fool you into thinking they're in a different time zone from actual. If you're going to use the client's time zone, don't do it for anything important.",
        "-1 for giving a potentially misleading answer and not clarifying.",
        "Yes, for my application I can trust the client.  If the client has been mis-configured or has a bug, that's on my users.",
        "I actually agree with Florian. Reliable method? Kind of. Reliable data? Definately not.",
        "This isn't long polling. Its just polling.",
        "The reason I do it like this is because with apache / php you'll often times run into connection timeouts by leaving a connection open. Particularly if you're behind an Amazon load balancer the connection times out after 30 seconds. IMO better to poll every couple of seconds.",
        "Polling is easy. Long polling is hard in PHP atleast.",
        "Why people has given negative 2 ?",
        "@Utopik why? Also can you write it as an answer?",
        "This is a jQuery-based solution. The question was about angularjs.",
        "Rev The mark answer is javascript and if I did it using jquery what make it difference",
        "Your solution is not compatible with OP's requirements. he already built his app on angularjs. jquery is a different framework.",
        "+1 and I don't see here any jQuery... wtf? Another problem is @Abjo's method extends build in String prototype. That some developers choose to be angry about.",
        "Very bad thing to put the password into the URL. Don't do that.",
        "Why does your answer mention Oracle?",
        "@Akram, Please read the question.",
        "http://php.net/manual/en/book.pdf.php maybe?",
        "Have you tried searching for _PHP PDF library_? We rather like people to have done some good prior research here `:)`.",
        "You need to show us the code where you retrieve your data and bind your checkboxes...",
        "I accidentally posted this before finishing the thread, give me a minute.",
        "I don't see any check boxes in this code.  All I see is a SQL query which will set a value to 1 for every record in the table.  Where are the check boxes?",
        "Please add the *relevant* code or we can't help you. This is your SQL query which isn't causing a problem - if your issue is with where you retrieve the values or create your checkboxes then thats the coded you need to give us.",
        "As I noted in the edit, I've realised I didn't actually do my databinding but I am actually unsure how I would grab the information from the Database in C#, therefore there is no code actually retrieving the values, I will post my code where the checkboxes are created in case this is any use.",
        "I hope the information I have provided give's a little clearer idea.",
        "You are binding IsChecked to visibility converter and not passing a value.  -1",
        "Yes I am aware of this, please read the OP before downvoting.",
        "@NortonTaylor - What is your DataContext? What is the name of the (boolean) field you want to base the checkbox's check/uncheck value on?",
        "Umm. A regex for all of that???",
        "[You can't parse HTML with regex](http://stackoverflow.com/a/1732454/26226)",
        "Not possible, HTML can't be parsed, it needs to be interpreted. Try googling 'c# data from html' (never done anything like it before, sry)",
        "Check out http://stackoverflow.com/questions/56107/what-is-the-best-way-to-parse-html-in-c\nBasically: http://htmlagilitypack.codeplex.com\nCheck the example",
        "When you say you want all the \"Tags\" do you mean HTML tags? How deep do you want to go? Is there any specific format it should follow?\n\nI would also suggest removing the divs around the edge of the <ol> - it made it a bit hard to understand what you were actually on about...",
        "Classic answer: http://stackoverflow.com/questions/1732348/regex-match-open-tags-except-xhtml-self-contained-tags/1732454#1732454",
        "Care to either post your public site's URL where it is not working or the complete source code that you used here?",
        "The buttons are to be created in flash, google flash tutorial to get started",
        "That code is over-complicated. Look back at the initial requirements.",
        "You can't have 100 unique integers between 0 and 9",
        "And it was him, and there are answers on it...",
        "Why did you ask the same question twice? This one and http://stackoverflow.com/questions/10688044/filling-a-array-with-uniqe-random-numbers-between-0-9-in-c-sharp",
        "i'm sorry...i'm newbi and i think my question needed to be change and i changed it...",
        "What is the question? What are you trying to do? What changes did you do recently? Add more information to get a response",
        "Could be a problem with archiva configuration. Could you also follow the configuration as described in archiva [documentation](http://archiva.apache.org/docs/1.4-M2/userguide/using-repository.html)?",
        "what kind of problems do you have ?\nAny logs to show ?",
        "try accepting the answers if u find yourself satisfied according to your question...",
        "Be careful with this solution. Adding the `Key` attribute to the `UserName` property will cause the `UserName` property to become the primary key in the database. Only the `UserId` property should be marked with the `Key` attribute. This solution will give you the 'correct' behavior on the programming side while giving you an incorrect database design.",
        "funny -10 accepted answer :)",
        "Have you tried anything yet? Maybe start with simple Java tutorials before creating a game.",
        "@DanW:  To be fair, War was how I learned much of the Python I do today.  Then again, I had read up on a few tutorials beforehand...",
        "\"from the last one to the first one.\"",
        "What's your question?",
        "@user1415038 i just updated the question, if you can give me a hand",
        "@Seçkin Savaşçı, sorry for that. this question is i updated",
        "It would be helpful if you showed your output vs what you are supposed to get.",
        "Try initializing the 'carry' variable.  You probably also want to zero out the rest of `arr` (apart from the `1`) after the malloc;  I don't think `malloc` does the zeroing for you automatically.",
        "oh shit , its a small prob i am not able to identify . but thanks for the comment MARK",
        "[Teach Yourself SQL in 21 Days](http://www8.silversand.net/techdoc/teachsql/index.htm)",
        "@Michael Petrotta: great comment :-)",
        "Thank you for the advice, but unfortunately, I don't have 21 days to learn.",
        "It won't take 21 days, these criteria are basics",
        "What do you mean you can't style them? I'm already doing it. `input:invalid + label::after{content: \" INVALID\";color: red;}` Adds a red piece of INVALID text after the label which I have next to the input field if the the field is invalid (for example if an email field has an invalid email in it)",
        "yeah in css but not in js",
        "\"Is there a way I can mark an input field as invalid/valid from javascript?\"\n\"Unfortunately, you can't style pseudo classes from JavaScript\" That's not what the question asked.",
        "You should be able to use the CSSOM to define a new class with a pseudo-class dynamically though...",
        "... this would suggest to me that the problem is in the line of code preceding `if gam < 1:`.",
        "I can't get this to fail (assuming all the `gam` variables are defined). Can you post the error message? or more of the code that comes before?",
        "Consider refactoring the code. I'm sure you can make it much shorter and have less repeated code.",
        "paste the code present above the if condition.",
        "SO is not for \"please locate my syntax error\".",
        "first try to search before post answer http://stackoverflow.com/search?q=[android]open+numeric+keyboard",
        "you give me the idea thank you",
        "no you cant do it in WPF there is no RichBoxText.Text",
        "Did you try searching the Apple documentation for \"Twitter\"?",
        "sorry my bad didn't see the block was not propely formatted was editing it but by that time u edited it",
        "I have done no edits.  That word is 'you'.",
        "yeah sorry sorry.i mistook you for the other person who edited it and would take care of chat language in the future",
        "Have you tried searching for key words like \"server side vs client side validation\" ?",
        "I'm Feeling Lucky on Google for \"server side vs client side validation\" returns [JavaScript: client-side vs. server-side validation](http://stackoverflow.com/questions/162159/javascript-client-side-vs-server-side-validation)",
        "This is a joke right?",
        "What a wonderfully useful and informative answer.",
        "What a great attempt at sarcasm",
        "You just need to look at the basics of language first and then come here.",
        "You won't find it here either",
        "With PHP it would be something like\n\n    if(check_if_user_is_logged()) {\n         // show my secret stuff\n    }\n\nIt's a REALLY broad question",
        "i would like you to meet session and cookie.",
        "[The pony he comes...](http://stackoverflow.com/a/1732454/554546)",
        "Now, this is entertainment like you can't pay for.",
        "It's far more constructive to ask individual, focussed questions, as the answers benefit a wider range of people.",
        "please repost these ase individual questions. with some of your ideas please",
        "Those are supposed to be strings right?",
        "what did you try?",
        "You're pretty close anyways...should be easy enough to look up...",
        "http://stackoverflow.com/questions/10852522/selection-sort-for-java",
        "This does not seem to work in Safari.",
        "This will only work in browsers using the Mozilla framework (such as Firefox). It's bad practice to provide/use code that isn't cross-browser friendly.",
        "You want to save while your application is running or you want it even after when the application has stopped?",
        "if any of the answer worked for you accept that. and do some research before asking.",
        "This looks like a schoolbook question. -1",
        ".:what is your question?",
        "Will you come here for every parse error you'll get during development?",
        "We don't code for you.... If you get stuck with something in particular explain it here, but don't ask us to make all your worK...",
        "So in short, you want us to do your work for you... If you want help, you'll need to narrow it down, find the exact source of the problem, and prove that you've at least tried *something* by yourself.",
        "show us your `html`. and create [dabblet](http://dabblet.com/).com with your `html&css` we will be able to start with it",
        "Its not surprising that it doesn't work, most of the attributes are for webkit only hence \"-webkit\" you need to add all of the alternatives for different browsers too.",
        "give a general soln.",
        "what did you try?",
        "see if this helps: http://stackoverflow.com/q/1908250/395255",
        "Why does that matter? Show them what you've done.",
        "This question belongs on [programmers](http://programmers.stackexchange.com).",
        "I tried this link- http://odetocode.com/articles/79.aspx\nBut, it is very confusing. It does not explain the concept for a beginner.",
        "What's with all the - votes? What's wrong with this question?",
        "@m sona: Nowhere in your ajax call do you actually specify any data to send to the php script. http://api.jquery.com/jQuery.ajax/",
        "i need \nurl: 'search.php?user= + user',\n\nin java script but not working",
        "Why are u not using http://www.domain.com/index.php?user=Roni instead of http://www.domain.com/index.php?user=\"Roni\"",
        "THere you go: http://www.leepoint.net/notes-java/data/strings/12stringcomparison.html",
        "Stack Overflow is not a personal code writing service. (Hint: `padding-left` or `margin-left` on the right element will do what you want)",
        "Post a small example of the code in question here if you want help.",
        "Are you looking for `text-align: justify`?",
        "-1. Worst. Possible. Solution. There is almost no way you could choose a less effective way.",
        "Are you paid per line of code?",
        "Efficient enough for what?",
        "Comparing to using stored procedures in relational databases.",
        "and what is the question?",
        "in $message variable i wish to send the unique link to the user. How to create that unique link.",
        "These are doing completely different things; what does it mean to compare them?  Also, the 2nd example is gibberish; it's calculating a local variable in terms of itself, and then discarding it.",
        "Try running the code on your target platform and monitor power consumption with a power meter - it's the only way to be 100% certain whether there is any significant difference.",
        "Estimating power consumption of bits of code in isolation is probably impossible; there are too many other things going on (and you'd need to look at the compiler-optimised result, not the original source).  My suggestion would be to simply run your code, and measure the power consumption with a meter.",
        "@OliCharlesworth, I have shown you only a small part of the algorithm, so you might see it as totally different thing, Though you need not worry for the same. I just a need a logical view on the code power consumption.",
        "When other programs kick-in (e.g. services) then you can get an increase in paging.  Page faults require IO, and could considerably change the power usage.  No matter how efficient a single program is its interaction with virtual memeory that can suck power, and a (normal) single program has no control over that.",
        "So what are the errors?",
        "@GrahamBorland Can't you see them? I had to scroll the page :D",
        "@user1423111 I could tell you why do you get one of the errors but instead I will recommend that you learn a bit about working with databases in android.",
        "@user1423111 I would suggest you significantly edit your post to show only the lines where you're getting the errors, and state what you've tried when debugging to figure out what's going on.",
        "That looks like google limit, not git limit.",
        "Hi. You must pass array element but not whole array.",
        "Have you even tried looking at least MSDN for switch case ?",
        "And the comments in the cases are the same of the values in excel cells in [this](http://stackoverflow.com/questions/11044835/parsing-an-excel-file-and-reading-a-cell/11045564#11045564) question by [Harish Kumar](http://stackoverflow.com/users/1034945/harish-kumar)...",
        "If *you* see no more reason to use something, isn't it *you* who lack imaginatino?",
        "Doesn't work for PostgreSQL or other databases, it's MySQL-only",
        "I'm not sure what you are implying by \"I know it's not so hard to tell me\". But we know it is not so hard to search for \"android change background on click\" and read the first result.",
        "Consider using `&&` instead of `and`. It's more common and has the precedence people expect. Besides that, consider writing clean code by not mixing HTML and PHP in the same file but using a template engine instead (could be even as simple as `include 'sometemplate.php'` while only using `<?=$var?>` in that file).",
        "solved problem . thanks a lot",
        "you should also show some effort - have you tried doing it? did you get stuck? or you want someone to build it for you? ;)",
        "How to create it with jquery? know how to ask [question](http://stackoverflow.com/faq#questions)",
        "http://jsbin.com/eliqak/edit#javascript,html,live",
        "This is completely wrong! It will cause git to ignore ALL your files",
        "@checklist Did you not read the question? Or is it that did you not understand my  point? He asked \"What files/folders can I safely ignore for inclusion with git?\", the answer to which IS ANY of them. How do you know he doesn't want to temporarily ignore everything while he works out his build problem?",
        "@JustinBuser that just seems like meaningless, pedantic semantic wrangling. I don't think the artificial context you have concocted has any bearing on the reported question. You appear to be wilfully misinterpreting the OP.",
        "You asked the exact same question [here](http://stackoverflow.com/q/11135434/212940) and received answers for it, why ask again?",
        "Show us your code... maybe we can help you.\n\nWithout see your code we can't help you.",
        "Thank you Sena, I just added the code, please take a look if you got a chance!",
        "possible duplicate: http://stackoverflow.com/questions/2996806/can-one-form-have-multiple-actions",
        "It must be obvious that second sample uses is  **OR**",
        "this \"problem\" could've been solved by simply trying the code out to see if it works as expected.",
        "How can I accept an answer ? I have clicked in \"Useful \"",
        "somebody is trying NAUGHTY stuff!",
        "one = combobox1.Text? Your question isn't clear.",
        "Very similar to http://stackoverflow.com/questions/1293549/string-to-variable-name and several others like it. Bundle your string variables into a class and either use Reflection technique or GetProperty. (Not putting this as an answer since I think this question should be closed)",
        "This does not work always. It surely did not work for me for sth. like 20% files...",
        "oops no nb3 sorry only nb2 and nb1",
        "C++ doesn't allow nested functions. It's an extension of whatever compiler you are using if your code compiles. Also, if you get errors compiling you should add them to the question, preferably verbatim.",
        "WHY ARE WE YELLING",
        "A code dump isn't a very useful question. I recommend Googling your question first -- one of the [first results](http://pb.zambale.com/2012/01/25/mysql-prevent-duplicates-using-the-unique-constraint/) is very applicable.",
        "@dbaseman: BECAUSE IT IS URGENT!!1",
        "The mysql_* functions have been deprecated as of PHP 5.3, Relying on them is highly discouraged. Consider using either PDO or MySQLi.",
        "please give some more information and what you have done?",
        "\"Since array list doesnot keep the list in the same order as data has been added to list\" umm, yes it does, at least it does in the same manner as a linked list does. Can you provide an example of how they don't?",
        "Yes, ArrayList and LinkedList (The List contract in general) keep items in insertion in order.  the Set contract is unordered or ordered by sort (TreeSet).  The reverse idea isn't bad but remember that it actually reorders the list which could be slowish.",
        "I downvoted this answer because it erroneously states that ArrayLists do not keep items in insertion order. As @bill-k notes, all Lists are ordered collections by definition. The suggestion to use a LinkedList instead has merit, since it features the descendingIterator() method, but only if performance is a bigger concern than memory and abstraction.",
        "Did you try *anything* before asking SO?",
        "Oh no, not this question again! http://stackoverflow.com/questions/9949387/fill-parent-and-match-parent ; http://stackoverflow.com/questions/10854717/why-did-match-parent-replace-fill-parent ; http://stackoverflow.com/questions/8516825/is-deprecated-word-the-only-difference-between-fill-parent-and-match-parent ; http://stackoverflow.com/questions/7608196/android-fill-parent-to-match-parent ; http://stackoverflow.com/questions/5761960/what-is-the-difference-between-match-parent-and-fill-parent-property-in-android",
        "How about if we just give you a formula that will rotate *an arbitrary point*? That way you can apply it to each vertex of your cube, or any other polyhedron.",
        "how about we _just_ tell you to get a decent computer graphics book?  Foley and van Dam is good.",
        "How did you get here?",
        "In detail, it means that the compiler cannot recover from the earlier errors it reported, and thus is terminating.",
        "this is a windows based solution.it would be better to offer a cross platform solution",
        "This has nothing to do with boost.",
        "Bad fiddle & `unwanted output` => downvote!",
        "Why downvote..? I have written unwanted output. Not unwanted and something....",
        "you've been here for 8 months and have 1k+ rep, you should know better.",
        "@Adnan Shammout Hmm ok, but thanks :-) Even downvotes helped this time...",
        "possible duplicate of [Unique values in an array](http://stackoverflow.com/questions/1960473/unique-values-in-an-array)",
        "Thanks, is it not possible to do something similar in a linearlayout or would I need to use a relative layout somewhere?",
        "Why you want use linearlayout? Relative Layout is the more flexible solution and it doesn't take any much load than LinearLayout. If you want read more about efficence differences between the two solutions you can check this link: http://stackoverflow.com/questions/4069037/android-is-a-relativelayout-more-expensive-than-a-linearlayout",
        "well my overall design is much more suited for a linear layout I think so I would have to do <linearlayout><relativelayout>header</relativelayout><otheritems></linearlayout>, so if I could avoid using that extra linearlayout it would be great. Of course if that's not possible its ok as well I guess.",
        "What is your question? Your code is specifically written to insert one \"o\" and exit (sets `j` to `false` straight away). What is the problem then? What is \"if statement is not testing correctly\" supposed to mean?",
        "the code works the first time, but when there is a o already stored in one of the values it does not enter a second o. That is why i am saying it is not testing correctly.",
        "seriously I don't mind that this gets down voted but the least you could do be for down voting is compile the code from the link and see what i mean for yourself.",
        "@user1108980 But the code does what it looks like it does: put a single \"o\" in the array at the first position where it doesn't have an \"o\" or an \"x\". Why do you think it would do something else? In all probability, the error is somewhere else, like in the code that copies the string array back to the individual strings.",
        "Without more and specific details, you will be stuck for a few more years.",
        "You'll have to tell us a bit more than that!",
        "Do you get an exception? What kind? What's the message? What code is causing it? Have you stepped through it in the debugger? [ask]",
        "He is using `basename`, but that's not his problem.",
        "So, you'd like to be able to post an image on somebody else's site that can take over that site.  I can't think of any _good_ reason why you'd want to do this.",
        "Are you building some kind of virus? lmao",
        "perhaps you need to move the function to the top, before you call it? And you are missing a \";\".",
        "I originally had it outside of a function at the top and thought it could be causing the error so I placed it in a function.",
        "I think the answers below are on the right track.",
        "Have you had a look at the [docs](http://msdn.microsoft.com/en-us/library/zkcaxw5y.aspx)?",
        "/me facepalms... okie... what have you '**try** `{` d' to do?",
        "Don't judge something you don't understand.",
        "I have seen it used in Lua, apparently with the same usage than in Go (and predating a lot the Go language), and used a lot in Scala... (where it is a wildcard).",
        "Yep, in Scala it's a wildcard for assignment but it's also used as a placeholder for parameters in lambda (anonymous) functions.",
        "So, like a property of the `Form`?",
        "http://stackoverflow.com/questions/1433182/passing-variables-from-main-form-to-input-form?rq=1",
        "where did the handle come from?",
        "You're also disposing WasteOfMemory before the task has completed. The task is running asynchronously, so the correct way to dispose (given this design) would be with a continuation.",
        "-1 for \"wow, this is ugly code - LOL\"",
        "You need to format your code in a manner that is human-readable.  One long string is not helpful.",
        "Google...\n\nhttp://css-tricks.com/snippets/css/css-triangle/",
        "http://developer.apple.com/library/ios/#DOCUMENTATION/UIKit/Reference/UISegmentedControl_Class/Reference/UISegmentedControl.html",
        "Very simply, no.",
        "Adds one of what?",
        "what are you trying to achieve?",
        "Query the database, get current total.\n\nAdd one.\n\nStore new value.\n\nPlenty of tutorial available for this.",
        "Updated the post* Sorry if that wasn't clear at first.",
        "Use your fantasy to explore and try on your own...",
        "What is your issue? What's not your \"correct\" result?",
        "can you post the resulting sql statement?",
        "hello @randy! i paste result. please give your suggestion...",
        "Too much code. Not [SSCCE](http://sscce.org/).",
        "I understand it is too much code, but just paste the code into an IDE and one should see the error.  It is the build error I am after, not the codes.  Thanks.",
        "Actually, you should post just the line that's giving the error and some information that you find relevant. That's a lot of code.",
        "The error was found in the fstream header file.",
        "Remove the equals sign from the field declaration.",
        "How to list out all applications through programmatically?",
        "Check this post with a demo ... http://whats-online.info/science-and-tutorials/42/Android-tutorial-list-installed-apps-package-name-programmatically/ .. It will help you",
        "If you got an answer that does not work, unaccept that answer and talk to the people that are active in your question in order to get a working answer. Polluting the site with multiple identical questions is not the way to go.",
        "[See my updated answer to your original question](http://stackoverflow.com/a/11392150/219661)",
        "u are getting a null pointer exception at line: 111, please post your activity code.",
        "pls provide code so that one can to know wat u hv done and wheres the mistake??there must be some initialization problem",
        "What is there in **line number 111 of MainActivity2.java**?",
        "The code you've posted is still too little to help you. You should post the entirety of your source for MainActivity2.java.",
        "use `if(!date.length() == 0 || !date.equals(\"\"))\n{\nlabelDate.setText(date);\n}` instead of `labelDate.setText(date);`\nmaybe this will stop `NullPointerException` but not solved your problem until you provide more code",
        "Your questions are not more urgent then anyone elses.",
        "No Eelke, I have to create an application using GWT2.5 and show the demo by today. Please help me if you can.",
        "http://us.php.net/crypt",
        "Reading the php.net/manual beforehand can be of great benefit.",
        "-1 for not taking care of your own question(no formatting, no explanation).",
        "The name 'gvMyDetails' does not exist in your code dump, either.  Where is the error occuring?  Post relevant code.",
        "Well, _does_ it exist?  It's not mentioned in _any_ of the code you've posted.",
        "-1: This is not fastest. The opposite is the case. On large collections this just crashes PHP due to memory limit so it takes up to an infinite amount of more time compared with the `getSize()` method.",
        "The recommended way to set whitespace around drawables is to set padding.",
        "http://code.google.com/p/html5lib/",
        "Seriously? Let's look at http://api.jquery.com/on/: *\"version added: 1.7\"*",
        "you would be better to ask \"how to do X in php\"",
        "Why does this **need** to be converted? Does it not work? Besides, it is already a lambda expression...",
        "This is already a lambda expression. Go through [this](http://www.codeproject.com/Articles/33769/Basics-of-LINQ-Lamda-Expressions)",
        "I have modified the query to understandable one.",
        "@houstongolden doing this is illegal without purchasing licence.",
        "3rd question with same content in 20 mins ...",
        "You should remove the questions as you have already posted a couple like this before. You can always get the required answer, no need to exert extra effort like this. It might waste everyone's time.",
        "I told you he posts every 20 mins. hehe.",
        "ha ha @Kobe.o4 -",
        "This is a completely different thing. Target SDK is to make your app compatible with most ranges of Android OS. This is not an answer, by some means this may have worked in your case but this is not an appropiate solution.",
        "What is your question? In other words - what are you expecting to see in responses/answers?",
        "Smells like homework, and **what's your question?**",
        "Any sort of material that could give me some ideas how the actual algorithm works (because I have no idea how to find exactly 16 commands that will make the matrix look like the second one).",
        "Not homework by the way. My question is: what should I do to achieve the GOAL? How should the algorithm work/look like?",
        "Of course, I'm not asking anyone to spoonfeed me or do the work for me. I just need some ideas, example code, anything to get the basic idea of how it should work. I don't know how should I even approach this problem. :/",
        "Could anyone explain to me why was this question downvoted?",
        "@Tuntuni You have an entire \"question\" without any question mark. Basically, it's not clear what your question is. You could for example start with a summary of your question or the topic instead of showing your matrix and explaining the terms...",
        "What *is* the output? What *part* don't you understand? The more specific your question, the better we can help.",
        "also tell printf(\"%d\",sizeof(mess[2]));",
        "i cant understand the o/p",
        "had a good chuckle at the 4th string. the sizeof() gives the size in bytes of mess pointer.",
        "I'd like to be able to use HTML files in Express (vs plain Node.JS)",
        "ooooohh sorry (i'm french :p), so you can use the `fs` module. `fs.readFile(htmlfile, 'utf8', function (err, file) {`",
        "I don't get your point...",
        "Coz There is no point...",
        "Think you could have gotten that from a fairly easy Google search",
        "Isn't this basically trying to game the system? Pretty sure this would violate Facebook TOS and get your app shut down",
        "I will take my chances",
        "This question makes no sense... it is full of rambling and run-on sentences.",
        "http://sscce.org/",
        "What results are you getting exactly?",
        "Ramhound i didnt get any results since its impossible to convert the X and Y that way to int. Im getting error illegal character.",
        "@user1526380 - That means what you are trying to convert isn't a number",
        "@user1526380 -Dont forget to mark answer as accepted if it works for you...",
        "I don't get why an interviewer would ask what methods are native. This is implementation dependent and a non native method could as well call a native one...",
        "Interview questions that test your memory about specific apis or implementation details are poor tests of your knowledge.",
        "Don't you want to read an Objective-C tutorial before writing an operating system in it?",
        "`[self moveOperand:_referenceDeck :hand];` As declared the method is somewhat confusing - moveFrom is a parameter , not a parameter name, so [self moveOperand:_referenceDeck moveFrom:hand]; is wrong",
        "This answer is not answering the question at all.",
        "That's for Drupal. I'm not on Drupal.",
        "`== true` == bad",
        "I see the `void`",
        "well, don't return a void, return a string.. !!",
        "SQLCMD `!!` commands are executed on the client's machine, not the server.",
        "I'm confused, you say you're following the code in that question, but none of that code appears in your question. And how are we supposed to help with a big complicated function that we don't have the code for?",
        "[Similar questions](http://stackoverflow.com/questions/1145726/what-is-nosql-how-does-it-work-and-what-benefits-does-it-provide) have been asked many times (and normally, separately :).  The questions you have included are much broader than one SO answer.  The best idea would be to start with one of the books or tutorials on MongoDB and see how this compares with your previous relational database experience.  For example, the [Little MongoDB Book](http://openmymind.net/2011/3/28/The-Little-MongoDB-Book/) is a useful free book to start with.",
        "Thank you Stennie. I'll check out those links. I appreciate it. :)",
        "`PuTTy` and `open ssh` are simmular but not the same",
        "What *kind* of format?",
        "Try: `\"$(\\\"#container\\\").notify();$(\\\"#container\\\").notify(\\\"create\\\", \\\"basic-template\\\", {{ title: '{0}', text: '{1}'}},{{ expires: false, speed: 1000 }});\"`",
        "(1) This doesn't reverse the linked list. (2) You have an infinite loop any time `node->next != null`",
        "question is to reverse a linked list not print linked list in reverse order.",
        "Till now i have just created a table dynamically using data from an json array. now i want that when i click on data/content of a cell of table i created using javascript i get back that data in a variable?",
        "Put this `alert('I will have learned the javascript basics **before** I ask next question');` and run - there will be an answer for you",
        "We have a site for UI discussions.  However, \"what is best\" type questions are generally discouraged everywhere on the StackExchange network.",
        "-1; how did this garbage get upvoted? For the avoidance of confusion: `format()` is *not* a method of `Date` objects and the code above will not work unless you've added some implementation of `format()` to `Date.prototype`. Without offering up such an implementation, this answer is worthless.",
        "You should use XPath or XML parser for extracting data rather than regex. It would be much simpler",
        "Ok, that's what you want. But what is the question?",
        "Have you considered reading an introductory book on C or C++?",
        "Your code does not even have a `main()` function. As suggested, read some introductory material first.",
        "this code is wrong in so many levels...",
        "That's Mono for Android. MonoTools is a different product.",
        "Do you keep posting the same question every 20 minute?",
        "Why you ask same question two times.. http://stackoverflow.com/questions/11686648/can-i-multiply-charat-in-java",
        "You must be revieving 103 and not 100. It confused me.",
        "Imo your qn is not clear at all..",
        "To me your two kinds of out put look identical other than one with row names and one without.  I think you'll need to be more specific on what you want and intended use in order for people to provide you with more refined solution(s).",
        "Are you using the Eclipse plugin?",
        "The R.java file is GENERATED. So you cannot/should not/must not edit it manually...",
        "You're going to need to provide more details than this...",
        "I assume a pop-up dialogue along the lines of \"Do you want to re-send form data\" happens when you hit reload before the screen reloads?",
        "@DeanRather - A search does not require a POST to occur. See Google, which uses GET.",
        "It is a good practice to use some exception handling or using die() while using queries.",
        "This has too much superfluous information in it.",
        "-1 for lazy code dump",
        "First mistake : Posting your entire code here. Second Mistake :Posting your same question which you asked yesterday without even modifying it.",
        "hello; i modified it. it is not the same errors i am posting here",
        "Just look up online. There are already **many** examples of this.... ***What have you tried?***",
        "Refused to set unsafe header \"Origin\"",
        "Please show us what you have already implemented and explain how it behaves/what is wrong",
        "can you post more details pls.",
        "minus 1 because question is how to do it with XPath, not PHP...",
        "yes, with javascript and perhaps or perhaps not using ajax",
        "please try something then after ask for the help",
        "When you see `; expected` on the first line of a function, the error is almost certainly a missing `}` in a method above.",
        "Which line is that",
        "From what I can see, there isn't anything in your code as is that would cause that error.  What line is it caused on, and what is the code preceding that?",
        "I get the error on line public void onDrawFrame(GL10 unused){",
        "Sorry, I can't understand this, \"please advise how the collision would occur\" - why you need collision to be necessarily occured ?",
        "\"I want collision to occur\". Why? That's exactly what you should be trying to *avoid*.",
        "Your question isn't very clear - is it one word per line in both files?",
        "That would be quite easy if you just did some research of your own regarding regular expressions.",
        "_Its one_??? What do you mean? Could you explain what your answer contributes to the answers so far?",
        "you've just created a new task by continuing which will then fail and get into the same situation.",
        "whats stopping you from doing the math now? I don't understand? `$total = (0.25 * 10);` ?",
        "Your question is unclear.",
        "post your code that you use",
        "I will give answer but one condition you need to do it first.",
        "When did SO became order placement site?",
        "Quite performace-bad idea...",
        "Error messages? `doesn't work` is not an error...",
        "there is no error message, the only thing that appears is the \"broken link\" icon you get when an image in not linked to correctly.",
        "Pls see the answer of mine..it works perfectly.. :)",
        "-1: When a programmer wants to do something, he/she has its reasons. The answer cannot be \"there is no excuse to want to do that\".",
        "The \"reasons\" he/she/it has are wrong or misguided.",
        "This is not for you to judge. You are either to help or not help. You can post a comment on his question to tell him your opinion. Your judgement is *not* a helpful answer.",
        "This is not an answer to the question. (I agree that it is a really bad idea to do what the question asks, but that is a different discussion. Or as pointed out, is a comment, not an answer.)",
        "Organization/client requirements are a reason to do this. Yes, they may be misguided, but they're never wrong, even when they are :)",
        "No, it's not the same at all. FullPath returns the item path, GetItemUrl() uses the LinkProvider to create a friendly URL.",
        "Why do you want an array when they all have the same value?",
        "\"*any help is appreciated. i am not going to post code.*\"",
        "I want them to only have the same value if one is set to a certain value.",
        "`logged in` to what? What are looking at that says they are still logged in; a database (MySQL)? At best this question is really ambiguous at worst not a question at all.",
        "re-format your code",
        "Since you will also need `ContentLength`, save it to MemoryStream and then copy it to Response.OutputStream.",
        "There is no way to do this without coding.",
        "I think you are mistaking SO for rent-a-coder.",
        "@thatidiotguy i know this requires coding thats what i am asking for.",
        "@Petra i cant afford a coder thats why i asked for help. Thanks",
        "@user1467788 sessions will do the trick",
        "It's really not very clear what you are asking here.",
        "Please include your real code in your questions. This code is not just invalid, it doesn't really make sense -- 20:05 is not an integer.",
        "Use pow function from C",
        "are you talking about power or xor?",
        "power, sorry.  nhahtdh's answer did it for me",
        "A *screenshot* of text -- seriously???",
        "i press printscreen and copy the file quicker than writing 3 floats",
        "@tuğrulbüyükışık, you should turn on quickedit mode and use the mouse to copy the text. Or just right-click and use the menu to enter \"select\" mode.",
        "Quickedit? Wheres tat button",
        "Right-click the command window caption bar, and choose \"Properties\". There is a checkbox for quickedit mode. Select text with the left mouse button, right mouse button copies to clipboard.",
        "Thank you. I will try this for next questions",
        "Obligatory link to Goldberg paper: http://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html",
        "What is `timeFrSSH`?",
        "\"Related\" column on the right side of this page didn't help?",
        "Looks like you're trying to load a 45mb pic... That won't work on many phones",
        "check out this\nhttp://stackoverflow.com/questions/1949066/java-lang-outofmemoryerror-bitmap-size-exceeds-vm-budget-android",
        "I'm on SO for several time, and I see about 2, 3 questions per day about this problem... Doing some researche before posting, you probably would know the answer already...",
        "@IncrediApp That's the bit I don't understand, the image I'm trying to load is 800KB not 45mb?",
        "Check Yahel's answer - that probably clarifies it",
        "What exactly are you asking?",
        "what is your question?",
        "get the links of a given form of Json",
        "either google, or [RTFM](http://www.php.net/json_decode) -> `$parsed[0]['data']['attr']['href']`",
        "@EliasVanOotegem thanx for [0]['data']['attr']['href']",
        "What particular part of implementing that do you have problems with?",
        "have you tried something?",
        "yes i hav tried but i didnt get like facebook or linkedin.",
        "Good for you! It's an interesting task. How do you plan to do this?",
        "Parse it with [DOMDocument](http://php.net/DOMDocument)",
        "what is your question?",
        "Need to parse shop catalog",
        "Could you explain in more detail what the difficulty is with creating a continuous waveform, perhaps including some code you have tried which did not work properly?",
        "`WaveformsLibrary.GenerateContinuousSineWaveform();`",
        "Above i have pasted the code...",
        "@Abhishek What have you tried so far?Post some code.",
        "This design will cause increase code complexity and create tighter coupling which could causing difficulties in debugging issues or making future changes.",
        "I think you're solving a different problem.",
        "The OP is building a third party widget. You cannot expect every visitor to follow all these steps to get the widget displayed.",
        "I would advise against repeating margin-left when it can be moved to the style sheet - they are there to prevent code duplication. Style sheet bloat can be counteracted with consistent design; but even then - if preventing bloat is to save network traffic, it is still saved by sticking it in the style sheet instead of the HTML.",
        "@RoboTamer Where did you learn this?",
        "-1 sorry. Don't use inline styles, unless you really REALLY have no other option, otherwise, you will end up with a really messy html markup to start with.",
        "I think this is an anti-pattern.",
        "Take out the call to `First()`. (you should understand what you code is doing before you start asking questions about it)",
        "Pretty hardcore to keep this answer up :p",
        "Please don't answer questions with just a link. Also, link doesn't contain information pertinent to the actual problem, an assertion supported by vidur's own answer.",
        "The problem lies with the recipient, not the sending method",
        "I don't think anyone is going to download that file you linked to.  Who knows what's in there?",
        "What's the question here? The file is used by another process, there is not much you can do aside from closing the process...",
        "Hi Guys ,Is there anyway i am anyway i can remove the file from the process which is accesing it.One more thing i have two files in directory ,it is able to delete the first file ,but while deleting the second file it is showing the issue",
        "This won't work for december; you cannot use `13` for a month value.",
        "Do you have some kind of insight to share as to how the OP can create and verify forms using these three frameworks?",
        "This is an example of a ListView inside an Activity, not of ListFragment.",
        "Your content must have a ListView whose id attribute is 'android.R.id.list'",
        "Show your code. It's almost impossible to help if there's no context for these errors.",
        "I tried that as well, it doesn't seem to have any effect. Thanks for the help.",
        "if using images as a url content you can't define the size like that, that's why background-size is the best choice",
        "Not a question!",
        "Doesn't belong here at all. Read FAQ http://stackoverflow.com/faq before posting.",
        "Highly **unrecommended**. Modifying such monolithic solutions in the future is a nightmare.",
        "Its a fake answer.",
        "Sure, why to use java.util.Collections.sort(list) if I can write 30 lines of code :)",
        "Why so many down votes here? has anyone even tried to run this code or trying to understand the algorithm used?",
        "80 LVL ........",
        "Please do some R&D work before asking question here..",
        "74 questions, and you still haven't learned how this site works?",
        "There are a lot of working examples on the page you've linked. Just look at their HTML source… Or in other words: RTFM!",
        "Your code doesn't match the error. None of your lines contain `Hello(sys.argv[1])`.",
        "I ran this script on my box (Python 2.7.3) and it worked without any problems. I'm a bit confused that your error message says sys.argv[1] is out of range but in your code you are using sys.argv[0]. Maybe you are running the wrong script?",
        "You clearly have no idea what you're talking about. Enough said.",
        "I know i shouldn't but lol",
        "Try checking the documentation https://docs.djangoproject.com/en/dev/topics/email/",
        "Please show some code, and take the time to format your question in such a way that we have some idea what you're talking about.",
        "`$res` is a result resource and you need to fetch a row from it. It contains no data itself.  `$row = mysql_fetch_assoc($res);  echo $row['category'];`",
        "You are my hero. Thank you so so so much man",
        "first alarm: \"Select full_name From states where state_id = \".$_REQUEST['stateid']; Don't EVER put this in production, it's highly insecure. Did you hear about SQL injections ?",
        "If you want to be responded instead of buried with downvotes do not use \"URGENT\", \"IMPORTANT\". It is neither urgent or important for anyone but you.",
        "first thing to do: instead of writing `mysql_error()`, write `mysql_error() . \" Query: queryhere\", where queryhere is the query variable.",
        "urgent isn't a word for stackoverflow",
        "@yes123 \"urgnet\" even less :)",
        "no @yes123 he wrote urgnet :)",
        "what you have tried yet?",
        "You can use [ON DUPLICATE KEY UPDATE](http://dev.mysql.com/doc/refman/5.0/en/insert-on-duplicate.html) in mysql.",
        "How is it formatted?",
        "-1 _\"but both fail\"_ What does that mean, where's that code?",
        "What you have in **customerRecord[1]**",
        "contactID,responseDate,project,projectID\n1,6/4/2009,0-3 months,1\n2,6/11/2009,0-3 months,1",
        "This doesn't help if you're using a library like `MomentJS` -- you can't force it to use your wrapper function.",
        "Funny...but not for SO",
        "*Even* IE, yes I know it's hard to believe.",
        "A center can only be one point.",
        "Where is source code?",
        "without showing us a bit of code it'll be impossible you help. Ideally provide a link to a live example of the problem.",
        "See image links. I can't give you all the code, its for my work.",
        "Then it is really your work, not us.",
        "If the code is so important you can't share it, you cannot expect an answer. Hire a(nother) professional.",
        "If you want us to help you, give us something to work with.\n\nMaybe you can give us a reduced subset of your code on http://jsfiddle.net/ als least.",
        "I am sorry. But I found the answer to my own question. I needed to use the 'cells' property of the tr element instead of childNodes accessor. Not sure why it just stopped working all of a sudden when it used to but whatever. It is fixed.",
        "could you please edit your question, I think no one is able to understand your question in this format",
        "Can you please post some sample data? and explain briefly what you are trying to achieve and what have you tried so far? It won't work this way, no one would help you.",
        "Loose it as much as possible while asking a question so that we can help you more conveniently . .",
        "It is very difficult to understand what you r asking for... please use short,simple sentence to form question. It will be helpful for others also to help.",
        "Heya, welcome to SO. When asking questions, it's best to tell us what you've tried and researched so far, and be specific about the problem you're having. Note that you can edit your question at any time to add additional information.",
        "Even if your program worked, `PeekMessage` does not block the caller.  This means that your program will consume CPU even when idle.  You should use `GetMessage`.",
        "Looks like the answer is in the error message: &WindowManager::WindowProcedure. See http://www.crawfordology.net/tips/code/c++/member-pointers.html",
        "I want to use the regular expression to find all the frequency point form the date and compare the frequency point then array each line follow the frequency point.",
        "That's not an answer to my question. You should show what you have tried so far to demonstrate that you have put some effort in this.",
        "you can do anything. What have you tried ?",
        "I have no idea what you are talking about...!?",
        "Thanks, but I don't think that this is all that is needed. My question specifically refers to the allauth app.",
        "first and last name are already on the User model",
        "Do servers have same configuration? May be this server is pretty slow/low memory and your app works much slower there.",
        "The server configuration is higher compared with my local server. I think the distance may be reason for this.",
        "Individually, these questions might be fine, but they're not appropriate for this site given it's current form",
        "So its better to ask 5 questions instead of this one?",
        "in this case, yes.",
        "You question doesn't make sense. Try to split it in different questions with more info.",
        "Play class, subclass, abstract class, interface sandbox.",
        "you're already in the php side, why using open/close tags inside strings?",
        "Thanks Alian T for trying i was able to accomplish the task with the help of Alexanders answer, but thanks anyways for trying :)",
        "[GWT Case Studies](https://developers.google.com/web-toolkit/casestudies/)",
        "Please trim your code to the relevant parts.",
        "It's not really encrypted. It's just obfuscated. Run it through a JS beautifier and then manually pick it apart.",
        "This question comes into StackOverflow frequently. Better use the search.",
        "How can it not be \"available\" to you?",
        "Your app will die if you don't catch an exception anywhere",
        "Which error returns?",
        "What you need to get..??",
        "I think you mean `if (Result == value)`",
        "[What have you tried?](http://www.whathaveyoutried.com)",
        "Which part in using a loop don't you understood?",
        "Welcome to Stack Overflow! We encourage you to [research your questions](http://stackoverflow.com/questions/how-to-ask). If you've [tried something already](http://whathaveyoutried.com/), please add it to the question - if not, research and attempt your question first, and then come back.",
        "You can read the documentation of python strings here http://docs.python.org/library/string.html",
        "Code is not to \"look bombastic\".",
        "You should apply css rules to an anchor tag that make it look exactly like a button.",
        "I got no idea how to do this in PHP, I've done this in mysql once...",
        "can you show what are you tried?",
        "[See the documentation](http://www.ruby-doc.org/core-1.9.3/Array.html)",
        "For future reference, we welcome any valid programming question, provided that you've [done your research](http://stackoverflow.com/questions/how-to-ask).",
        "Yes, you can access string_val with `$arr['string_array']['string_key']`. And you could try it before asking.",
        "This just restates the question really.",
        "@MartinSmith Nope, It's a fact that Issue can be resolved using Derived table.",
        "A fact which is already stated in the question. The second example shows a derived table works. The question is **Why** is this the case.",
        "@PankajGarg Martin is correct. I know it can't be done, I want to know why. You just re-stated my question in a different way (not very different at all really) and posed it as an answer. It isn't one.",
        "the first two paragraphs of that wiki page seem to explain what happened",
        "@guido sometimes people seem to like other people to read stuff for them ;)",
        "there's no \"ruby on rails\" language.",
        "If there where such extension it would probably be .ror",
        "Ruby on Rails is a framework made on top of Ruby language. Its not a programming language.",
        "This is a security risk whether you take client input and run on the server or the other way around. It may be possible to run server-side, but certainly not on the client.",
        "\"Run the Shell script through Browser\"?? Script runs on the client side or server side? Client side -- NO. Server side-- Yes but its still bad to pass parameters to it.",
        "It is possible when you use a Java applet but I think it's a terrible idea (security!). Why do you want to do that? Also, web applications should generally abstract from the OS and even the browser used by the client.",
        "do you want like : run shell script on shell via your java program while parameters and script are from web form?",
        "Where are you shell scripts? Client or server? Are we basically talking about CGI here?",
        "Why is this question at -7? It's a valid question. It lacks details, but you can answer it properly right away.",
        "Have you tried it?",
        "Probably no issues if done right...",
        "Yes and it works fine. But Im not sure if its right to do it this way.",
        "Instead of posting a question, you could have tried and made several different attempts in the same time.",
        "Then why didn't you ask that?",
        "@Deefa There are plenty of reasons why this is the wrong way. If the construction of the class relies on a value, instead of hard-coding the value as a call to a static member, create a constructor that takes a parameter. This is what they are there for.",
        "agree with @AdamHouldsworth, its better to create parameterised constructor",
        "Are you sure you wrote correct desired output?",
        "To clarify Marco's comment: your example suggests all of the prefix $ should be included while the suffix < should be excluded. This doesn't match your requirements specification. Is this correct?",
        "You say \"without $\" but in expected output you have $$$ included...?",
        "we reject your desired output and put in it's place `Hello World`",
        "What is the desired output if the input is \"... text $$$ Hello $ World </stop>\"? Should that \"internal\" $ be treated as a boundary or as content?",
        "You completely changed your question, too bad...",
        "If you're trying to **use regex to parse [X]HTML** than read this [**answer**](http://stackoverflow.com/a/1732454/449906) first.",
        "You do not mention the SDK, or what you have tried so there is nothing we can really recommend to you other than reading up on what a [Raw Image](http://en.wikipedia.org/wiki/Raw_image_format) is and using a [library](http://www.libraw.org/) to process it.",
        "Ok, reposting question with details...",
        "You could search... google is your friend",
        "I need to do it in prototype",
        "You should specify what exactly you want (there's not really a question, is there?), as \"stopping\" a thread may refer to _suspending_ it vs _terminating_ it (Luchian Grigore assumed the latter in below answer). It is also unclear in which context you want to do this. Terminating or suspending a thread is not something you normally want to do, unless there's a good reason. Usually you block or sleep when you don't want a thread to do work and return from the thread's entry function when you want it to end. Everything else is unpleasant and risky.",
        "Is there any question? I would vote for close.",
        "-1: what have you tried?",
        "A straight line between two points or a curvy line following finger movement path?",
        "I've to draw line/curve as per I move finger on screen.",
        "@J.C.Leitão, I tried Line_strip to draw lines but I don't know how to draw achieve it.",
        "Stack-overflow is not a place to ask this kind of questions. You should formulate the question in a specific problem, *after* showing what you have tried. Have you googled it? If yes, what is still the problem?",
        "Yes, but I didn't get anything. Specially I'm new to opengl.",
        "-1 http://www.emilvikstrom.se/whyidownvote.html What is your question? What does your code look like and what errors do you get?",
        "My error in my question, and my future code there too.",
        "Your english is hard to understand. Try google translator.",
        "Its a google traslator result, sorry",
        "Please give a clearer description of your problem.",
        "Im edited the question",
        "Looks like homework, is it? What have you tried?",
        "I would try to pass these variables to python through it's cmd line interpreter and use the NLTK for natural language processing. Take a look at [google groups page on using NLTK to find syllables](https://groups.google.com/forum/?fromgroups#!topic/nltk-users/mCOh_u7V8_I) to give you an idea of how it would work.",
        "thx, but i need this script on bash",
        "Please post your solution as an answer and mark it as accepted.",
        "Neither: You want to read tokens ([lexems](http://en.wikipedia.org/wiki/Lexeme)). In XML a lexeme is either a tag or a block of text.",
        "You need about 3000% more detail.  What code do you have?  What have you tried?  Is this homework?",
        "Way way way too vague.",
        "FTP, Text File, HTTP? You're connecting to a server to update a leaderboard or something? what do you have in mind about this? please describe your current situation, what you try to achieve and what do you have now, otherwise we're not going to be able to comprehend the whole problem.",
        "You don't create it .. It is a sequence on the database server.  Everytime you insert it increments.",
        "You can create it if you don't want auto-incrementing ID's.",
        "Use an autoincrementing int PK in your database. Problem solved.",
        "What does this have to do with Java?",
        "What mobile?  Blackberry?  Android?  Generally speaking, you will definitely need Eclipse, but you will need a different plugin depending on what you are developing for",
        "Depends entirely on the phone. For example, an Android phone would use Eclipse, ADT and the SDK.",
        "What's a \"singe phone\"? The more effort you put into making your question clear and precise, the better the answers you'll get.",
        "Do some googling. This is not what stackoverflow is for.",
        "Go and download [JDK](http://www.oracle.com/technetwork/java/javase/downloads/index.html) and [Netbeans](http://netbeans.org/) and install into your PC and start coding..",
        "what i want to write for nokia",
        "It looks like fairly standard XML so any method you want will be fine. What have you tried so far?",
        "i have used NSXML parsing but didnt get the result.",
        "Why don't you share with us what you have tried (post some code snippet) and explain WHY it doesn't work (\"it doesn't get the result\" doesn't really tell us anything) and detail what you have tried to debug it and get it working.",
        "Is this homework?",
        "You cannot add an object of the type `Test` to an array of the type `Course`.",
        "i need to fill course object with five tests while using my test class that has three fields.",
        "How should we be able to tell you how to add `Test` objects to a `Course` object when you haven't showed us the definition for the `Course` class? You need to clean up your question: improve your language, add relevant code (`Course` class definition for instance), and remove irrelevant code (like the `Form1()` constructor). I'd also recommend reading this: http://bit.ly/PerfectQuestion",
        "It's all in the documentation: [`itertools.product`](http://docs.python.org/library/itertools.html#itertools.product). This is a lazy question that is easily solved by a quick google. It's also multiple questions in one. Go read the SO FAQ and then come back.",
        "yes, that's where i just came from. i read that before i came here. I understand what it prints out. but i want to understand it better then that",
        "Read (and work through the examples!!) the official Python tutorial. After the first 5 chapters, you should have a fundamental understanding of the language. See http://docs.python.org/tutorial/index.html",
        "@thebiggerchadder If you truly read the docs and don't understand it, then go learn Python first. The docs give a complete description.",
        "List comprehensions don't go well together with printing. One of them is a functional concept, the other is an imperative one. What exactly is it that you want to do? Probably a `for` loop will be a cleaner solution.",
        "\"print an element out of an array every other element\" .. I don't understand this very well, do you mean every other element? Even or odd index?",
        "Can I ask why you need it to be in a list comprehension and not in a `for` loop?",
        "Do you want every other (i.e., every second) element, as your question seems to ask, or all elements except the first, as your example shows?",
        "What's your question?",
        "What is your question, please?",
        "What is your question and what errors are you getting?",
        "I am getting following errors - Unknown column 'AA' in 'field list' --- CALL P1(\",\",\"value1\",\"AA\");",
        "No no no no no...",
        "This might just be a troll but some people out there are actually doing this..",
        "Might as learn how *not* to do it as well",
        "Wow. This is sort of scary.",
        "We should note this method could potentially open your website up for attacks. If the ObjectKey is given from the user, e.g. a form variable, then the user could inject JS code to do anything.",
        "To answer this, we need to see the entities that map table1 and table2.",
        "What are the entities mapping those tables? What have you tried? What don't you understand in the Hibernate documentation? http://docs.jboss.org/hibernate/core/3.6/reference/en-US/html_single/#queryhql-joins",
        "table1 contains columns id,code and table2 contains id,name, repadd,repag. i need to pick all the data from table2 whereever the id match.",
        "If you only care about existence/non-existence of rows, I'd explicitly warn *against* using `COUNT(*)`, since it has to process the *entire* table to compute the result (whereas `TOP 1` or `EXISTS` can stop after a single matching row has been found)",
        "Agree with @Damien_The_Unbeliever - you should never use a \"count\" if you only care about \"exists\" - that causes extra work",
        "Bitmap is not serializable!",
        "please check this Link : http://stackoverflow.com/questions/5871482/serializing-and-de-serializing-android-graphics-bitmap-in-java",
        "You have to be much more detailed on what you want and what have you already tried. Also try to show some research effort on your part.",
        "No dude!! I DON'T want a single file!! I want a whole Folder, whose sub files are undetermined pre-runtime!!!",
        "I can't believe you asked it here",
        "Many people can as its a very common question. What do you want to knwo that the million pages on this topic don't tell you?",
        "Have you googled, yahood or binged this at least?",
        "\"Those who cannot remember the past are condemned to repeat it.\" -- George Santayana 1905",
        "@JacoVanNiekerk Trying to be politically correct? :p",
        "@Keyser... I live in South Africa... it's the main theme here :)",
        "This is wrong.  You're thinking in terms of buzzwords.  If you know C++ you know that the semantic differences between a struct and a class are few, minor, and do not in any way conflict with OOP principles.",
        "Did you look at one? What did you see?",
        "Really?  You earn over 4400 in rep and still don't know how to ask a question here?",
        "@Sparky672 what did I say that was wrong?",
        "@JohnConde Yes.  I wanted to know if there was more programming involved.",
        "Besides the fact that it doesn't make sense... it was something you could easily see for yourself just by looking at a template.  See bullet point #1 here:  http://meta.stackexchange.com/a/128553/157574",
        "@Sparky672 I thought I met point #1 and the following paragraph.  My question was brief and to the point to know if there were other programming items other than what I had already seen.  \"Easily\" is in the eye of the beholder.  What is clear to you, may not be clear to me, thus my question.",
        "When a file starts with `<?php`, I'd say that it's easy to see it contains PHP.  But what does _\"in the context of the WordPress 'loop'\"_ even mean?",
        "@Sparky672 if you knew nothing about the WordPress loop, why are you commenting?  It is an integral part of the programming paradigm of WordPress.  Theming is part of that, but the actual presentation layer  may contain more than CSS and HTML.  I do not know for sure, thus, my question.",
        "Hmmm, lol... I never stated I knew nothing of the Wordpress Loop!  I'm just trying to figure out exactly what you're trying to ask here... based on down-votes, I'm not alone.",
        "@Sparky672 I somehow doubt you care what I have to ask.  It's clear.  I think it doesn't meet the test of what the SO folks consider a \"real\" question.  For me it was important, but others obviously could care less.  So be it.",
        "Because the element is higher than the viewport, so the bottom of it is not visible until you scroll.",
        "http://meta.stackexchange.com/a/128562/150789",
        "perfect answer :)",
        "Building an iOS app might be easier based on Objective C, I guess...",
        "Hi, thanks for the recommendation, i just needed an opinion, based on someone experience..",
        "Google for \"gorilla vs. shark\".",
        "Google says, gorrila wins :)",
        "But didn't they begin to support it in 10.7.2+? If you switch to 'core' you get this: https://developer.apple.com/graphicsimaging/opengl/capabilities/GLInfo_1073_Core.html",
        "-1: This answer is wrong.",
        "Have you tried doing that?",
        "Couldn't you have tried it faster than asking this question? :)",
        "I always realize the answer to my own question while formulating it in writing!",
        "That's not a namespace. That's an object.",
        "@recursive. This question can end up with a reversal badge... I'm missing only 19 upvotes... `:)`",
        "It is important to realize that `nameSpace` is just a *variable* which names an `Object` and that objects have *properties* which are mappings of [stringified] keys (such as `first`, `foo`, etc.) to values (such as 'a' or 'foostring'). There is no concept of \"namespaces\" in JavaScript (only various scoping and lookup rules which are more universal and not demonstrated here).",
        "People who upvote questions like this shouldn't be allowed to vote.",
        "Have you seen http://ninite.com? Your phrasing screams \"I'm writing a trojan\", for what that's worth.",
        "Trojan with an installer.  LOL :)",
        "think adware. how many legitimate apps have you installed that also come with some unwanted extras, unbeknownst to you?",
        "@jcolebrand, thats right!",
        "Can you let us know more about your company so we can all avoid it like the plague?",
        "You should be able to augment this old question to suit your needs: http://stackoverflow.com/questions/11084106/how-to-copy-a-pattern-from-a-string-variable-in-perl/11084290#11084290",
        "`yesterday and the day after` What exactly are you trying to do?",
        "This is kind of a REALLY BIG problem that is unlikely to be answerable in a Stack Overflow question, aside from perhaps pointing to an image-recognition API such as TinEye.",
        "Have you called do()?",
        "dont use do, for, while etc as function names buddy, but do accept answers. :)",
        "That is a dict in a list.",
        "That looks like JSON data. Is it?",
        "I think you mean dict({'X1': val1, 'X2': 'val2', 'X3': 'val3', 'X4': val4}) Read this. http://docs.python.org/library/stdtypes.html#dict.items",
        "How do you want to send this data? As files? As a webservice call? Over a network port?",
        "Read a line per file and send the line info per second, maybe json encode ... over a network port using rabbitmq is a possible solution",
        "Does the file have to be read in real-time or can it be preprocessed?",
        "It can be preprocessed for a json structure and after that send the info, but with 10000 files i really dont know how to emulate it, maybe run a program in java at the same time for each file ... uhmm problems with buffer?",
        "may the question make sense, and I will come back.",
        "possible duplicate of [Css: -webkit-border-radius for Internet explorer?](http://stackoverflow.com/questions/3647974/css-webkit-border-radius-for-internet-explorer)",
        "are you did any effort for searching the answer",
        "He wrote that `int **p = NULL;` works.",
        "I don't really understand the question. The process ends when you close your application. What do you mean with _but still the dist application running?_",
        "What do you mean by \"the dist process\"?  Are you referring to some specific external application called `dist`?",
        "A string already contains formatted text. Why don't you be more specific?",
        "Please read the `do your homework` section in [ask]",
        "I have taken away the [tag:KINECT] tag since this has nothing to do with Kinect",
        "I did this exact same thing in another project though. MyClass and myFunction are actually both copied and pasted from there.",
        "-1: Of course you are wrong (here: \"_...is a variable, not a value so you can't use it as a default parameter...\"). You can use anything you like as a default argument, but it (the assignment of this to the default argument) will be evaluated when the function (the one that has mentioned default argument) will be defined.",
        "`if( (a=10) && (a==20) )` Maybe not a compiler error, but what...?",
        "Have you considered writing more readable code? And by the way, my libtelepathy.so needs to be upgraded, so would you mind telling what was the compiler's output?",
        "@uts:  I fixed the indenting for you. Next time on, please indent your code before posting here.",
        "Also, `return a >= 20 ? 10 : 20;`",
        "What's wrong with using the year itself as a unique ID?",
        "Not sure what you mean. Wouldn't the year number be a unique ID in itself? Can you clarify?",
        "i mean that there wont be any duplicates while year.",
        "That's not even close to unique. Why are you limiting it to a year anyway. Why not just have a unique id, and if you want to know what year it is store that as well.",
        "I tried to clarify your question based on your comment (that is now gone). Hope this helps stem off the down votes.",
        "read up on \"else\", the part of an \"if\" statement that gets executed if the condition is false.",
        "I know the problem is, there are certain conditions where both of the \"if\" statements can become true.. therefore I am having two if conditions doing there job at the same time... What do you think?",
        "Please post your code.",
        "@Matthew You may require to use `return` before going to next `if`.",
        "updated question thanks",
        "`else if` maybe?",
        "Not sure this should have been closed.  The guy is 'getting there.'",
        "Not sure why the question got closed :p",
        "@DrColossos Yepp thats the one: else if. thanks",
        "Welcome to Stack Overflow! Unfortunately, this isn't a very useful answer to the question. The question is about running specific unit tests from gradle (a build system), not about accessing Java classes in another package.",
        "See [ComponentImageCapture.java](http://stackoverflow.com/questions/5853879/java-swing-obtain-image-of-jframe/5853992#5853992).",
        "Post code......",
        "I don't think `yy-mm-dd` is a valid date format.",
        "Have you attempted this yourself? This problem is trivial to solve with even the slightest amount of basic searching. SO is _not_ here as a \"code this for me\" resource.",
        "Have you try something ? Take a look at strtotime function",
        "@Rocket I just tried the sample string `03-10-10 10:12 PM`, and `strtotime()` gave me an epoch (although not necessarily the correct one).",
        "@JamWaffles: `date('r', strtotime('03-10-10 10:12 PM'))` says `Fri, 10 Oct 2003 22:12:00 +0000`. :-)",
        "`date(\"c\",strtotime(\"03-10-10 10:12 PM\"))` is `\"2003-10-10T22:12:00+02:00\"` here, my `strtotime` version has no problems with the format. One could always use `DateTIme::createFromFormat()` to be on the safe side though.",
        "This concerns client-side routing using `hashs/hashbangs/pushstate`.  Server side is not the answer.",
        "@Trevor   The problem is not with the client if the server to interact, it is not a static page, be afraid of no significance.",
        "I think you might want to read a little about client-side URL routing with Backbone before you try to answer questions about it: http://documentcloud.github.com/backbone/#Router",
        "SO isn't about getting points, it's about providing quality content :)",
        "Perfectly said ....that is one of the reasons I keep my quality bar for acceptance a little high! My grading is very strict :-)",
        "Note that for a good answer typically a good question is required as well. A -1 for this question as this does not meet my rather low quality bar for questions. See for example the comment of @aaamos on what you can improve to this question",
        "I am sorry! @aaamos has not given any constructive comment. He has just given out an angry rant. I don't find any constructive comment or suggestion in his comment. It just seems like an outburst.",
        "I apologise if that came across as an \"angry rant\" - it certainly wasn't, but perhaps I could have phrased my question a bit more gently. I am glad to see you've edited out that screenshot (which contributed nothing to your question); however, I'm also a bit disappointed that you a) still haven't answered my question b) reacted to what most seem to think is valid criticism of your question with what I take to be a glib comment about the quality of the answers. My intent in stating this is not to offend you but to help teach you about how SO is supposed to work.",
        "Why does the info need to be hidden? Is it sensitive information? Please provide more details about your scenario.",
        "What kind of file? Any file? Specific type of file? Is it a file from your application? Another application? Which one?",
        "You could note the binary hash of the file, which would be unique for each unique file.",
        "Modify how?  What have you tried so far?  Anything?",
        "What is a drop box? If you mean a select box, it would have taken you less time to Google the answer than it did to post your question.",
        "In order to get more help you will need to give more context. Show us some markup and styling because without we have nothing to go off of.",
        "i mean list box please help",
        "Sorry, it's not clear what you need. Try to add more details",
        "Possible duplicate of: http://stackoverflow.com/questions/1895476/how-to-style-a-select-dropdown-with-css-only-without-javascript",
        "What are the issues you are having? Please describe the problems more precisely.",
        "I think I described it pretty well in the comments... nothing is returned back when I do     \"memcpy(&structReturn.cLastName, cTempL, strlen(cTempL));\" for     \"char *cTempF = (argv[0] ? argv[0] : \"NULL\");\" but is returned for     \"char cTempF[] = \"dog\";\"",
        "What do you mean with \"nothing is returned\"? Are you saying `memcpy` doesn't copy the memory contents from `cTempF` to `structReturn.cFirstName`?",
        "It is as if the thread is halted... but no errors appear.  But as I said if I do \"char cTempF[] = \"dog\";\" .... it works fine.  So it appears to then be something in \"char *cTempF = (argv[0] ? argv[0] : \"NULL\");\"... but I can print cTempF.",
        "Sorry, it's still entirely unclear a) what happens, b) what you expect to happen. Also, the definition of `myReturn` may be helpful.",
        "What is `//this \"short int\" block will return if I comment the above 2 blocks` supposed to mean? There's no `return` near that, so does it segfault, or what?",
        "broke it down a bit more",
        "Please, describe _in plain text_, using entire sentences, what you expect to happen, and what happens instead.",
        "you can't. end of story.",
        "Voting to reopen since the \"duplicate\" is not the exact same question.",
        "Good people, can you explain why are you voting down? The problem seems to be a legit programming and code related issue",
        "@ZoltanToth: Actually, something like this shouldn't be done in a programmed way but via the license.",
        "@ThiefMaster Sure licencing your product is a good idea, but just look at Microsoft, Adobe etc. - they all doing enormous efforts to keep their code as protected as possible in addition to all their licences.",
        "i try this [link]http://stackoverflow.com/questions/2640053/getting-n-random-numbers-that-the-sum-is-m but is not working",
        "This question borders on the occult and \"black\" coding, all this talk of witches and such.",
        "@user1494324 what have you tried?",
        "I have a feeling it is homework",
        "How randomly distributed do they need to be?",
        "[What have you tried?](http://www.whathaveyoutried.com)",
        "Not only that you don't show any research effort at all, your question isn't clear enough.",
        "Damn! I love challenges to much! I wrote an answer to this question...",
        "You need to do what ?",
        "It's difficult to tell what's being asked here.",
        "What exactly do you want to do? Convert the string of the form (1,2,3,4,5) to an array? Edit the question and make it proper.",
        "OP wants to convert a `long` array to `string` array.",
        "Google `php difference two dates`",
        "one of this times is time of now and other time is time that saved in a session few second ago",
        "@Pekka I use that but I receive 0",
        "There is a *huge* difference between them.",
        "i searched, but i didn't find anything. and ask for helping.",
        "[Check for Android Drawables](http://androiddrawableexplorer.appspot.com/)",
        "@musaqilMusaqil :  see this button example http://tech.chitgoks.com/2011/05/17/android-colored-gradient-buttons-using-xml/ .but in your case use TextView instead of button",
        "You have posted the same [question](http://stackoverflow.com/questions/11304956/how-do-i-create-the-button-that-shown-in-picture) without precise modifications.",
        "Try http://www.google.com",
        "+1 because possible duplicate doesn't mean that there is no research effort",
        "http://whathaveyoutried.com/",
        "[What have you tried](http://whathaveyoutried.com/)",
        "Hi and welcome to Stack Overflow!\nThe Stack Overflow Community  might be able to help you figure out the problem\nbut is not able to without concrete data and this is not a \"we write the code for you\" type of site.\nHelp us help you, by sharing the code you're using right now, possibly some sample data and any possible errors you encounter.\nAdapt your question to include those and you'll surely get a helpful answer. Thanks for considering. :)",
        "Apple has taken time and effort to write the iOS documentation. It contains all the information you need, especially for something as basic as this. Have a look at `UIWebView`'s `loadHTMLString:baseURL:` method.",
        "It is not clear what you are asking",
        "Look at answer..............",
        "Just search your question tag [Https from android application](http://www.google.co.in/search?q=Https+from+android+application&ie=utf-8&oe=utf-8&aq=t&rls=org.mozilla:en-US:official&client=firefox-a) on google..",
        "We are no Chinese takeaway.",
        "But I did it on other websites and it worked. I compressed and upload to CDN and current sites does work with gzip file, and it appears as j.gzip in the js source file as well. Maybe I remember wrong, I will try the YUI and tell you how it went.",
        "This answer is not correct. [It is quite possible to serve pre-compressed static content.](http://goo.gl/h08FE)",
        "Pointy, you are absolutely right, it is possible, but it depends on you webserver configuration (or CDN configuration).",
        "I found the problem. The reason `onSaveInstanceState()` was never called, is because I added this line to the AndroidManifest.xml file: `android:configChanges=\"orientation\"`, which as far as I know, is intended to deal with events line orientation change and sliding hardware keyboard manualy for better performance.\n\nRemoving this line fixed the problem.",
        "He specifically said in the question that he did a `chmod +x`.",
        "I did not know that +x = 755",
        "but that's exactly what to expect. Your first variable is named `a`, the second is named `p`",
        "Why? Why> Why is one interested in the name of the variable name?",
        "What output do you expect?",
        "@EdHeal: debugging.",
        "He is expecting a b=2 on the output but it doesn't work because his macro is made to spit out the variable name which changes according to the scope that he is operating in.  In your sub functions the compiler considers the name of the variable to be the local scope variable name and will connect those compile symbols on linking to higher levels of the scope.  The only way that I can think of to store the name of the variable is to call your macro from the same scope and then hand it into a class constructor or other function to maintain the varaible.",
        "@Wug - A debugger is easier and works.",
        "Very poor naming conventions: macro name does not describe its purpose; identifier starts with an underscore '_'; no comments as to the purpose or use of the macro.",
        "Really, if youcan't do this, you shouldn't do iOS development, you'll damage the system one day...",
        "Come on, everyone has to start somehow! Sumit should google before asking on SO though, or better get an iOS book.",
        "Stackoverflow is no code gen machine.",
        "@juergend It seems that it is, though.",
        "Please see the [FAQ](http://stackoverflow.com/faq#questions) for some guidance on SO so that you can use it in a, *to you*, helpful way which will indirectly also benefit the SO community.",
        "Hint: If you fix your indentation, it will be clear what the error is.",
        "It's due to sloppy coding pure and simple. Take care when you code, line up your braces, watch your spelling, compile often and fix all complilation errors before adding new code. That will prevent these types of errors from happening.",
        "On top of all the other problems, why don't you just replace the body of TwoThirdPower with `return Math.cbrt(A*A);`?",
        "AJAX (Asynchronous JavaScript and XML)",
        "http://forums.asp.net/t/1012986.aspx/1?How+to+Redirect+page+without+refresh OR mvc ajax in 3 and above `:)` +1 for undefined",
        "@undefined : I know about it but how?",
        "see this plugin www.asual.com/jquery/address/  but notes the url changes with slashes only on browsers that support this feature. IE9,8 doesn't therefore the plugin will use # with those",
        "the above plugin does what you are looking for. simply it is an ajax and html5 history function. github using similar technique.",
        "-1 for \"look at this site, i want mine to be like this.\" if you are a programmer, you should exactly know what your goals, requirements are. The way you gave the example is justified for clients, not for developers.",
        "@itachi : I've just explained my requirements through similar example just in case if anyone don't understand. there's nothing in my question to down vote. If you don't want to answer, don't disappoint someone either.",
        "Tbh, that is not a good example of multithreading. It only shows the technical side, not how to use it properly. Multithreading is not instant win, it won't magically accelerate your application.",
        "Please post your code, not a link to the template you followed.",
        "how many cores does your machine have?",
        "How about posting the code you have rather than the tutorial?",
        "Without looking at your code, I cant be sure, but based on the code in the blog, the threads are sleeping for up to 5 seconds each. This is also impacted by the size of your thread pool. Show us your code for more.",
        "[What have you tried?](http://whathaveyoutried.com)",
        "You create an event listener for `cb1` which calls some module that contains the business logic for determining the values to display in `cb2`, then bind `cb2` to those values. (You also come up with better variable names.)",
        "What will happen if you choose B?",
        "[What have you tried?](http://whathaveyoutried.com/)",
        "downvoted for a very unclear question.",
        "are you aware of MSDN?? http://msdn.microsoft.com/en-us/library/system.windows.controls.datagrid%28v=vs.95%29.aspx\"",
        "he/she is now, because almost every answer includes a reference to MSDN.",
        "Your question is incomplete, but yes, you can use socket to communicate on WAN (basically, a Web Server contains Server Sockets to communicate over a WAN). It would be good if you also post what you really need, maybe there is a Java technology that can help you with your functional requirement development.",
        "Short answer: Yes, of course.  Why not?",
        "This claim was also made by a comment to the accepted answer by mitch and refuted by @iirekm: This pattern is fine from java1.5 onward.",
        "Can't you just `std::cout << static_cast<int>('^');` and use that? Or just reference an ASCII table.",
        "Uses ASCII code to output '^' to console: `char c = 94; std::cout << c;`",
        "and another example : std::cout << '\\x5e';",
        "If you don't want to use the caret character: `std::cout << \"??'\";`  This has the advantage that it is guaranteed to work on all platforms.",
        "http://whathaveyoutried.com? SO is not here to do the work for you, it's here to try and help you when you're stuck with a *specific programming issue*",
        "@user1514138 plz read it http://stackoverflow.com/faq",
        "I think you can avoid dovnvotes and possibility of closing this question by providing what you have done so far and the specific area that you are struggling with :)",
        "I tried using the 'if' and 'else' statement but I get stuck in defining a java class properties.",
        "have you tried combining the whats-it with the thingamajig. (seriously though... not enough inforamation all all to provide any sort of sensible answer).",
        "Dude - the Basic Auth is a foundation of the web. You really ought to be able to do some very 'basic' research yourself.",
        "Consider reading something about the basic stuff ([this](http://msdn.microsoft.com/en-us/library/system.net.httpwebrequest(v=vs.95).aspx) might be a good starting point).",
        "You shouldn't parse Javascript code with regex, as Javascript is not a regular language and a `{` symbol can mean different things in different contexts.",
        "There is the `function name (/*complicated stuff*/){` and the `function (/*complicated stuff*/){` syntax. match those, get their location, and be happy in the easy cases.",
        "@Nish, `var whoops = \"function FOO\";`",
        "People like you are the reason why we have this security and hacking problem.  Language class mismatches while parsing lead to enumerable invisible regions in the parse \"tree\", cutting both ways (invisible for the JS interpreter or for your \"parser\").  In there, you can hide all sorts of stuff.  Carefully constructed Hidden Stuff(TM) will explode on you, smash your stack, steal you wife and (maybe) root your box.  But please, continue!  ;-)",
        "@nobody, *hackers* are the reason we have security and hacking problems. Don't blame the victim. That being said, it's important to teach people so that they don't become victims.",
        "What have you tried...what is the code that generates the page.  Your question shows no effort on your part that you've attempted to solve this yourself.",
        "google.com > SO 90% of the time",
        "Please be more specific on what you are trying to do and the platform (iOS developed with XCode or some \"HTML5 To iPhone\" platform, like PhoneGap).",
        "This isn't being displayed on a mobile browser just an application this application matter of fact. http://cydia.saurik.com",
        "`string.Contains`, `string.IndexOf`",
        "Did you even try to search ? *Please do the needful* : Put in some effort before posting",
        "Either approach is acceptable.",
        "Try SDL. It can be used with OpenGL but should also make other aspects of your game much easier to program.",
        "If \"task\" = \"homework\", please say so, otherwise people will downvote - arbitrary restrictions on questions don't go down well without a reason.",
        "Sorry, I don't get it... Can you rephrase it?",
        "Wow, I did not know C# hat the \"do\" statement..",
        "are you trying to reinvent the C# do{}while(); loop",
        "please improve quality of your question else every one will do downvote...",
        "where is the problem ?",
        "Share you css..",
        "The CSS is there - just press F12. The problem is that when the page first loads, the image appears on the left instead of being centered. @RohitAzad",
        "Apart from the fact that its a bad question, \"I didn't find anything like that on the web.\" is very unlikely!\nBut here is a little help: http://www.codeproject.com/Questions/228987/Calculate-Age-from-Date-of-birth-using-Javscript-o",
        "there's nothing like a bad question, only bad answers.",
        "add a meta tag to your form ?",
        "Do you really just want to call the event handler, or do you want to reload the page? A bit more effort on the question will get you better answers (or, at this point, any answers at all). :-)",
        "This is possibly one of the open-ended questions which Stackoverflow isn't designed for - http://stackoverflow.com/faq#dontask",
        "Reminds me of [madeupstats](https://twitter.com/madeupstats)...",
        "Voting to close as non-constructive → soliciting debate, arguments",
        "This proves only that if you base statistics on flawed data gathering techniques, you get flawed statistics.  Also proves that many people can be easily deceived by flawed statistics.",
        "Please [consult the manual](http://perldoc.perl.org/perldata.html#Variable-names)",
        "Besides data access described above, you should probably read the perlfunc discussion of defined, for what happens when the keys don't exist in the hash. The suggestion to read Learning Perl is a good one, and will help you immensely I think.",
        "It's \"wrong\" in php either: This will assign `'something_cool'` to `$var1` within the function and not (what you probably expect) to `$var2`. I don't know, where you get this from, but there are no named parameters in PHP....",
        "I swear I've done that in PHP... ok I was probably working with WordPress where it sets default values for parameters, and I was only changing one of them. Hence why I thought I could do that same in JavaScript. D'oh!",
        "But (as mentioned) you can only set parameters from left to right .... There are no named parameters in PHP!",
        "StackOverflow.com is *not* a free coding service. What have you tried?",
        "Im trying to make an app which calculates at what speed a person is travelling while he is running or jogging.",
        "Please post your code.",
        "There is no `timestamp` function in standard C++. You might be looking `std::time` which is in `<ctime>`. Use it like `ts = std::time(0)`.",
        "What is your thoughts on what it does?",
        "Are you taking the exam right now? :-)",
        "Casting integer to a pointer? No thanks.",
        "It's just an assignment. The next line would be interesting, though.",
        "did you try Google?",
        "Also, the method names are pretty self explanatory...",
        "Not a real question, unless you really can't tell that one function gets an element by its id and the other one creates an element. I don't remember which one does what though, I'm confused by the missing spaces and capital letters",
        "What's the difference between transversing DOM elements and creating new ones? All possible differences, except that you're working with DOM elements.",
        "I don't understand your question. What do you want to do?",
        "what is something? something? i understand nothing....",
        "@iblue I just don't want to use chained methods. I want to separate them in different places",
        "be more clear the next time",
        "Show us your code....",
        "It's a bit hard to help if we can't see the code to figure out what might be wrong.",
        "Imagine going to a car repair shop and asking them what is wrong with my car it is making a noise when it should not. How are they suppose to know without inspecting the car. We need to see your code so we can see what the problem could be to help you.",
        "Are you using jQuery or any jQuery plugin for this?",
        "Whenever you ask someone what is wrong with your code, they need to first see your code. [How To Ask](http://stackoverflow.com/questions/how-to-ask)",
        "@ Hanlet its simple Sql query",
        "what type of database is on the back-end. why are you using Transact-SQL \"CONTAINS\" rather than standard SQL \"LIKE\" keyword? - please provide your query code",
        "Your requirements don't make sense to me. Why would searching for `verytest` match `very long test`? The word `verytest` doesn't exist in that string... you want to be able to match arbitrary combinations of words within the field?",
        "More info needed. Are you wanting to create it programatically or using the form designer????",
        "what is preventing you just place a single control on a form ?",
        "I want to create it programatically.",
        "Can anyone sending an example of it to me?  \niman.yasouriATgmail",
        "`I had a intervene ware I could use any lagug` I hope you didn't try to use English",
        "Just for future reference, many browsers have built-in spell checkers, and it is highly encouraged you use them.",
        "possible duplicate of [Word counter: Doesn't seem to give the output I need (PHP)](http://stackoverflow.com/questions/11651271/word-counter-doesnt-seem-to-give-the-output-i-need-php)",
        "you don't need parenthesis if you are not going to pass parameters to a constructor function, or if a constructor function has default values it can use.",
        "parenthesis are not strictly required for object instantiation",
        "also, re: your edit - the class doesn't strictly *need* a constructor either.",
        "I fixed the typos, but FYI this answer is not correct. Also, to address the question you raised in your \"answer\", classes without a constructor simply... don't have a constructor. There isn't a \"default\" one, nor does a class require one.",
        "Is this a programming question? If so, it's unclear and seems to lack research effort. If not, then perhaps you should consider posting on an Android forum. [FAQ](http://stackoverflow.com/faq#questions)",
        "This question is too vague / clear to be answerable without *guessing* what you really mean.  Please clarify the question ... or it is likely to continue to attract down-votes, and eventual closure.",
        "Ok i apologise. this is not a programming question per se. I moved the question to http://webapps.stackexchange.com/questions/29438/how-to-switch-google-plus-managing-as-page-in-the-g-android-app How do I close this question myself?",
        "even then I am not entirely sure this is the right SE site to move to. If I am not right, please tell me. Down-voting me at webapps without telling me where won't help.",
        "In this case jQuery most likely turned your request into Get according to their documentation: Note: This will turn POSTs into GETs for remote-domain requests. http://api.jquery.com/jQuery.ajax/",
        "Why dont you set its scale property ????",
        "do you play 'paper toss' game..? if yes them i want no make a animation like a paper goes to basket in 'paper toss' game.",
        "Yeah I have played...",
        "if yes then how make animation like a paper goes in basket?",
        "The game is made in 3D.",
        "As per my suggestion this game is not 3d but graphics are 3d",
        "I don't think so because the bounce (high, direction, etc.) change depending on the distance. They must work with a 3D physic motor and so in a 3D environment.",
        "are you able to connect in one database? If yes, add two more connectionstrings, and then replicate the same procedure you've done to the first.",
        "This is not a programming question. And it has been discussed already. Do a google search... Most uses the official Eclipse, then comes IntelliJ and then netbeans. AFAIK in popularity.",
        "@AndersMetnik I did google it. But I'm am interested it what is the current situation. And I was also interested in what SO community has to say about this. Based on number of views and users that found answers useful I'm not the only one. So thanks for the  'negatives'.",
        "What is your problem? getting numbers from rtf or sorting? And what does `special line` mean?",
        "How many is \"lot\" of number? What is a \"special\" line?",
        "What have you tried so far? Hint: You have to convert the text values to integers so they sort in the order you want, instead of by text value (in other words, the integer order is `1, 12, 99, 1023`, but the text order is `1, 1023, 12, 99`, so you have to: take the text out, convert each value to integer, sort the integers, and then convert to text when you put them back in the `RichTextBox`).",
        "It's already a list...",
        "Are you able to explain what you are trying to do, or the data that you'd like to store in this object? The 'list' that you've described isn't a list, is illegal, and doesn't make sense.",
        "The signature of a List is `List<T>`. This mean you can provide only one type between the bracket. What definition would you expect from the example you gave ?",
        "http://ru2.php.net/manual/en/function.array.php Don't read documentation @ ask on stackoverflow",
        "In which situation are you setting this? $_GET, $_POST, $_SERVER, $_HTTP, $_FILE, $_SESSION? Are those what you're talking about?",
        "That depends on your script. It's impossible to say without any more code or information.",
        "You need to add more context. Without anything specific (e.g. the software this is relating to) it only means that an array variable is set.",
        "\"like a chat room\" so if it is not a chat room - what is it ?",
        "[Here's the link to meta](http://meta.stackexchange.com/a/23326).",
        "Too general a question, please be a little more specific. What have you tried? REST is simply reading and writing commands using the appropriate HTTP method types. Send a GET HTTP request to read information, POST to write, etc. The normal NSURLConnection and NSURLRequest are perfect for what you require.",
        "Even if you could mark comments as answer, the point still stands: it is expected that you show what you have tried. What you want to do is trivial using PHP's basic datetime functions and classes, but you seem to have found none of that all? Do you want the code to be written out for you?",
        "[Take a leaf out of Jon Skeet's book](http://vimeo.com/7516539) and ask yourself - do you *actually* need this? Is it inside your little box, or are you adding a very difficult to create and unmanageable feature that nobody will ever use? How will *you* handle the Argentine government deciding 11 days in advance not to observe daylight savings?",
        "This is not a help site, it's a Q&A site. Ask a good question and you will get dito answers.",
        "Welcome to Stack Overflow! While this is a good answer it is _identical_ to the already posted and accepted answer by @MarkRushakoff, answered two years ago. Please review the answers before you post so we can keep the signal to noise ratio down.",
        "This is your third question on a very similar theme, If you were to give a better explanation of what you are trying to do (eg why you want your data in an array, not a data.frame) then perhaps help would be more readily offered.",
        "All entries in an array must be the same type. But the last column of `iris` is a factor. Here are some (possibly useful) ideas to try: `as.matrix(iris)`, `as.matrix(iris[, -5])`, `data.matrix(iris)`.",
        "i want to know R better.",
        "Here is a good introduction to JavaScript: https://developer.mozilla.org/en/JavaScript/Guide",
        "[Learn JS #1](http://stackoverflow.com/tags/javascript/info), [a few helpful videos](http://chat.stackoverflow.com/rooms/17/conversation/learn-javascript-videos), [more information can be obtained here](http://javascript.info/). There, research materials. Now you can 'FastTrack' your learning. *returns to dungeon to play with dragons*",
        "So er... what's your actual problem here?",
        "Is there a special way to write my C++ program to make it possible to be included in the Objective-C one ?",
        "http://stackoverflow.com/search?q=mixing+c%2B%2B+objective-c",
        "Can you show us some code to see how are you calling those files?",
        "[What have you tried](http://www.whathaveyoutried.com)?",
        "@AaronW. your message will probably get deleted automatically, but I agreed ;)",
        "when you post a question , you need to elaborate it and if possible always shows some of your code",
        "This sample code does not compile in JavaFX 2.x",
        "This link is useful for you.   http://docs.oracle.com/javafx/2/api/javafx/scene/layout/GridPane.html",
        "Is this all the code you have in `main`?",
        "[It does?](http://codepad.org/YTJo2JWg)",
        "The code above always prints `x`. If your code prints something else, then you omitted vital information in your question.",
        "He must've designed his own compiler and all hell broke loose.",
        "@l46kok you made my day haha",
        "Try recompiling your code (\"clean-compile\"). Sometimes that can fix weird bugs like the one you described.",
        "What would a C preprocessor macro look like that makes \"int a = 8\" compile and \"if( a == 8 )\" fail?",
        "@AaronDigulla, `#define a *a` could do the trick, I think.",
        "Would a simple PowerPoint Presentation not work?",
        "no it should be a little dynamically ;-)",
        "so you would like users to actually interact with the screen? In what way? You need to add info.",
        "no interaction it's just an Information-Terminal or better screen with specific widgets like a shedule or news from CNN...",
        "your question is not clear at all.",
        "I want to make a input dialogue box like java,http://www.roseindia.net/java/example/java/swing/ShowInputDialog.shtml",
        "take a look at this link http://www.csharp-examples.net/inputbox/",
        "Thats what i was looking",
        "Please post the full error message (ie traceback) so we know where to look.",
        "It's a very common error, it means a function returned `None` instead of a list.",
        "What list is this function being called with? Any list I give to it (for example, `sorted_point_list([4, 9, 1])` throws a `TypeError: 'int' object has no attribute '__getitem__'` error.",
        "the list will be like [[1,2],[3,4],[5,5]]...thanks",
        "this code looks like lisp not idiomatic python",
        "Your code is telling you that on the simulator the value of the key is 1, whereas it is 2 on the device. You may have a bug in your code where you are setting these keys, but you didn't post that so how can we tell?",
        "No the integer is coming out correctly when I use NSLog to check, its only the images",
        "That doesn't make sense. Something else is going on then. For example \"image1.png\" and \"image2.png\" are somehow not what you think they are. You could verify this by putting `NSLog` just before you assign to `leftStill`.",
        ".text() method.",
        "`$(':contai' + 'ns(' + 'Ev' + 'en' + 'ts' + ')').show();`",
        "sorry not so familiar with this one.",
        "I was in a good mood, so I reformatted this to actually be a question.",
        "thanks you very much Jordan.",
        "Where is the #TabStrip element in your markup ?",
        "I must say, you're doing this whole jQuery thing all wrong",
        "You replied to my answer saying you don't want to use .each(), is there any particular reason for that?",
        "what did you try ?",
        "And what have you tried? What language is it? Have you even searched for the huge number of similar posts here on SO?",
        "http://regexr.com/",
        "I haven't tried any expression. Language C#.net",
        "If it doesn't work, something is probably broken that needs to be fixed. It is likely that it will work once the problem is fixed.  Seriously though, this is going to need a *lot* more detail. Have you made sure the style sheets are getting loaded?",
        "please provide more details, like html & css => or better a fiddle?",
        "UINavigationBar *bar;\n bar.topItem.title = @\"First\";",
        "self.navigationController.navigationItem.title = @\"First\";\nbut both are not working.",
        "my bank number is XXXCCCYYYZZZ, I want a million dollars added to it.\nThanks.",
        "I'm sorry about the comment to Rocks, but that was really what went through my mind when I saw this question :D",
        "http://stackoverflow.com/questions/2629357/does-java-have-pointers",
        "No, what exactly do you want to achieve!",
        "Java does not have pointers. Use polymorphism",
        "@close-voters: you're wrong. asking whether Java has \"pointers\" (*yes*, the Java language specification says so) is very different from asking whether has \"same thing like C++ pointer (*no*, it doesn't). Get a grip. The answers are directly **opposite**, it's no duplicate.",
        "show us what have you tried",
        "What do you mean by combination? `\"ABEFCD\"`?",
        "like \"AB,CD,EF\", \"AB,CD\", \"AB,EF\" etc",
        "this site (http://gskinner.com/RegExr/) may help you",
        "This is not a good fit for regexes. It is possible, but very cumbersome. Why does it have to be a regex?",
        "Please tell us what the problem is, and, if possible, tell us what you've tried to do to fix it.",
        "@jwrush the problem; ascensor.js is not working on ipad & iphone",
        "We will not help you hack websites under the guise of \"helping a friend\". If he needs security testing, he can hire someone that knows the basics of web security.",
        "I have access to the code. I am not hacking!",
        "If you simply want to test what happens if someone gets a PHP file past his mime-type check, then put a PHP file in the upload folder and pretend it happened. You don't need the answer to this question. If you're honestly curious, then spend 10 minutes learning how MIME types are determined instead of asking for code.",
        "So you have the codes yet you intentionally want to put a bug in your friends script.... How nice.",
        "You should also attache your complete stack trace. I suspect it has something to do with `SimpleThread _my=new SimpleThread(\"myclass\");` (initializing `_my`) and `my.start();` (invoking `my`), but cannot be sure without a stack trace and/or more code.",
        "thanks for ur response,now i edit my code please help me",
        "Please attach your [stack trace](http://java.sun.com/developer/technicalArticles/Programming/Stacktrace/) as well.",
        "Still not sufficiant. The code fragment looks NPE-safe. Could be inside the getApplicationContext method, inside the DatabaseHelper1 constructor or outside the fragment you've shown use.",
        "http://stackoverflow.com/questions/166221/how-can-i-upload-files-asynchronously-with-jquery",
        "What if more than one five-digits number is found?",
        "it can have one or more 5 digit number only",
        "\"Jquery or Ajax?\" — \"Ford Focus or Driving?\"",
        "This question is perfect example of please-do-my-homework. And I wont pay you",
        "@Jashwant - also known as \"Plz gives me teh codez\"",
        "Take a look at this: http://stackoverflow.com/questions/461743/is-there-anyway-to-modify-the-keyboard-shortcuts-in-eclipse",
        "Ctrl + Shift + G",
        "please leave my back-button be, i love it. When drinking coffee the `alt-back` combination is unreachable with my short fingers.",
        "Why do u want to disable it anyway?",
        "-1 for \"please respond me quickly\"",
        "asking here only, I guess.",
        "I am new to php, I tried strpos,strrpos,preg_replace and also trim but I don't know what I did with my syntax. thats y I am asking help.@WebnetMobile.com",
        "You didn't ask for help with your syntax…",
        "I asked this only to know the efficient way in doing it since there are many ways @salathe",
        "None of the answers below are *inefficient* at all, and the same is likely true for whatever you tried before.  So, now you have several efficient ways to play with.",
        "[Java System Tray Tutorial](http://docs.oracle.com/javase/tutorial/uiswing/misc/systemtray.html)",
        "seems this is the same you are looking for, \nhttp://stackoverflow.com/questions/3240415/how-to-create-a-notification-in-swing",
        "I am not looking for that mentioned here. I am trying just to display popup for some time and disappear. I am isn't it possible without manually creating frames and adding components...",
        "Without any code, we can't help you.",
        "The problem could be an ajax call to an invalid url. But it's hard to say without some code.",
        "@Thomas the error wouldn't be a Syntax error if that was the case. That would cause a 404/500 error and the ajax call would catch that differently.",
        "The app is currently in background, and I click on the app from homescreen instead from notification.",
        "I'm trying to figure out if there's a way to retrieve a store's terms of service using the API, instead of having the store owner give me a link.",
        "This isn’t a helpful answer.",
        "No, but when a question is unclear... it can help to ask more questions to try and divine the true essence of it. This is where StackOverflow blows chunks. Dogma sucks.",
        "You want `merge`.",
        "There are many similar questions about merging data.frame in SO...make some effort and use the search engine!!!",
        "@AndyGarcia, I rolled back the edit you made to the title. Assuming Elizabeth did not find the `merge` function because she did not know what she was trying to achieve is called \"merging\", there is some value in keeping the title in her own words, i.e. \"two-by-two matching\".",
        "See comment below. I missed a space and assumed my approach was wrong. Perhaps we can remove this question. Sorry.",
        "What do you mean by \"not working\"?",
        "//it says cannot implicity conver type string to bool    KeyBoardInput = Console.ReadLine();\nparseAttempt = int.TryParse(KeyBoardInput, out Response);",
        "Can you post the full code for this function?",
        "What is \"a result of two values\"? Like the result of 3 and 5?",
        "Is your \"formula\" a fixed part of your program, or is it some user input?",
        "You should start with a C++ tutorial and come back later in a week or so. Use Google to find one.",
        "Here is where you can find a tutorial : https://www.google.com/search?q=a+good+tutorial+on+C%2B%2B",
        "I formulated the question again, and I hope it is now clearer. Unfortunately. English is not my native language :-(",
        "Thanks hamon and Luchian for your helpful reply!",
        "@Umair Try first and then ask help if you get stuck.Nobody will do your task.",
        "Show us your code.",
        "http://www.youtube.com/watch?v=o5gyINjernc\n\nPlenty more tutorials after a simple google search.",
        "Try `ComboBox/ListBox.SelectedXXXXX` methods & properties.",
        "if you tried you would have got the answer or else post your code",
        "Is it java or c++?",
        "What is your expected result?",
        "What error are you getting?",
        "Please make you if statement readable instead of using this 'junk'. Divide it up.",
        "Can you say in English what you want the expression to do? Its not even close to compiling at the moment.",
        "@Kos : your much appreciated question is rhetorical.  \"The operator && is undefined for the argument type(s) int, int\".  Error message on the '12 && 8' part in my Eclipse/java installation.  So it's not java.  Curiously, in those few seconds I needed to look this up, it's his C++ tag that got removed ??????",
        "Welcome to Stackoverflow. Please do not abuse the caps lock button.",
        "You need to be more descriptive; what are you doing in these loops?",
        "The answer is that it depends what you are doing in / with the loop.",
        "I MUST LOOP 32 MILLION DB RECORDS USING THE JAVA",
        "THE DB IS ORACLE 9I. PLEASE STRESS LEVEL IS HIGH.",
        "sucks to be you :)",
        "You are not giving much information for people to help you though. Try answering some of the comments..",
        "Your stress levels and your deadlines are not our concern.  Please be professional.",
        "Visit each character and if(currentIndex % n == 0) { //code to insert character } which is O(N).",
        "With file streams. How this is even related to wxWidgets?",
        "Why do want to use wxWidgets for this task?  Do you know how to write to a file using C++?  Using C?  Please edit your question to explain why you want to do this.",
        "Have you looked at the classes with the word \"file\" in their name in wxWidgets documentation? This is, again, echoing other comments, even assuming this has anything to do with wxWidgets, i.e. that you don't want to use standard C++ streams or C STDIO.",
        "Did you try something ?",
        "http://www.whathaveyoutried.com/",
        "The sole line of code you wrote doesn't seem to make sense. Would oh.getCustomer() return an iterable collection of customers ?",
        "you didnot tell total number of customer list.can you elaborate more about your question?",
        "c# and VB are just programming languages. The underlying framework you use (eg ASP.NET) or MVC will be the same for both and so the security will be the same for both.",
        "Welcome to Stack Overflow! We like to help, but we want to see you make an attempt first. What have you tried, and where are you stuck?",
        "Your question is not clear. Which C drive are you talking about ? Is it of server o client. If client then how can you be sure that client is going to be on windows only ?",
        "After finding out it is not possible to write a file onto a windows users C drive using JSP (I'm still new to JSP and unaware of its capabilities), I looked at applets and found that it is possible to create an applet which writes a file onto a windows clients C drive just as long as it's self signed, it will just prompt the user for permission. More so, you don't even need the user’s permission if the applet is signed by VeriSign. This is my solution :)",
        "Have you tried any SQL yet?  It would be easier if you showed us a) what you've tried and b) something more about your DB than just names/columns.",
        "And what kind of SQL?",
        "What if two areas have the same maximum?",
        "-1 not at all useful -- type_info is about runtime type identification, whereas a declaration needs a statically determined type.",
        "check out the jquery tutorials at http://www.codecademy.com/ They are great and have lessons that teach you exactly how to do what you want to do",
        "Check here:\r\n\r\nhttp://stackoverflow.com/questions/317095/how-do-i-add-options-to-a-dropdownlist-using-jquery",
        "Why do you think you need it? Maybe you don't. Many sites don't need it. What is your site about?",
        "No bad things, it's just so your website will support HTTPS (secured HTTP using RSA) and thus will be trusted by users",
        "You mean like with any VCS that supports the concept of \"server\" (be it an external process or just a directory somewhere)? I think virtually every serious VCS supports that.",
        "\"I prefer to avoid using 24/7 external/local web/non-web based source control servers.\"  What does that mean?  Do you claim CVS and Subversion meet this requirement?",
        "@Alex I was referring to the fact that you seemed to prohibit both \"web\" and \"non-web\" options in your question.  That combination rules out most options I can think of.",
        "@Alex your current solution uses network shares.  Why does this mean your new solution must use network shares?",
        "Does the [documentation](http://msdn.microsoft.com/en-us/library/d5x73970.aspx) not explain it?",
        "please mention what specifically is not clear. Just the use of where? Without the clarity others will not be able to provide help",
        "1) GCM is a streaming mode, so it needs no padding 2) Relying on padding for integrity checking is a really bad idea. It's very likely that you open yourself up to padding oracles that way. 3) GCM has an integrated MAC, that already takes care of any integrity checks you need.",
        "The question is about recognising incorrect keys, not integrity checking.  Using padding is fine for that specific problem.  You are correct about GCM, my mistake.",
        "A pretty rare lapse rossum, I'm sure I'm making more. Do you mind if I keep it in my collection of rare lapses? :)",
        "`x -= 1; x -= 1; x -= 1; x -= 1; x -= 1;`",
        "Why exactly do you think you need another way?",
        "You own the `www.example.com`? Awesome! No jQuery code there! Neither we know how your homepage gets the script! :P",
        "When you click view source on either page, is there a distinction?",
        "Do you have another file named `index`, like `index.php` that may not have your updated code?",
        "Yeah, as @smartcaveman and Glenn says there might be two files?",
        "@SperanskyDanil  http://www.japaneselanguagefriend.com\n\nhttp://www.japaneselanguagefriend.com/index.html",
        "@smartcaveman I checked and there are not two files, I posted links to the real website below, sorry about that.",
        "What have you tried so far? Have you looked at the methods available in the `String` class?",
        "That's not Trimming, it's Selecting.",
        "+10 @ Jon for actually motivating people to look at MSDN or there Object Browser, even intellisence in this case...",
        "http://whathaveyoutried.com?",
        "There should be a whathaveyousearched.com too",
        "@maryam: there is jquery plugin http://www.datatables.net/release-datatables/extras/TableTools/, check it out if it helps as you asked solution with jquery in http://chat.stackoverflow.com/transcript/message/5203217#5203217",
        "Can you post the entire SQL?  It's difficult to tell what you're trying to do here.",
        "Please add a bit more information like your complete SQL statement, what you're trying to achieve, what you've already tried, ...",
        "Is that your full SQL? If so you're missing Select and From parts. If not make sure you define your alias (N) in the from statement.",
        "ouch for the negative reps. Ok will amend it. Sorry.",
        "I'm noticing you use N.File_Id and N.Id, are you sure you have both of those columns in your table? Can you post your schema?",
        "**File_Id** is hi-lited in pink because there is a system function called File_Id. Enclose it in brackets N.[File_Id].\n\nThis is probably not related to your problem of the query not returning a dataset.",
        "I had to use a FULL OUTER JOIN as well as [ ]",
        "I don't want to modify the JS library that I am using. I am really looking for config in Sonar to do this. Probably via the build mechanism somehow.",
        "What is `grab_i`? You haven't defined it anywhere before.",
        "2 of the answers to [this question of yours](http://stackoverflow.com/questions/11118384/loop-to-perform-calculations-across-rows-on-specific-columns-matching-a-pattern) use for loops.  Study the syntax.",
        "R FAQ 7.21 may be useful: http://stackoverflow.com/questions/6034655/r-how-to-convert-string-to-variable-name ... also see http://stackoverflow.com/questions/1030532/how-can-i-access-variables-that-are-named-sequentially-by-a-loop-while-still-ins?rq=1 , which comes up first in your \"related questions\" sidebar list ...",
        "@Maiasaura, thank you edited.",
        "@GSee thank you, I have been googling examples of for loops but I can't find examples that use lists and objects within them. I have tried [] but I will go back and read the other post.",
        "@Ben Bolker thank you, I will read these",
        "what is class(predefinedRegex)?",
        "And definitely add http://stackoverflow.com/questions/5963269/how-to-make-a-great-r-reproducible-example?lq=1 to your favorites.",
        "Please read the [FAQ](http://stackoverflow.com/faq) before posting something like that.",
        "I'm sorry if I did something wrong.But I really need to know how to do it.",
        "Have you tried registering the class...?",
        "The segfault caused by accessing memory not allocated to your process cannot be used to set read/write access. If you need read/write access, create your own array class, and implement it in code.",
        "Why exactly are you asking? What is your overall goal? There are probably other ways to achieve that goal...",
        "I am trying to use turn segfault into advantage",
        "Common wisdom and some research papers tell that it does not work well in practice (and is non-portable and tricky). GNU/Hurd has external pagers. But taking advantage of SIGSEGV is not a \"overall goal\", tell us more about your bigger picture....",
        "can you elaborate what is not working for you and what you have tried ?",
        "Check this: http://www.dotnetperls.com/main",
        "If you are using Visual studio the easiest option is to create a new Console Application project.  This will create a main function that you can modify.",
        "Actually I dont know any procedure.......",
        "Don't know any procedure ... please explain this is not clear",
        "parse error probably, the first line needs a semi-colon at the end",
        "Welcome to SO.  If one of the answers below fixes your issue, you should accept it (click the check mark next to the appropriate answer).  That does two things.  It lets everyone know your issue has been resolved, and it gives the person that helps you credit for the assist.  See [here](http://meta.stackexchange.com/a/5235/187716) for a full explanation",
        "There is no question here. This is pseudocode at best, not jQuery. [What have you tried?](http://whathaveyoutried.com)",
        "Matt, If i knew the code of jQ i wouldn't post here ... i posted the code the way i know it which is pseudocode...anyways @dotsamuelswan answered my question, thanks",
        "Can you post your code?",
        "`table(my.vector)`",
        "This is a really basic question, incidentally. I would think that a quick Google search of \"frequencies in R\" would have answered your question.",
        "this was basically just asked 5 hours ago http://stackoverflow.com/q/12300470/1317221",
        "This doesn't answer the question, which is about splitting into strings of a given length rather than by a delimiter",
        "It's nice that you did a search to help the question author, but simply copying the first result you find without any explanation (even with citation) really isn't helping. The OP might just use `8` for the delimiter and think it works.",
        "You could just try and see for yourself.",
        "What happened when you tried it once? What did you find when you looked it up in the Javadoc? Zero research. -1.",
        "1. Connect to server. 2. Send email. 3. Disconnect. 4. Have a beer.",
        "Do you know about http://msdn.microsoft.com/en-us/library/system.net.mail.aspx ?",
        "@lc I have it on good authority, that beer is not strictly necessary, and can be replaced with coke.",
        "I want to create through the algorithm to send email. To know what steps to follow to build the algorithm.",
        "What's with all the down votes? It's an honest question!",
        "Searching \"Send email C#\" turns up plenty of relevant answers. And this has little to do with algorithms.",
        "It depends a lot of the operating system, and what you call an operating system.",
        "yes, (typically)yes, no and yes",
        "62bit? Really funny.....",
        "\"Can a 32 bit application run under a 32-bit operating system?\" is a very odd question; how could the answer ever be \"no\"?.  Suggests you do not know anything about what the words \"application\" and \"operating system\" mean.",
        "Welcome to Stack Overflow! We encourage you to [research your questions](http://stackoverflow.com/questions/how-to-ask). If you've [tried something already](http://whathaveyoutried.com/), please add it to the question - if not, research and attempt your question first, and then come back.",
        "what would be the purpose of doing that, if you don't want to parse those files..then why you have written linq based queries in your application..this is really a bad question..",
        "This makes no sense. Also, SO is not a \"do this code 4 me plz\" site. At least try it yourself.",
        "i did not write the application, it comes from other colleagues and i have no direct influence on the code. and so i'd need a possibility to erase the linq queries from the applications .cs files before parsing them...",
        "-1 **Obviously** the implication here is that I don't care about enforcing uniqueness at DB level, so am wondering if I ever need to bother making indexes unique. Try to think a little bit next time before posting 4 consecutive questions that are asking almost the same thing. \"Use a unique index when you need one\" is a trivial answer that insults the reader's intelligence.",
        "Regarding the \"why should it affect read performance\" question, there are ways to treat unique indexes differently ... for example, you can stop scanning after the first match is found.",
        "What exactly does it mean to help with validation of e-mails?",
        "See [the first answer to this question](http://stackoverflow.com/questions/201323/using-a-regular-expression-to-validate-an-email-address). Essentially: the only way to \"validate\" it is to successfully use it.",
        "Welcome to Stack Overflow. Please take time to read the [FAQ](http://stackoverflow.com/faq) and please use the SEARCH function to check if your question has been asked previously (MANY MANY times....)",
        "*MANY, MANY, MANY, MANY, MANY*",
        "You should ask your `testers` to show a single `email id` with this format!!!",
        "filePaths.Length ?",
        "-1. Does not show any research effort.",
        "Intellisense FTW. I'm pretty sure you would have found the answer faster by browsing the options available to you.",
        "possible duplicate of [How to run a C program on Ubuntu?](http://stackoverflow.com/questions/4635794/how-to-run-a-c-program-on-ubuntu)",
        "Hey Med-SWEng i have not downvoted you, but i can understand the guys, googling this would have brought you directly to a site which covers that topic eg. Google:\"compile c++ on linux\" first hit is this site  http://arachnoid.com/cpptutor/setup_unix.html",
        "A Rails model is not a table, nor any other part of the database. While commanding `generate model Foo` creates a corresponding database migration for creating a table for storing instances of Foo, commanding `destroy model Foo` doesn't destroy the table.  As http://railsforum.com/viewtopic.php?pid=10961#p10961 says: \"Beware, though - when you generate a model, it creates a database migration. If you run 'destroy' on that model, it will delete the migration file, but not the database table. ...\"",
        "What do you mean by \"mark it with null\"?",
        "You might as well not have posted any code at all, as what you did post is meaningless. Voting to close this as \"not a real question\", as it shows zero effort to solve the problem yourself, and no research at all before posting it.",
        "OK, but what should I do if the text in my TextView is less than 15 characters? I will have 3 dots with no good reason.",
        "If you are going to use warp_content so it doesn't matter. At any given time the 3 dots will appear beside your text",
        "That's what I'm saying, I don't need them if my text is less than 15 characters.",
        "You can get the length of your string and check if its greater than 15 or not. You can set the visibility of the second text view to INVISIBLE if the length is less than 15. This is the possible solution.",
        "I prefer not to do that by code, I'll do it if won't have any other choice.",
        "Use one of the `exec` functions.",
        "Are you trying to compare Windows+terminal with Linux+C++ here?",
        "This really isn't hard at all to search.",
        "Read also http://advancedlinuxprogramming.com/",
        "Well, this of course depends on your implementation.  Post some code and a particular example, and then see if people can help you out.  As it stands, this isn't even a question.",
        "In fact, I wanted to post code as answer. I did the same now for others to understand. DateDiff returns simply subtraction result between years of two dates. It is simple code to get difference in years but not correct when DOB is considered as first day of new year.",
        "Even so, the question as it stands doesn't give others an opportunity to provide a potentially better solution.  It's extraordinarily open-ended and open to interpretation; I would still edit the question to avoid this flurry of downvotes.",
        "Yes, you can go ahead to modify this question.",
        "I don't see what's wrong with it, it's a perfectly valid question with a fairly simple solution.",
        "Which DBMS are you using? Oracle? Postgres? And is that the complete statement or part of another?",
        "@a_horse_with_no_name I would guess SQL Server by the use of `NEWID()` and `TOP`",
        "i am using SQL server and i want to run the query with brackets .",
        "Why? Just remove the brackets. `select top 1 percent A from B order by newid()` would work fine.",
        "There is nothing wrong with the syntax (that is without the outer parentheses). If I substitute A and B with names from a table that I have, it works just fine. I think that it's a problem with the names that you use. I assume that you don't actually have a table named B witha field named A, so you should show the actual code that you use.",
        "no i want to use the statment in Where condition",
        "@jam - So show your complete statement with the problematic bit in context. To get \"the random record from table B\" you don't need to use it in a `WHERE` clause at all.",
        "http://docs.oracle.com/javase/1.5.0/docs/api/java/util/Collections.html#reverse(java.util.List)?",
        "Just google the problem. I think there are more than 1000 examples for that use case out there.",
        "@Ziyao Wei - that should be an answer.",
        "@DonRoby Too trivial:) I don't feel too comfortable doing that, although I might missed ~+20:)",
        "Then write some Java to extract it. When you have a specific issue, then you should ask questions, of course, after you [do your research](http://stackoverflow.com/faq)",
        "You should at least try - I doubt you'll get any help without actually trying to do something yourself.",
        "hint: never use for-loops in python if you can help it.  Stuff all you can in numpy and use it vectorized (numpy has C under its skin), and that way all your for-loops are \"nearly\" as fast as you would write them in C, but you have the fun of writing it in python. Also, if you want people to help you, and not downvote your question, post some examples of code to show how you tried, and what result you got, and what result you wanted to get",
        "`Gemfile` won't always explicitly declare a version number.",
        "I think you misunderstood. I want PDF links on **my site** to always be opened for viewing in the visitor's browser as opposed to prompting a download.",
        "improper answer....please don't do such kind of non-sense.",
        "Down vote for rewriting the answer and selecting it as correct. Oliver's answer was just about it. Maybe better.",
        "Downvote also for copying the code from Jamund (http://j-query.blogspot.in/2011/02/save-base64-encoded-canvas-image-to-png.html), and not referring to it",
        "this doesn't answer the question",
        "This is not what was asked.",
        "lol root shell or bust",
        "One thing to note though is that for portability, sometimes using a new line in the script (not \\n) is necessary. With some trickery you could also insert a literal `\\r`. I mean inserting the real characters into the script file, not escapes.",
        "This is blatantly incorrect: http://stackoverflow.com/a/13442343/1413865",
        "A little more detail would be good",
        "This returns the seconds since the epoch. Not milliseconds.",
        "well are you facing any error doing like this `$object->$data_member` ?",
        "Em... `self::$variable`?",
        "static access is done on the class, not on an instance of a class, otherwise its not static access its plain public access. Example of  Static access: NameOfClass::StaticVariable",
        "or AbstractClassName::$variable if not in the class.",
        "or static::$variable if you are in a derived class",
        "How is it difficult to tell what is being asked? Obviously it's a case of using polymorphism where one doesn't know the class of the object, only that it inherits one common ancestor. So you need to somehow access static fields and functions through the instance variable of unknown class and not a class name.",
        "The user asked to restart the application not just hide and show a window.",
        "That answers the opposite question.",
        "you didn't read or understand the question correctly.",
        "You really do want to switch to using enqueu style. That's going to leave your plugin stronger and less likely to break when new versions of WP come out.",
        "This is bad code. It depends in the implementation of -description (NSURL) and it uses -isEqual: instead of -isEqualToString:. In addition two \"equal\" URLs can yield different descriptions thus your solution will break. No need to \"XD\".",
        "`NSURL absoluteString` would be better than this implementation.",
        "Im thinking delete my comment but I ratter take the comments that Cristian Kienle and Kessedc posted.",
        "Would any of these help? http://www.alanwood.net/unicode/arrows.html",
        "Why do you need it. Maybe there's another way.",
        "Millie I'll have to use the same modifier since it's already used in the project I'm working on. also I don't know the character code used by them. So trying to figure it out on my own.",
        "This question appears to be off-topic because it is about looking up a value in a table that is public available on the Internet from official sources. WTF is wrong with people? Can't they search these days? FFS, I'm 26, don't make me go all \"get off my lawn\" on you.",
        "It would be a serious failing of Google if it ever links to this page instead of the actual answer.",
        "I can see the usecase. A person has used a webding character in a design one now needs to transform into a design. It looks exactly like this arrow, but is turned the other way. *search continues*",
        "Unfortunate that this is the top answer. It is very simple in iOS7+. Check out Tim Windsor Brown's answer below",
        "wrong answer, you can easily change it. Get @Tim Windsir's answer.",
        "They both have the same value, 2. It's just a number.",
        "This answer should not have received the bounty, as it is incorrect. As @Mihai states, these both have the value 2, so this makes no difference.",
        "This answer is indeed wrong. I've added the correct answer.",
        "It is generally considered polite to delete unhelpful, incorrect answers.",
        "This is just *wrong*! You can have blocked ports however if you are behind a corporate firewall. That is usually assumed not to be the case. If you can access any web page, websockets should just work!",
        "Actually, he's right (although also irrelevant). Please see http://www-archive.mozilla.org/projects/netlib/PortBanning.html#portlist",
        "@atinder Sure, also read the question carefully and see the time when it was asked",
        "i like to answer old questions.",
        "@atinder Then why don't you answer it now, if you've something better",
        "because i feel like this should be a comment and not answer. Learned from you only.",
        "Let us [continue this discussion in chat](http://chat.stackoverflow.com/rooms/83955/discussion-between-tushar-and-atinder).",
        "mentioned already. and thanks for your guidance. I learned importance of comments.",
        "This adds an opaque black background.",
        "doesn't work on my computer",
        "To make it semi-transparent and initially invisible, you need to additionally give it the style:  display: none;  background-color: rgba(0, 0, 0, 0.5);",
        "This will return the computername of the webserver...",
        "He is asking for client computer name not server",
        "The OP asked for get client's machine name(User Account Name > Windows)",
        "1) Ajax. 2) Add `iframe` with name `frameName` and set `target=\"frameName\"` attribute to form.",
        "You can use the following jquery plugin: https://github.com/jinujd/jQuery-Async-Form",
        "LOL! Thats all I gotta say.",
        "Hmm, any evidence it wasn't your own design faults that caused this? You provide no real substantial evidence yet we are to believe you that MongoDB is just slow and poor performance? If I am honest this is not an answer, don't know who upvoted...",
        "It's easy to find evidence to show the performance issues. Here is one example:http://www.infoq.com/news/2013/04/NoSQL-Benchmark",
        "As stated concerns in the comments there is some problems with that benchmark, mainly some information missing on its details. I do hate benchmarks because they rarely refelct what YOU will see, and who is to say they used the tech correctly too. Anyway I am fairly (99%) certain I get better figures on MongoDB than they did",
        "There was no question that migrating over to couchbase from MongoDB increased performance when scaling enormously. You should try it, you won't look back. Pencils have erasers for a reason, people make mistakes.",
        "As always,  it depends of your use case. Seems like a troll answer",
        "Question is around Mongo, and if you are suggesting Couchbase, you should rather provide some facts.",
        "Do you use javascript?",
        "The OP is asking about server side JavaScript, while your answer only works in the browser",
        "And if your suggestion is \"Return a 200 response with an HTML document containing some JavaScript that does the redirect\" then that is probably the more unreliable, inefficient way to do it … and it also breaks the back button.",
        "i've never seen an answer with this many downvotes",
        "Recycle while displayed ???",
        "I don't see how this asnwers the question.",
        "You are correct this converts a string to a byte array, which is the opposite of the question, took 3.5 years for anyone to notice.",
        "Semantic-UI isn't responsive?",
        "In whole project they have not used px unit while they are using em everywhere !!!",
        "Semantic UI is definitely responsive. You should update your answer otherwise it's incorrect.",
        "This answer is definitely outdated. Semantic IS responsive.",
        "Semantic-UI is born for responsive.",
        "semantic-ui eat bootstrap",
        "You un-accepted my answer?  And then accepted your own?  Harsh!",
        "Sorry, but it closer fits my question",
        "\"Any help, pointers or ideas appreciated.\"  Not really!  Ha!",
        "Jens, you should edit this so what answers your question is included here so others can benefit from this knowledge. If that link where to ever break, your answer would be useless to future visitors. Good luck! :)",
        "if this is the accepted answer, and you answered it yourself, please at least tell us that you tried it",
        "That's because it's _wrong_ to use _map_ in this case. map _maps_ array elements somewhere, what you're looking for if you want to be functional is _reduce_",
        "Who said anything about being functional? Or do you mean functional in the sense of being useful?",
        "`forEach` should be used instead of `map` in this case.",
        "Extending the prototype of built-in objects is bad in my opinion. Use a separate utility class for methods like these or some other method.",
        "At this point I think the realistic answers have been added above, but I think this is useful for completeness ;)  It's still better than the accepted answer.  Of course you could also extend the prototype of jQuery, just for fun.",
        "You're using `map()` improperly. It's supposed to be used to generate a new array from an existing array... and that's exactly what it's doing in this case. It's instantiating and returning an entirely unnecessary array, populated with `undefined`. On top of that, you've polluted `Array.prototype` with another enumerable property. The array methods `map`, `forEach`, `filter`, `reduce`, `some`, etc are built with specific purposes in mind. While this may \"function\" it's ridiculously inefficient because it's doing unnecessary work... because you've selected the inappropriate method.",
        "you're showing well what to not do",
        "Try adding something to j.",
        "I strongly recommend you learn to use a debugger.  You would have found your error immediately if you had used it.",
        "By the way this crashes if the list is empty because `do` block is always executed *at least once*. Just use a `while` loop instead.",
        "This doesn't answer the question, and an order by rand is a really bad idea.",
        "can you elaborate bit more ? i have the same problem :/",
        "What happened man!?",
        "A JS directory was missing? Wich one? From where?",
        "Answering your own question without detail is not useful for the community",
        "Doesn't effect when clean or rebuild but make sure that getFragmentManager() is of Support library..check the imports",
        "Doesn't make any sense.",
        "First, that is not what OP asked for. Second - node.js is not only for servers.",
        "^ I'm a stanch defender of node.js, and am often saying that serving webpages is the least interesting feature of node.",
        "Yes, let's downvote anybody who considers offering advice on optimization",
        "hey its installing fine in device but its not launching automatically.",
        "good try , but give actual to the point answer only.",
        "I get the prompt as the title of the options window, and the chosen option remains the same",
        "This is wrong because prompt is the heading of Popup window.",
        "Not working for the spinner",
        "It just works when you set android:spinnerMode=\"dialog\" and it didn't work when you set spinnerMode to \"dropdown\".",
        "Not working for the spinner",
        "Dhawal Sodha Parmar 's answer is the good one",
        "Error: String types not allowed (at 'prompt' with value 'Gender').",
        "this answer Lack of explanation also didn't give a perfect sample code. refer this post to see how @rObOtAndChalie solve the same issue  https://stackoverflow.com/questions/26543408/android-spinner-prompt",
        "Can you clarify what you are looking for.",
        "You mean contentEditable?",
        "At the *very least* you should clarify your intent (what're you doing with the changed list-item's text?), and, if possible, show what you've already tried (it's not always necessary to have tried something, but it gives us a starting point to work from if you have).",
        "Isn't the title the question?",
        "I don't understand these forums of closed questions. The question was pretty obvious and clear. Maybe it was outside the domain of expertise so in their confusion they simply closed the question. That actually makes more sense.",
        "The biggest use of resources on my machine is visual studio 2012.  It looks like it has some sort of a resource leak/sink.",
        "I'm not sure what are you trying to say, but `Parallel.For()` does use multiple threads (processes are something different).",
        "Parallel.for divide your \"for\" in one or more \"for\" in different thread.He is trying to run three \"for\" in three different thread.",
        "The original question didn't use Jade, so this answer isn't helpful",
        "-1 Laziness isn't a good reason to receive help.",
        "you forgot to paste your query here?",
        "count(*) where machin=0 ?",
        "still ididnt write d query.. i am nt getting any idea to strt d query fr this...",
        "@AryanManojRaj Your question was probably downvoted because it is a little unclear. However, you did provide sample data and a sample result set, and you explained what you wanted to achieve. With a little effort and patience, I was able to answer your question.",
        "[Why was this question closed?](http://meta.stackexchange.com/questions/147068/why-was-this-question-closed-as-not-a-real-question)",
        "I would say more \"too localized\" than \"not a real question\".",
        "how about using a captcha in the form ? ?",
        "Importantly, to help stop spammers, sanitise your data. You allow anything into your headers (and you've now publically put up the link so your first priority is to clean that up. Remove all newline characters from being injected into the header.",
        "How do I restrict what users are allowed to put in the headers?",
        "\"Remove all newline characters from being injected into the header\". Also check for invalid (non-printable) characters, the validity of the e-mail address (use PHP validation functions) and check for length - reject if over 100 characters. Just stop anyone injecting naster headers into your header.",
        "Refer to your previous question: http://stackoverflow.com/questions/12421716/call-c-sharp-function-in-javascript",
        "[What have you tried so far?](http://www.whathaveyoutried.com)",
        "@moooeeeep The `homework` tag should not be used anymore: [Trogdor ate my homework (tag)!](http://meta.stackexchange.com/questions/147100/trogdor-ate-my-homework-tag)",
        "Can your agent remember previous decisions?",
        "@Baz I'd guess it's a Markov Decision Process.",
        "what error did you get?",
        "i have in the liste 6  floats but in function initialize it didn't stop when case:6 it show the error (\"Index was out of range. It must not be negative and must be less than the size of the collection.\nParameter name: index\")",
        "I weep at this question. Why not take a second or two to read the FAQ? It would take considerably more effort to answer this question than you put into asking it. That's not very reasonable by me. -1",
        "Any suggestions?",
        "generally before asking question on StackOverflow u r supposed to put some efforts!",
        "atleast google for your question first\r\nhttp://stackoverflow.com/questions/4749549/extract-substring-in-java-using-regex",
        "This question seems to have a bit too large of a scope for stackoverflow.  Solving the entire problem is really a bit too much to ask.  If, when you are working on this problem, you come across a more specific question it is more likely to be appropriate for this site.",
        "@Servy, too large? I think if it would have been worded as \"how to split 41 in 7 about equal parts so each get whole number like 6,6,6,6,6,6,5?\" it would not get so many downvotes...",
        "Yeah, that's what you get for posting too much info :-)",
        "You are not calling `end` from anywhere in your code, so it is hard to answer your question.",
        "Simple solution, but it doesn't really provide a proper callback mechanism.",
        "Wouldn't be hard to make it do so. I was just throwing the idea out there.",
        "The whole point of using a timer callback is to avoid checking the time at every iteration! -1",
        "This question has not nearly enough information.",
        "See this answer for more details: http://stackoverflow.com/a/9404727/597657",
        "Cool story, Becks",
        "This question is incredibly hard to understand, what are you asking for? What have you tried already?",
        "http://stackoverflow.com/questions/how-to-ask",
        "Can you show us how `isFieldEmpty` is called?",
        "I see no anonymous classes, here.",
        "like comment below says, there is no such attribute on the ManyToMany-annotation.",
        "DataOutputStream is completely wrong.",
        "this is not a \"TRIM solution\"",
        "answered by OP with something that does not even make any sense.. wow.",
        "http://whathaveyoutried.com ?",
        "*Have you even tried?*",
        "What are you having trouble with?  Looping through the data?  Creating a table?",
        "Guys, sorry. but to answer your questions and put downs, I have read the following post: http://stackoverflow.com/questions/3016903/converting-json-data-to-an-html-table?rq=1.  I didn't quite understand the answer showing the javascript to create the table.  Specifically, the comments made by BalusC seemed applicable, but i couldn't get it working.",
        "@dot: What didn't you understand?  Show us what you have so far, and where you are stuck.",
        "@Rocket - I will update my post in a sec with my code.  Thanks.",
        "@Rocket, please note the section called  \"Edit 1\" in my post.  Thanks.",
        "You don't need to \"convert\" `row` to an HTML string.  It's a jQuery object, and you can pass those to `html` and `append`.",
        "I found my bug.  I didn't change the name of table to my table.  I'm sorry.  Thanks for the help Rocket and for being so patient.",
        "What isn't working?",
        "Are you really planning to check in javascript the user and password ? Are you aware that even non programmers today are able to have a look at the source (and my wife can even debug) ?",
        "You've already gotten some answers, but a tip for future questions: Include *what* is wrong. We're not mindreaders, even if we have to get damned close some times. =)",
        "Chris, my code wasn't doing anything  and I wanted to know why ....Well dystroy , I am just learning the basics and am not going to implement this anywhere ;) ... Sure Steen , I will take that tip",
        "When your question is downvoted, it's a sign that it needs improvement, not a sign that you need to repost. Read the [faq], and work on improving your question.",
        "please, read [ask]",
        "Hi, welcome to stackoverflow! please read [*this*](http://stackoverflow.com/faq#howtoask)",
        "Where are your variable declaration of current and head ?",
        "The fact that you create a file called \"filename\" rang no bells?",
        "Yes, this won't work for the Web API",
        "But it *should* work.",
        "[OutputCache] you're using is from System.Web.Mvc, not System.Web.Http (WebApi)",
        "I get it, he's wrong, but come on, guys, don't be too harsh with downvotes.",
        "[What have you tried?](http://whathaveyoutried.com)",
        "i cant find any api yet!",
        "Does your query perform a `INSERT IGNORE`?",
        "Why do you even need that, you never specified",
        "I specified that in the question...",
        "This answer doesn't explain how to use `INSERT IGNORE` with Laravel. Laravel doesn't support `INSERT IGNORE`.",
        "Sure there's an easy way to learn it. Try Google.",
        "Which DBSM are you using? PostgreSQL? Oracle? DB2?",
        "I am using MS SQL... i have a whole bunch... was just trying to get a feel of it... it's not the actual statement juz a sample... so that i can go about doing it myself once I get the hang of it",
        "a different version of java? a different java install path?",
        "You show you code, Java or C#?",
        "So, as the c# question.. whats the question about c#?",
        "You want to run java or javac (java compiler) ??",
        "are u invoking a java application through c#",
        "Please be specific and share your source code. Is Java installed in the other machine?",
        "show your code pls",
        "java and winrar installed correctly.",
        "and this is just calling rar, java, javac so i do not think the version really matter",
        "did you read the question?",
        "He didn't, of course.",
        "Please give a reproducible example so people can actually see your problem (see also http://stackoverflow.com/q/5963269).",
        "have you tried running in debug mode and monitoring what causes the memory overflow?",
        "I am unable to get that, that's why i uploaded the link of the sample code.",
        "Please explain how this answers the question",
        "Googling `php parse url` gives me [this](http://php.net/manual/en/function.parse-url.php) useful official documentation page, for a function that would probably solve your problem. Now do tell me how you spend more than 5 days searching, I dare you, I double dare you.",
        "I fail to see any sort order here. What do you want to sort by exactly?",
        "dears i meant to parse the host then sort the results each with its host !",
        "All bow before @MadaraUchiha for he's got an eye that sees everything :D Had to say this :|",
        "before posting a question, please visit the faq : http://stackoverflow.com/faq#dontask.",
        "So, you want to make some random app that uses a database and a type of popup UI and you have no idea where to start? You probably aren't going to get many helpful responses because this question is extremely broad. Start by googling \"Windows Phone Tutorial\" and then ask questions as you get stuck.",
        "Just a hint: when a problem is that urgent, take at least the time to right a good title for your question.",
        "what if u replace <ul> with &nbsp; and <li> with &nbsp;&nbsp; for example?",
        "show your desired output..",
        "http://www.tizag.com/phpT/postget.php",
        "So, what you're saying is that the answer Hans provided over two years ago is, in fact, correct? Thank you, Kshitiz. That's very helpful indeed!",
        "This is not true dependency injection. WebApi and Ninject can work perfectly together. If you follow the steps I mentioned in my answer it should work.",
        "y the vote down ? this is the solution to **my problem**.",
        "and as I have already said before, @WouterdeKort your solution did not work for me",
        "Agree with @WouterdeKort, this is not dependency injection",
        "any context, like when or where did it happen? code example?",
        "if you are dealing with any mail applications so that check the path of attachment you are sending",
        "From you log, sounds you are trying to [update the UI](https://www.google.com.pk/search?q=Can't+create+handler+inside+thread+that+has+not+called+Looper.prepare()) (like showing Dialog etc or changing layout) from background thread like `doInBackground()`.",
        "Sorry, -1 for the security hole. Definitely not good practice here - this is a big hack.",
        "This won't validate as you cannot add `alt` attribute to a `<div>`",
        "never heard that we could add `alt` attribute to `div`!!",
        "This may be a start (Flot library): http://code.google.com/p/flot/",
        "Exactly how does `is_numeric()` NOT validate negative numbers?",
        "Can't you just use regexp if you want only specific types of numbers? Like preg_match('/^-?[0-9]+\\.?[0-9]*$/',$str) or if you want to get number with \"right\" type (int/float) some monstrosity like: function get_value($str) {\n if(!preg_match('/^-?[0-9]+[.,]?([0-9]+)?$/',$str,$m)) {\n  return NULL;\n }\n return (intval($m[1].$m[2])+(empty($m[3])?0:floatval($m[1].'0.'.$m[3])));\n}",
        "Yes, yes you can.",
        "Jep. validation can be done through php.",
        "I hope [this post][1] will help you.\r\n\r\n\r\n  [1]: http://stackoverflow.com/questions/5112520/php-regex-extract-phone-number-from-text-html",
        "Try a simple search on here. I searched for \"php validate phone number\" and came up with some nice answers.  http://stackoverflow.com/search?q=php+validate+phone+number",
        "please mention the reason for Invalid entry in OP.",
        "You'll need to update your leap year check - if the year is divisible by 100 and not by 400, it's not a leap year (2000 was; 2100 won't be)",
        "So, uhh, what's the deal here?",
        "Solution: Use Java to connect and fetch results from http://tryruby.org.",
        "see this http://stackoverflow.com/questions/163998/classical-set-operations-for-java-util-collection",
        "LOL  So Funny...",
        "Why are you \"not able\"? What have you tried? Are you using a JSON parsing library? Did you get compiler errors or runtime errors? If so, then what are the errors?",
        "http://stackoverflow.com/questions/338586/a-better-java-json-library",
        "I want the different instances of the view controller to have a consistent appearance, so I don't want to change the font size.",
        "Please provide what kind of error you have. \"It error\" does not really help (and isn't even proper english), is it compilation error, runtime error, which error message, or no error but just nil object…?",
        "Should the last Return be `240` not `220`?",
        "@Irvin For every case does your result increase by 20?",
        "@raman a switch statement is not going to change anything here.",
        "@raman sorry its 240",
        "Why does the returned result go back to 40 when number < 5000?",
        "Use a binary search and a sorted table?",
        "there is no formula for this, your return values are in this order: 20.40.60.80.40.60.80.100.120.140.160.180.200.220.220 and as you see you have: 60.80.40.60.80.100 , there is no formula on the world for that piece if you x is increasing.",
        "@IrvinDua: Should the answer for <= 5000 be 100? (and so on for the following results).",
        "@Jon apologize for that ,please see edit now",
        "What you have tried so far?",
        "What do you mean by \"difference\"? Milliseconds? Days?",
        "Take a look at [Joda Time API](http://joda-time.sourceforge.net/).. Makes your life easy when working with Dates..",
        "Difference in days",
        "Days as in \"hours / 24\" or days as in \"number of midnights between time A and time B in a given timezone?\"",
        "What have you done so far? If you have anything, post it here and we'll try to help you work through it.",
        "If you are going to use this site, you should be posting the errors to your code, not asking for people to do things for you.",
        "At least a concise version of your html should be posted. **concise** and well formatted!",
        "can you provide a demo to prove you answer?",
        "That will also match 0, 00, 000, 0000 etc.",
        "Your first action should be to use a debugger, and/or put strategic `printf` calls into your code...  *not* to post your source code on StackOverflow and expect others to do it for you.",
        "No *way* are we debugging that wall of code. Just invoking it with no args is undefined behavior and will likely seg-fault, and it only gets worse from there.",
        "Search On Google Before Posting Question Here .",
        "http://php.net/explode, see the parameter list.",
        "Take a look at `date()`.",
        "-1 for making absolutely no effort whatsoever to answer this yourself before asking here",
        "You should edit your post to include the code here, in case the link goes out of date in the future.",
        "And do a fiddle.",
        "Please put some effort into your questions.",
        "*\"when i compile, i have many errors\"* Write small chinks of code, compile often.",
        "Have you tried something show us some code ..",
        "http://www.iopus.com/guides/winscheduler.htm something like this ?",
        "@Blue i was talking it in the sense of java and programmatic approach for it not for windows task scheduler",
        "If you've copied this from your ThoughtWorks interview question, I'd like to ask you to take it down. The question was sent to you in good faith that you would not announce it in the internet. We're being flooded with copy cats now.",
        "homework? Investigate `cin` and `for` or `while` loops",
        "Make a loop and input numbers. \nAnd learn proper indentation.",
        "Fixed indentation of source code.  Hopefully, this can get some on topic help now",
        "@OP: please try to explain your requirements better, they're hard to understand.  If you turn this into a decent question I'll take a crack at it",
        "There is lots of confusion in your code. You have things to fix even before you try an input ten numbers into an array. First confusion, which array? You have an array here `Array *mass[10];` and you have an array here `mass = new int [SIZE];`. I doubt you need both, so which is the correct one? I suspect that what you really need is to replace `Array *mass[10];` with `Array mass(10);`. With this change you will have one Array object which contains an array of 10 masses. Does that sound right? I don't think anyone can answer this question until you clear up which array you are talking about.",
        "yes, it is homework",
        "This question is way too broad. Please ask specific questions that can be answered.",
        "Have you tried anything at all?",
        "i haven't tried anything yet.",
        "Just add another cell.  3 tds.  Make an attempt as it will answer 10 questions for you.",
        "IE doesn't support box-shadow. Live with it or make your own.",
        "What exactly isn't working? Could you post a screenshot of the page in Chrome and in IE for comparison?",
        "What version(s) of IE are you trying to support?",
        "\"What can I do??\" Isn't a helpful question. Please be more specific.",
        "http://stackoverflow.com/editing-help read it first, edit your question.",
        "Next to editing tools, please use the search, looks like your question is a duplicate: [limit results in jquery ui autocomplete](http://stackoverflow.com/q/7617373/367456)",
        "Please iterate all your requirements so that help can be given in full :)",
        "This is why most email clients will _not_ download images without permission.",
        "nasty thing to do",
        "**SQL Injection**",
        "wall of ugly code, down vote",
        "+1 for u... ugly code.",
        "seriously, learn about coding conventions and stick to them *at least* in some cases. (Spaces are *not* poisoned!)",
        "Some tips for making your code readable: 1. Use more than one space for indentation. 2. Don't put multiple statement in one line. 3. Put spaces around operators. 4. Instead of duplicating blocks of code, put it in a function.",
        "Can *you* even read your own code?!",
        "The first time upvec is even mentioned in the big wall of code is on the line where libc is telling you that it's wrong. How are we supposed to figure out how it's wrong when we don't know what it is and how it's been handled before?",
        "In what environment is this running? There's no evident redirection here. And what the devil is `t`?",
        "@Grant Thomas. microsoft visual C# 2008. t is for my soundplayer ^_^",
        "Wouldn't a [`WHERE`](http://msdn.microsoft.com/en-us/library/ms188047.aspx) clause work?  Am I missing something?",
        "So we should extend a query we cannot see?",
        "-1....crazy homework question; type `WHERE` and press F1",
        "Say \"shhhhhhhhh\"",
        "`-1` for overlooking dozen of duplicates ([1](http://stackoverflow.com/q/1048225/944681), [2](http://stackoverflow.com/q/1158100/944681), [3](http://stackoverflow.com/q/3709104/944681), ..)",
        "Maybe you should mention you are talking about a commercial solution...",
        "Looks like an ad has been blocked here",
        "Much easier ways than buying software to do this.",
        "var x = Math.random() * theRangeTop | 1;   will give only odd integers",
        "-1 This is a terrible solution. Please stop using the ancient `mysql_` functions. They are soon to be deprecated.",
        "Obviously, use $wpdb->query() instead ...",
        "I would also suggest to stop using `or die()`, it's a horrible way of handling errors.",
        "And don't use the error suppression operator `@`!",
        "[What have you tried?](http://whathaveyoutried.com) If you're not going to show any effort, why should I? Also, do you mean Java or JavaScript? The two are not the same.",
        "I did alot of attempts and its javascripts \nhere is my attempts \n\\$[a-z0-9&-_]+[ ]  but it doesnt work",
        "This is not a programming question. Try google. And read the FAQs!",
        "What is confusing in ZXing? I believe ZXing is your best option.",
        "In other cases, I would recommend using a DOM parser. But here, the you actually have a fully functioning, deeply integrated DOM parser inherent to the problem... and you still want to use regexes?",
        "I've been around C# for quite a while. In this case I have a lot of time on my hands. Word of advice; if you ever want to learn something really well, do it your own way. At worst you will lose time, but you will learn a lot compared to going the easy route.",
        "lot of time on your hands? Well, lucky you :)",
        "Try to put only the interesting part. People here are not going to read all of that.",
        "Could you separate the question into sentences? Short answer: it does make sense. [Switch statement](http://en.cppreference.com/w/cpp/language/switch)",
        "This question has been linked to a bug on meta http://meta.stackexchange.com/questions/153048/code-indenting-just-appears-to-be-broken-here due to some issues with formatting the actual code which several of us seemed to be attempting to fix.",
        "Consider first stating with \"basic web research\".",
        "This is a biased and misleading answer.  TFS is an incredibly extensible platform from SCM, Work Item Tracking, Build, and Alerting.  Before making comments like this, make sure you are fully educated on the subject instead of attempting to push your biased notions on someone else attempting to learn.",
        "This is possibly the most wrong answer I've seen on SO.",
        "i dont have any idea of making webcalls , so waiting for solution.Pls help",
        "there are many links for json parsing ........try yourself first...one of the link is http://www.androidhive.info/2012/01/android-json-parsing-tutorial/",
        "learn how to parse json string from this site http://www.androidhive.info/2012/01/android-json-parsing-tutorial/",
        "I did homework for you: [Android - JSON Parsing](http://stackoverflow.com/search?q=android+json+parsing)",
        "please tell me way first to get desired json object , parsing is secondary thing but how to make call first to get json object?",
        "I would request you to search Google and stackoverflow.com before posting the question. you would always found solution and sample code for generic problems.",
        "wait i ll give you all code..",
        "my bro using a substring is not a solution, cause uri_path is dynamic !",
        "We are not mind readers.  Post your code.",
        "Great job, so where is the question?!",
        "if you want to turn off the timer when it's \"game over\", usually there's a `cancel()` method or something depending on what timer code you're using. if you want to reset your activity when you leave, you use the `finish()` method, even better when using intent to go to another activity is adding an intent flag to clear the activity stack `intent.setFlags(Intent.FLAG_ACTIVITY_CLEAR_TOP);`. ofc, it's hard to know what's going on here. i'm guessing.",
        "I don't want delete the local notification rather then badge.",
        "How is this the solution? All you are doing is hiding the table view that should show the filtered results and showing the unfiltered tableview instead.",
        "badass, man....",
        "How does this code show a preview?",
        "why do you want to switch to linq without learning it first? at least basics?",
        "What have you tried and failed (in \"failed\" I mean every unexpected behavior that's known to you. So if you update question before it's closed let's know exactly how has failed)?",
        "By the way, use `nullptr` instead of `0` now.",
        "I would vote you down for not performing any basic research. All this should be covered quite early in your book.",
        "What is your question?",
        "@LaurynasBiveinis The question was quite obvious - The correct use of pointers.",
        "@LightnessRacesinOrbit I politely asked readers not to vote anything for it. If you don't want to contribute, please don't and leave a comment that it is a trivial post and should be Googled more! Show some professional courtesy!",
        "@jjabraham: Just asking people to alter the rules and policies of this website does not make it so. _You_ show some professional courtesy and perform even a morsel of basic research before asking me to devote my professional time to you for free!",
        "\"The correct use of pointers\" is not a question, and \"how do I use pointers correctly?\" is too vague for this Q&A website.",
        "You will need to derive a formula that prints spaces in addition to the one you are using to print asterisks. Also, the inner loop can be replaced with a call to [`str_repeat`](http://php.net/manual/en/function.str-repeat.php).",
        "possible duplicate of [How can I create a pyramid from using php?](http://stackoverflow.com/a/12800236/1226894)",
        "show some code for real help",
        "Why does this _crash_ ? Do you get a error message? If so, what is the error message.",
        "Why did you change user accounts to ask this? With all due respect, I think [Oscar Jara's comment](http://stackoverflow.com/questions/13253556/adopting-variable-values-from-html-data-atributes#comment18062244_13253862) under his answer is right. You seem to be asking about things without really understanding any of it. Seems like you need to learn some basics first.",
        "...also, you posted this question earlier *(but after your original one)*, but then deleted it when people started asking you the same sort of questions.",
        "_\"I will NOT redo all code to try to move all various parts of codes in separate thread\"_ - Then you aren't going to be showing any progress. A blocked UI is a blocked UI. Android is more stubborn than you: either use Thread/Handler/AsyncTask or give up. You aren't going to be handling any messages to/from other activities, either, since they are delivered on the UI thread.",
        "http://whathaveyoutried.com/",
        "If you have a specific idea in mind try it and come back with specific problems. For example the refactor you don't want to do may be simpler than you expect (have you really looked hard at how it could be done?)",
        "What error! Do mention that.",
        "Could you give us the error please?",
        "which error you are getting?",
        "No, please, don't tell us. We love cliffhangers.",
        "@deceze This way is more of a challenge",
        "Vague, incomplete, overly broad. Voting for close, sorry.",
        "If you give us something a bit more concrete we might be able to help...",
        "Please provide some sample data. You may also find it valuable to read [this question about good `R` questions](http://stackoverflow.com/questions/5963269/how-to-make-a-great-r-reproducible-example).",
        "Yes it is the same.",
        "-1 for lazy question ...",
        "Do you need to know how to add/remove CSS classes?  Or code your CSS so that it displays in the way you describe?",
        "Could we see what you currently have please?",
        "since you have jquery, try the addClass() and removeClass() functions. That way you can manipulate your links into adding/changing css properties of your container",
        "A long paragraph with no code or error messages is usually a poor question -1",
        "possible duplicate http://stackoverflow.com/questions/12229413/javascript-change-css-file-dynamically-cookie",
        "**Solution:** http://jsfiddle.net/gB8Lg/",
        "THANK YOU @Coby That's EXACTLY what I needed! You're awesome!!!!!!!",
        "I can't follow what you're doing.  Please clean up your format and don't exclude the \"select statement here\" code.  What's your end goal?  Don't just tell us what you're doing -- tell us also what you're trying to do.  There might be a better way.",
        "i make some edit to make it clear",
        "That hasn't made it clearer - what's the point of a load of trailing braces!",
        "put your code all together in one code block.  Hit ctrl+K to format it and check the preview to make sure it looks formatted -- if not, hit ctrl+K again.  Then, tell us what the code block does in a separate paragraph, not in-line between each line of code.  And DON'T exclude the \"select...\" statements you're showing.  I still have no clue what you're trying to achieve from your loops.",
        "Where does n come from?",
        "come from the another method  n= 10 or 20  depends to patient visits",
        "I think you need to spend some time formulating your question and imagine someone else reading it. It is hard to read and your edits are so major that every time I revisit this question I have to read it all again to see what has changed. This makes it all too much effort.",
        "anybody ?\n\nor should I ask at \"heapoverrun.com\"\n\nget it XD",
        "It smells like a homework to me ;)",
        "And what is the question? If it is \"Can you do it to me?\" - the answer is \"no\".",
        "Do your own homework - read the chapters you're supposed to and pay attention in class.",
        "I hope your next question is better.  Please study your text and do your own homework.",
        "That's not a question. That's a copy-pasted homework assignment.",
        "This is my answer, but it has some mistakes. Therefore I cannot complete.",
        "What's the problem? Where are you stuck?",
        "The reference is between the same column. That can hardly work as a hierarchical relationship.",
        "There is a lot of code here and little description of what problem you're having. What do you mean by \"the issue im having is doing this with jquery/ujs\"? Is there a JavaScript error? Does the form render properly? Remove code that isn't relevant to the problem and describe the UJS problem more.",
        "<sarcasm> 100% real question. </sarcasm>",
        "You should edit your question to specify what you already tried to solve your problem.",
        "possible duplicate of [Oracle SQL pivot query](http://stackoverflow.com/questions/4841718/oracle-sql-pivot-query)",
        "Just dead wrong but I can't down this vote until my reputation is 125, **help me out guys**!",
        "Are you viewing output in the browser?",
        "in html a new line <br>, browser read\\interprit html not plain text",
        "Are you trying to echo out a `\\n` in a HTML document? If you are, you'll need to use `<br>` instead.",
        "And this: http://stackoverflow.com/questions/2674703/php-trying-to-create-a-new-line-with-n?rq=1",
        "-1 for not posting the errors and not narrowing it down.",
        "What are you asking?",
        "What errors do you get? What did you expect? Right now here's just a lot of code, put a little more time into explaining your problem and solution attempts.",
        "I am so sorry. I posted the errors.. My solution at first was to try vector but I want x,y values to be unique. So I change it to set for now.",
        "Evil: a class named \"Main\" when the \"main\" function only differs in case by 1 letter.",
        "You forgot to include the link and a license to a decent [OCR](http://en.wikipedia.org/wiki/Optical_character_recognition) program with your post.",
        "@Joe lol . And Chailie - It would help tremendously if you structured your post in such a way it's easy to follow the variable you're asking about, you're posting quite a lot of code.",
        "Hi,Could you understand what i said?Do you think the expression is clear enough?Because i have received so many down vote since i post this problem.",
        "Yup, there's a converter [right here](http://ca2.php.net/manual/en/index.php).",
        "Show us some code.",
        "@Dibya I have update the code,thanks",
        "The answer is literally the first hit if you google \"skypeKit\"!",
        "I have already done it",
        "Any question? Also make sure you enter numbers to textboxes",
        "It would help a lot if you'd give a little more description of the problem. Is the title what you get when you try to compile this, or run it, or what exactly?",
        "What is your question?",
        "replace your Convert.ToInt32 with int.TryParse() http://msdn.microsoft.com/en-us/library/system.int32.tryparse.aspx",
        "Hmm, I get an \"Everything up-to-date\".",
        "How is your question related to mysql?",
        "and where is your problem? What have you tried that didn't work? Please try something and come back when stuck",
        "Show us your PHP code you've got so far.",
        "Lots of downvotes but no comments, not very helpful",
        "If you use `with` then `f.close()` is redundant - according to http://docs.python.org/2/tutorial/inputoutput.html: \"It is good practice to use the with keyword when dealing with file objects. This has the advantage that the file is properly closed after its suite finishes, even if an exception is raised on the way.\"",
        "what he's closing was another file handle not opened through the `with` statement",
        "You need to optimize your loop.  You should provide information about what you are doing in that loop.",
        "That isn't valid PHP.",
        "Obviously: don't execute such long-running code there. It's impossible to give any more constructive advice without knowing the details.",
        "@AndreKR I think he ment to write it in pseudo code",
        "@Hussam That's rather imaginary code.",
        "@Hussam - sarcasm",
        "one idea - run [BIG LOOP] in the background.",
        "@Rubens pseudo code is more or less by definition imaginary, as long as it makes understanding code easier",
        "Which line produces the error?",
        "Prob+=self.featureCounts[[label][self.featureNameList[self.featureVectors.index(featureValue)]][featureValue]]/self.labelCounts[label]",
        "with that many echo's I'd opt for an array + foreach",
        "I think you should try to do it by yourself before..",
        "What is your problem?",
        "$search is a boolean var, as you defined.",
        "Can you explain what you are trying to do? The fact that you are getting a `$_GET` value based on some `$_POST` is confusing. Can you also provide the error message you are getting?",
        "What you have tried? Can you show us the relevent part of the code?",
        "Please provide more information. How do you save the active time period? Seems simple to check the current date/time versus a database in PHP where you save your ads. -- What are you using in detail?",
        "answer is.. REGEX!",
        "I'm scared of questions with unnecessary constraints. :)",
        "also, you have a leading comma - what do you consider the *second term* - passage or null?",
        "And I want a pony.",
        "RAM usage? RAM usage is irrelevant in this context. The problem is that a number literal is parsed into a numeric value, they are not the same thing. 01 or 1 are both parsed to 1 (excluding the fact that 0 usually specifies an octal number)",
        "More succinctly ... WTF?!?",
        "EDIT: Oops, the snark just leaped forth into the textbox. De-snarked.",
        "i have edited this comment so it makes more sense.",
        "Excuse me, but it still does not make any more sense than it did before... Why do something manually, when you have the tools to do it nice?",
        "We do not understand what you need. Could you rewrite your question more clearly ?",
        "-1 for completely changing the question.",
        "**welcomemsg[]**, and ***never completely rewrite a question from scratch.*** It utterly invalidates any comments or answers posted prior and generally makes for totally useless content for StackOverflow (not that this is a high priority for you, but it should be).",
        "Hello, I'm really sorry about that and I've edited it back.",
        "How can I get voted down too much? :/",
        "Do you mean \"exits with error\" if so, what is the exact error?",
        "@DanF my best guess is that it accesses an element from `B->child` that is not allocated.",
        "This line: `page B = init(B);` seems odd.",
        "@jedwards I'm willing to bet that is the root of the problem",
        "@jedwards: It is odd because function parameter is completely redundant. But there's no problem with it.",
        "You need to show us what you've tried so far.",
        "The usual way, you just set the `SqlCommand` object's `CommandType` property to `StoredProcedure`.",
        "There are so much documentation around, you could try searching first, and then come back with specific code / questions when you have a problem.",
        "This only aligns your button to the right. Not the bottom right.",
        "you can do that by trying!",
        "Accept an answer? I'd appreciate it.",
        "-1: That launches an external program to read the file and doesn't help me open it so that I can read the contents in my own programs.",
        "Assign a value to the variable `answer` before you use it.",
        "Please next time try to search for error (CS0165) before asking question... And make sample smaller... even smaller than small... 2 lines should have been enough for this question.",
        "`if ($_POST['nt'] == \"\") { echo 'error'; }`",
        "possible duplicate of [How to prevent submitting the HTML form's input field value if it empty](http://stackoverflow.com/questions/8029532/how-to-prevent-submitting-the-html-forms-input-field-value-if-it-empty) (…or any similar question here on SO; e.g. http://stackoverflow.com/questions/10516122/how-prevent-submit-if-input-are-empty-with-javascript)",
        "not hard to research basic form validation in a simple web search. At least show a little effort before posting a question here",
        "Not seeing any code.",
        "Very bad design if you want to implement it that way. Just make a default sort if no sort variable is provided.",
        "Have you tried with \"\\n\"?",
        "Is it a homework?",
        "This is OOP theory, not an actual programming problem. Please read this [Inheritance](http://docs.oracle.com/javase/tutorial/java/IandI/subclasses.html). Or you can read about Inheritance somewhere else",
        "@user1870638 Thanks provide.",
        "What is wrong with your [current question](http://stackoverflow.com/questions/13681277/want-to-retrieve-string-from-my-array/13681290#13681346)",
        "It seems as other guy.. asking the same question.. maybe colleagues :)",
        "seems like this question quality is too low.",
        "describe cms, what_have_you_tried and some code?",
        "there are # tags on all download links,what download code are you using?",
        "OK I have now added some more code",
        "Change it to what?",
        "How do you mean change the type?",
        "<input id=\"email\" type=\"email\"> by any chance?",
        "Copyright laws?",
        "Which app are you considering doing this for?",
        "Add a narrative",
        "Welcome to StackOverflow.  Your answer would be improved if you described the code a bit further.  What differentiates it from the one (very high scoring) answers on this old question?",
        "No, that will print the bits. Not reverse them.",
        "What has inner class got to do with sorting? And what has sorting to do with the question?",
        "Are you expecting `$click` to contain a value? what makes you expect that? You need to explain more about what's going on elsewhere in the program than just this; we really don't have enough to go on here to make any helpful suggestions.",
        "@BrianTompsett Don't bump this garbage. Leave it alone for users with delete-vote privileges.",
        "Out of curiosity, why all the down votes? I explained how to duplicate the problem, and how to fix the problem in the example case. Note well: Apple does *not* prohibit links to sanely named files (29x29.png for example). Review the documentation for the linked article.",
        "I think you answered the wrong question?",
        "@William - the question was about the error *\"Could not change executable permissions on the application\"*. Links using required names pointing o the PNGs will cause it. The fix is to *not* use links. Apple does not tell you that.",
        "Is there a problem with the code? If there is - please say what it is.\nIf you are interested on reviewing it - [CodeReview.SE](http://codereview.stackexchange.com/) is better for it. If you have a specific other question - please add it.",
        "no, there is none, it is currently taking random numbers and sorting them, i want to give input of ordered list etc mentioned in the question for it to sort., how do i modify this code to achieve that",
        "Ok, but what is the question? How to create these inputs?",
        "yes, that is the question",
        "@amit right now, it is doing  `int N = Integer.parseInt(args[0]);\n    Double[] a = new Double[N];\n    for (int i = 0; i < N; i++) {\n        a[i] = Math.random();\n    }`",
        "seems like \"do my job\" question.",
        "I tried fopen and file_get_contents",
        "I am a newbie, maybe you can suggest me what functions to use",
        "[json_decode()](http://nz1.php.net/manual/en/function.json-decode.php) springs to mind",
        "like Dagon said, json_decode it and walk the tree.",
        "StackOverflow is not a code-writing service. Please read the [guide to asking a good question](http://tinyurl.com/so-hints) and show [what you have tried](http://whatyouhavetried.com).",
        "`Project/Properties/Application/Output Type <-- Console Application`",
        "I'm not a fan of this proposed solution at all. You're now having to maintain the set of scripts in (at least) two places",
        "This pretty much defeats the purpose of the bundling, don't you think?",
        "Bundling already works this way. If you run the project in debug mode each CSS file is loaded individually, however when you run in release they're combined and minified into one. The code within the if block is identical to what's rendered on the page automatically in debug mode.",
        "This will cause infinite loops and should never be used.",
        "@Logan unless you fancy infinite loops",
        "Java is not an acronym. ;-)",
        "It depends on your experience. The biggest unknown factor is the daily update. There are many ways you could do this. Did you have anything in mind?",
        "Not sure exactly... I have never worked with an online type of app before... Anything I have done has been simple apps or games regular desktop based...",
        "Please show the exact code you're using. What exactly does \"doesn't work\" mean?",
        "You have to check into the javascript for rating",
        "can you please print size(a) and size(b) and size(r)?",
        "How? I did `display(sprintf(' sizes: %d %d %d',size(a),size(b),size(r)));` and did not get anything that would help?",
        "just type: size(r)",
        "i got `ans = 1     7 ans = 1     9 ans =1     1` for a b and r respectivaly. Does this mean that instead of `b(7)` i need `b(1,7)`?",
        "there isn't a problem there. Which makes me suspect that you haven't posted the real sizes of a,b and r. can you post the code of myFunction?",
        "Just did, the commented for loop is what i am trying to make work. The code actually writted is the same just without the use of a for loop.",
        "http://stackoverflow.com/questions/244506/how-do-i-check-for-valid-not-dead-links-programatically-using-php",
        "http://stackoverflow.com/questions/8843129/php-get-headers-a-good-way-to-tell-if-a-site-is-up might help",
        "where the down votes necessary ?",
        "Where do you attempt to count the zeroes...?",
        "Please mention where is the problem?",
        "For one, it's not recommended to drop questions and leave. Since there will be people asking for clarification. Questions tend to get deleted if they are unanswerable - which is the case if the OP disappears and does not stay to answer comments.",
        "If you aren't going to bother to put in any effort, why should we bother to help you?",
        "WPF or WinForms?",
        "You've also not actually created any `TextBox`es, only an array of the specified size to hold them...",
        "do you know how to read file? how to write to it in general?",
        "The broad outline is:  Open both files (b.txt for WRITING, a.txt for READING).  Read from a.txt; Write to b.txt; repeat until done.\n\nWhich steps are you having problems with?",
        "I know it is used fputs(filename, content);",
        "Also: **SQL INJECTION VULNERABILITY!**",
        "Also: **mysql_* functions are deprecated!**",
        "Why this must help me? It's not an resolving.",
        "what is `loop`?what is `allrowcol`?what are you trying to do?.am not able to understand ur problem! Edit ur question before it gets closed!",
        "Use a database. SQLite works well. There are only several thousands of examples of this on the internet. Doing some research will serve you well.",
        "*\"I cant use too sophisticated stuff that I haven't learned yet because then it is suspicious\"* Oh, that is just *wonderful*.",
        "Do it for me, but make it look like I did it!",
        "What is wrong with that code?",
        "(Dumb) cheaters never prosper...",
        "Cant get the code to convert Morse to english, including | for spaces",
        "Your question could be greatly improved if you asked a specific question about it. What parts of this are you struggling with? What is your expectation if someone were to answer this? As it stands right now things are a bit vague.",
        "You would think students these days would be a little more discreet when asking online communities to do their homework for them...",
        "I need the code to convert something like: \".----\" into 1",
        "please use the search.",
        "Read the API spec for NSDate.",
        "You're not doing very well with your questions you've asked. Perhaps you should try reading the [FAQ](http://stackoverflow.com/faq)",
        "Bookmark [this](https://developer.apple.com/devcenter/ios/index.action), and observe the \"search\" box in the upper right corner.",
        "\"Otherwise seems to serve no function\": not strictly true. See above discussion.",
        "Then stop using them. Port algorithms, not code.",
        "The errors are obvious, more in line 6.",
        "Important note: `int arrLen = sizeof(arrayInput)/sizeof(int);` does not work in `sortInt()`. The argument the function receives is a pointer to the first element of `array`, so you set `arrLen` to `sizeof(int*) / sizeof(int)` regardless of the array's length. You must pass the length as a parameter.",
        "6 nano seconds on the module running at what clock and what type of division algorithm is it using?",
        "I think this post causes a lot more problems than it solves.",
        "This is a question platform, not an education one! Do you have a question according a certain coding problem? What have you tried so far?",
        "Oh i'm really sorry... I'm new on StackOverflow and i didn't knew about this. Sorry.\n\nI tried with BouncyCastle and RSACryptoServiceProvider (.net Framework), but I don't have the same results. The function that I want to reproduce is the \"verify\"",
        "Run the code and see if PHP complains about it.",
        "you are using `(` and `)` instead of curly braces.",
        "what about real code and real error messages?",
        "Its really long. You wouldn't care to read it. So i shortened it",
        "Let us decide whether we want to read it or not. Always post full error messages!",
        "@user1889099: If you are able to decide what information is necessary to solve that problem, and what not, I wonder why you weren't able to solve the problem yourself...",
        "Okay. Im sorry. I have posted the full code.",
        "Reduce your example to make it minimal.",
        "What we were trying to suggest: Always strive to post a http://sscce.org/",
        "[Lol](http://stackoverflow.com/questions/13953045/c-file-handling-error). Cross posting is not welcome here (even if it would be possible). Especially not under different user names. Please take your time and look how others ask questions here and read the FAQ.",
        "Sorry. Both are different issues. Why did u bar me from asking qns. Should i delete this thread",
        "possible duplicate of [Can't push to git hub](http://stackoverflow.com/questions/13965622/cant-push-to-git-hub)",
        "Looks like an exam question. [T-SQL operator precedence...](http://msdn.microsoft.com/en-us/library/ms190276.aspx)",
        "Because include_once is a language construct, and not a \"real\" function, the parenthesis are optional.  Not sure why adding them fixed it for you.",
        "how can i post error when it is like this :http://img689.imageshack.us/img689/681/errordb.png obviously some structuring error and linq expert would see it immediately",
        "@MonsterMMORPG: you can just post that error. Also helpful to hover over the red squigglies and see the text, or get the compiler error from the error panel of Visual Studio.",
        "@siride http://img69.imageshack.us/img69/6442/6errorsv.png",
        "What kind of question is this...?",
        "I'd like realize sweep page like this but I don't where's starts.",
        "its page curl effect",
        "It is risky to `eval` user input - anything could happen. I strongly recommend to not do this.",
        "Have you read the logs that are mentioned? Perhaps these contain something usefull.",
        "ruby is installed by Apple on OSX albeit not the latest version",
        "Yes i want to install latest version",
        "In my experience, most of the times this is caused because you have to enable the command-line tools in xcode, and sometimes this has to be repeated after updating xcode as well. Now if that is the case, this would be very clear from the logs as well. Good luck.",
        "thanks. now i cannot seem to find any erb files.....",
        "why reinvent the wheel?",
        "@punker76 it's not reinventing it's implementing",
        "ok, but why not using the visual states with the visual statemanager?",
        "@punker76 What do visual stattes and statemanager use? Don't they use DispatcherTimer and work with similar style?",
        "[Google](http://www.google.com) it!",
        "I'll tell you what I wish this worked. It doesn't though: I just tested it. I don't believe in downvoting but dude check your answers before posting. \"Expression is not an integer constant expression\"",
        "This just doesn't work",
        "Can you add your javascript code",
        "On your site, jquery and many scripts fail to load. See the js console",
        "As well you have not defined the showhide function. Tested your script",
        "just a typo :D (\"scripts\" instead of \"Scripts\") ... 3 days of \"debugging\" and this was the problem, I now go to shoot myself. sayonora",
        "[What have you tried](http://whathaveyoutried.com)?",
        "Can't fathom properly what is being asked, can you just edit and be more clear?",
        "The syntax coloring should be a strong hint...",
        "Almost certainly secondary damage, yes. You should create an isolated 10-line testcase that exhibits the issue.",
        "\"My code isn't properly highlighted, and browsers can't parse my code! It's certainly the fault of the highlighter and parsers!\"",
        "@Tinctorius, may I ask why you consider this insult essential? I, like many other programmers, post diagnostics to ask about why my code is causing trouble, not a complaint that Firefox and Chrome don't legitimately handle JavaScript.",
        "What insult? I only see a parody of the conclusions you draw from your findings.",
        "@Tinctorius, I acknowledge that browsers may be assumed to have secondary damage in some places, but I would scarcely infer that Chrome and Firefox would have the same secondary damage; ergo my reference to secondary damage was to fault in my code rather than the browser. I invite others to my open source software collection at http://JonathansCorner.com/etc/etc2.html and see how many of the projects are consistent with a degree of developer who blames problems on the environment.",
        "There is no method finishall.",
        "`goto` statements? REALLY?",
        "And why a one-liner anyway?",
        "looks like there is no goto in python...",
        "This looks like it would go into an infinite loop if there's any line in the file that leads to `cp_success` having the value 0",
        "`a += b` is shorthand for `a = a + b`.",
        "you want to convert from string to stringarray for post values in listview ??",
        "TechEnd : Yes....can i do that?",
        "Its \"analyse the other users code for\" question",
        "Use a hexdump tool.",
        "used http://www.emvlab.org/hexdump/upload/ and got my string, but no program that just give me a preview?",
        "onPause() ll be handled by an android OS. you need to call onPause() in code and do your stuffs",
        "Which IDE do you use?",
        "I use Eclipse  IDE",
        "I think your using eclipse juno latest version.",
        "Minigore is a 3D game.",
        "This question is way too broad to be answerable.",
        "Just make a 3D game with a camera angle of what you see here...There is really no such thing as a 2.5D game...",
        "Minigore can't change the angle of camera so I think it is a fake 3D game.",
        "This actually is a very confusing question...",
        "\"Under 10s\" in terms of what?",
        "and you should at least post a link to the problem or the text",
        "[**So many duplicates!**](http://stackoverflow.com/search?q=pass+values+from+%22javascript%22+to+%22php%22+javascript)",
        "@Neal: Well, asking here on SO four hours earlier: [How to pass a value from javascript function?](http://stackoverflow.com/questions/14139955/how-to-pass-a-value-from-javascript-function)",
        "@hakre **oy...**",
        "Post your code and Logcat...",
        "lo(n)gcat ? http://blog.seanbonner.com/wp-content/uploads/2009/07/1246818021845.jpg",
        "See your logcat is having error as `NumberFormatException` that means your `ConvertDollarToRup()` is having problem.So please check it.",
        "replace `int convertrup = Integer.parseInt(rup);` from `String rup = dollars.getText().toString();\nint convertrup=0;\nif(rup.length() >0 && rup !=\"\"){\n int convertrup = Integer.parseInt(rup);\n}else{\nconvertrup=0;\n}`",
        "thank you work fine but when i was clicked on apps icon i thought gui should be run.",
        "We are talking about how to validate words not characters , bad answer i think you shouild read question carefully",
        "Please, edit the question into proper case (not all caps), then we can look at your problem!!!",
        "Ok, now it's not killing our eyes anymore. Thank code for http://www.convertcase.net/.",
        "Downvote for zero effort",
        "join the two tables, then you just need `group by` and `max`",
        "Hopefully some robots here will be able to work out your paste and help you ;)",
        "Those properties appear to be (potentially empty) XML nodes. Can you give an example of the XML itself?",
        "As you can clearly see from your dump, `lead-commission, expire-date, manufacture-date` are XML objects... You must go deeper!",
        "Try to print the `lead-commission` object first.",
        "can show the XML file data once...",
        "certainly you are wrong, that's not possible, re-check everything",
        "I tested it again, and I have no idea how it is working, but the entry is getting in the database!",
        "**http://php.net/language.basic-syntax.phpmode** - and please check the editing tools, you can quite easily paste code, try CTRL + K.",
        "As mentioned in some of the other posts, you shouldn't call `resignKeyWindow` directly.",
        "answer the questions before you vote down...",
        "if this is the original code you have a typo in echo line",
        "@SirRufo   what you mean by that? I have written every code..",
        "What he's actually asking for is `href=info.php?id=$email\"` and possibly someone to write `info.php` for him.",
        "Modifying core files is not advised",
        "What have you done already?",
        "None of the answers address: \"it takes time which should be **in users country**\"",
        "@MikeB yes sir exactly... can u help me with that?",
        "This is something you could find with a single Google search.",
        "Look at the brackets on the first if.",
        "I don't know where to start.",
        "Surely the error message gave you a line number? You open a bracket, you close a bracket.",
        "Do you want to convert target of your project or give support in your project upto API-16 or you just want to install API-16 from your SDK Manager??"
    ],
    "CommentLabel": [],
    "Score": [
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -25,
        -25,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -11,
        -11,
        -24,
        -8,
        -6,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -13,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -9,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -11,
        -11,
        -8,
        -8,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -8,
        -8,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -10,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -8,
        -6,
        -14,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -9,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -10,
        -17,
        -17,
        -17,
        -6,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -9,
        -9,
        -9,
        -9,
        -9,
        -7,
        -7,
        -7,
        -6,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -14,
        -14,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -12,
        -12,
        -12,
        -12,
        -12,
        -12,
        -7,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -11,
        -11,
        -11,
        -8,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -16,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -15,
        -15,
        -12,
        -12,
        -12,
        -9,
        -9,
        -9,
        -6,
        -6,
        -6,
        -13,
        -13,
        -13,
        -13,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -9,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -13,
        -13,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -13,
        -13,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -9,
        -9,
        -9,
        -9,
        -6,
        -7,
        -7,
        -7,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -9,
        -9,
        -13,
        -9,
        -6,
        -7,
        -8,
        -6,
        -6,
        -6,
        -28,
        -28,
        -28,
        -6,
        -9,
        -9,
        -9,
        -7,
        -7,
        -6,
        -6,
        -9,
        -9,
        -9,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -8,
        -6,
        -6,
        -9,
        -9,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -16,
        -16,
        -16,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -10,
        -9,
        -9,
        -6,
        -6,
        -6,
        -10,
        -6,
        -9,
        -9,
        -9,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -13,
        -24,
        -7,
        -6,
        -7,
        -8,
        -8,
        -8,
        -11,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -11,
        -11,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -8,
        -8,
        -8,
        -6,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -7,
        -7,
        -6,
        -6,
        -12,
        -11,
        -11,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -9,
        -9,
        -7,
        -7,
        -13,
        -13,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -13,
        -13,
        -13,
        -13,
        -13,
        -13,
        -6,
        -7,
        -7,
        -7,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -10,
        -10,
        -8,
        -8,
        -8,
        -8,
        -6,
        -22,
        -6,
        -9,
        -7,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -12,
        -12,
        -12,
        -7,
        -8,
        -8,
        -6,
        -6,
        -10,
        -10,
        -8,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -9,
        -9,
        -9,
        -9,
        -7,
        -7,
        -7,
        -7,
        -7,
        -8,
        -12,
        -8,
        -8,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -9,
        -6,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -11,
        -11,
        -7,
        -7,
        -7,
        -18,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -9,
        -9,
        -9,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -18,
        -18,
        -18,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -11,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -9,
        -9,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -9,
        -9,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -9,
        -9,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -7,
        -8,
        -8,
        -8,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -11,
        -6,
        -6,
        -10,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -7,
        -8,
        -8,
        -8,
        -11,
        -11,
        -9,
        -9,
        -9,
        -7,
        -7,
        -7,
        -11,
        -17,
        -17,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -11,
        -11,
        -11,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -7,
        -7,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -36,
        -36,
        -36,
        -36,
        -8,
        -7,
        -7,
        -16,
        -16,
        -16,
        -16,
        -16,
        -16,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -36,
        -36,
        -36,
        -12,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -12,
        -12,
        -12,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -13,
        -13,
        -13,
        -13,
        -13,
        -7,
        -7,
        -7,
        -7,
        -7,
        -10,
        -10,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -9,
        -9,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -11,
        -12,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -19,
        -19,
        -19,
        -19,
        -6,
        -6,
        -13,
        -13,
        -13,
        -13,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -7,
        -7,
        -6,
        -8,
        -8,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -9,
        -9,
        -9,
        -9,
        -9,
        -8,
        -8,
        -8,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -14,
        -14,
        -14,
        -14,
        -8,
        -8,
        -8,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -8,
        -8,
        -8,
        -6,
        -6,
        -8,
        -8,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -11,
        -11,
        -11,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -11,
        -11,
        -6,
        -6,
        -6,
        -6,
        -6,
        -13,
        -13,
        -13,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -8,
        -8,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -12,
        -6,
        -6,
        -6,
        -7,
        -8,
        -8,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -7,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -9,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -7,
        -7,
        -7,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -11,
        -6,
        -6,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -13,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -9,
        -9,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -24,
        -8,
        -8,
        -6,
        -11,
        -11,
        -6,
        -6,
        -6,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -11,
        -8,
        -7,
        -8,
        -8,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -21,
        -21,
        -21,
        -8,
        -8,
        -7,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -7,
        -7,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -9,
        -9,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -7,
        -9,
        -9,
        -9,
        -9,
        -9,
        -9,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -10,
        -10,
        -10,
        -10,
        -6,
        -7,
        -7,
        -8,
        -8,
        -8,
        -8,
        -6,
        -8,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -6,
        -6,
        -6,
        -6,
        -10,
        -10,
        -10,
        -10,
        -6,
        -6,
        -8,
        -8,
        -8,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -6,
        -7,
        -7,
        -7,
        -8,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7,
        -7
    ]
}